-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 30, 2026 at 04:25 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `university_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `academic_periods`
--

CREATE TABLE `academic_periods` (
  `id` int(11) NOT NULL,
  `academic_year` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `level_name` varchar(60) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `term_name` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `program_type` enum('diploma','bachelor','postgraduate') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'bachelor',
  `postgraduate_program` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `academic_periods`
--

INSERT INTO `academic_periods` (`id`, `academic_year`, `level_name`, `term_name`, `program_type`, `postgraduate_program`, `created_at`) VALUES
(1, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:20:32'),
(2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2025-12-28 11:20:32'),
(3, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:20:32'),
(4, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-28 11:20:32'),
(5, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:33:52'),
(6, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:34:03'),
(7, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:34:19'),
(8, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:38:37'),
(9, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:38:51'),
(10, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:46:27'),
(11, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-28 13:19:52'),
(12, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 13:42:54'),
(13, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 14:13:18'),
(14, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-28 14:13:32'),
(15, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 07:27:07'),
(16, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-29 08:08:32'),
(17, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-29 09:50:09'),
(18, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 09:59:03'),
(19, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-29 11:15:11'),
(20, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 11:26:52'),
(21, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 13:36:00'),
(22, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 13:51:06'),
(23, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 14:08:06'),
(24, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-30 14:21:32'),
(25, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2025-12-31 11:29:58'),
(26, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-31 11:30:09'),
(27, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-31 11:31:24'),
(28, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-31 11:31:35'),
(29, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'postgraduate', 'ماجستير البرمجيات المدمجة', '2025-12-31 13:50:33'),
(30, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-01-13 06:43:01'),
(31, '2025/2026', 'المستوى الأول', 'الفصل الأول', '', NULL, '2026-01-14 06:12:55'),
(32, '2025/2026', 'المستوى الأول', 'الفصل الأول', '', NULL, '2026-01-14 06:13:04'),
(33, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'postgraduate', 'ماجستير الحوسبة السحابية', '2026-01-14 08:08:08'),
(35, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'postgraduate', 'ماجستير الحوسبة السحابية', '2026-01-14 08:09:21'),
(36, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:16:34'),
(37, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:21:05'),
(38, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:28:55'),
(39, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:43:37'),
(40, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:49:04'),
(41, '2025/2026', 'المستوي الثاني', 'الفصل الثاني', '', NULL, '2026-01-22 08:49:44'),
(42, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:55:33'),
(43, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:56:25'),
(44, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:59:52'),
(45, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 09:01:41'),
(46, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 09:02:07'),
(47, '2025/2026', 'المستوى الأول', 'الفصل الأول', '', NULL, '2026-01-22 09:02:18'),
(48, '2025/2026', 'المستوى الأول', 'الفصل الأول', '', NULL, '2026-01-22 09:02:22'),
(49, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-02 08:44:01'),
(50, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-02 08:45:29'),
(51, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-02 08:49:18'),
(52, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-02 12:24:51'),
(53, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-02 12:25:28'),
(54, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 13:07:37'),
(55, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 14:02:12'),
(56, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:02:19'),
(57, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:09:37'),
(58, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:12:50'),
(59, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:15:42'),
(60, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 14:16:17'),
(61, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:16:39'),
(62, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:19:10'),
(63, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 14:20:35'),
(64, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:20:47'),
(65, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:25:08'),
(66, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 14:25:33'),
(67, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 14:26:05'),
(68, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-04 11:29:31'),
(69, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-05 08:02:11'),
(70, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-05 11:46:50'),
(71, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-05 11:47:21'),
(72, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-05 12:23:35'),
(73, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-05 12:32:20'),
(74, '2025/2026', 'المستوى الخامس', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 11:10:34'),
(75, '2025/2026', 'المستوى الخامس', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 11:10:34'),
(76, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:18:18'),
(77, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:18:18'),
(78, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:18:44'),
(79, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:18:44'),
(80, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:19:18'),
(81, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:19:18'),
(82, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:19:49'),
(83, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:19:49'),
(84, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:20:15'),
(85, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:20:15'),
(86, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-07 15:22:18'),
(87, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-07 15:23:11'),
(88, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 07:03:40'),
(89, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 11:07:51'),
(90, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 11:07:51'),
(91, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 11:07:51'),
(92, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 11:07:51'),
(93, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:07:51'),
(94, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 11:07:51'),
(95, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(96, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(97, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(98, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(99, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(100, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(101, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(102, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(103, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(104, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(105, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(106, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(107, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(108, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(109, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(110, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(111, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(112, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(113, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(114, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(115, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(116, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(117, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(118, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(119, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(120, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(121, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(122, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(123, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(124, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(125, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(126, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(127, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(128, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(129, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(130, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(131, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(132, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(133, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 12:01:02'),
(134, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:51:12'),
(136, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(137, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(138, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(139, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(140, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(141, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(142, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(143, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(144, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(145, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(146, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(147, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(148, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(149, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(150, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(151, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(152, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(153, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(154, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(155, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(156, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(157, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(158, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(159, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(160, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(161, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(162, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(163, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(164, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(165, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(166, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(167, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(168, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(169, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(170, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(171, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(172, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(173, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(174, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-09 07:25:50'),
(175, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-09 07:28:28'),
(176, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-09 07:30:06'),
(177, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-09 07:30:08'),
(178, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-09 12:58:58'),
(179, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-11 06:43:34'),
(180, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-11 06:43:34'),
(181, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:12:01'),
(182, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:12:01'),
(183, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:14:35'),
(184, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:17:57'),
(185, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:21:47'),
(186, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:21:47'),
(187, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-01 11:32:40'),
(188, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-01 11:33:25'),
(189, '2026/2027', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-01 11:33:55'),
(190, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-01 11:35:12'),
(191, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-01 11:35:12'),
(192, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-02 14:05:57'),
(193, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-02 14:06:34'),
(194, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-02 14:12:09'),
(195, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-02 14:13:37'),
(196, '2025/2026', 'المستوى الخامس', 'الفصل الأول', 'bachelor', NULL, '2026-03-03 11:57:16'),
(197, '2025/2026', 'المستوى الخامس', 'الفصل الأول', 'bachelor', NULL, '2026-03-03 12:01:36'),
(198, '2025/2026', 'المستوى الخامس', 'الفصل الثاني', 'bachelor', NULL, '2026-03-03 12:01:49'),
(199, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-04 07:39:32'),
(200, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 08:44:24'),
(201, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 08:44:27'),
(202, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 08:49:26'),
(203, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 08:49:26'),
(204, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 09:02:22'),
(205, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 09:05:02'),
(206, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 09:05:02'),
(207, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 09:08:55'),
(208, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 09:08:57'),
(209, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-04 09:11:57'),
(210, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-04 09:11:57'),
(211, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-04 09:11:57'),
(212, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-04 09:11:57'),
(213, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 11:46:09'),
(214, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 11:46:11'),
(215, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 12:44:08'),
(216, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 12:48:21'),
(217, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 12:53:00'),
(218, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 12:56:28'),
(219, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 13:06:22'),
(220, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 13:10:31'),
(221, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 13:14:35'),
(222, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 13:14:43'),
(223, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:30:24'),
(224, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:30:27'),
(225, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:30:55'),
(226, '2025/2026', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:31:46'),
(227, '2025/2026', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:32:43'),
(228, '2025/2026', 'المستوى الرابع', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:33:30'),
(229, '2025/2026', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:34:05'),
(230, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:34:39'),
(232, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:35:45'),
(233, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:37:42'),
(234, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:38:37'),
(235, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:39:15'),
(236, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:40:02'),
(237, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:40:53'),
(238, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:41:45'),
(240, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:44:25'),
(241, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:45:40'),
(242, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:47:09'),
(243, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:48:00'),
(244, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:48:44'),
(245, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:49:11'),
(246, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:53:00'),
(247, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:53:00'),
(248, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:53:00'),
(249, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:53:00'),
(250, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:54:48'),
(251, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:54:48'),
(252, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:54:48'),
(253, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:54:48'),
(254, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:15'),
(255, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:30'),
(256, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:30'),
(257, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:30'),
(258, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:30'),
(259, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:53'),
(260, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:59:29'),
(261, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:59:33'),
(262, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-12 10:11:48'),
(263, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-12 10:12:48'),
(264, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-12 10:12:48'),
(265, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-12 13:34:49'),
(266, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'diploma', NULL, '2026-03-12 13:36:26'),
(267, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'diploma', NULL, '2026-03-12 13:36:27'),
(268, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-15 14:32:16'),
(269, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-15 14:32:16'),
(270, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-15 14:58:43'),
(271, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-15 14:59:52'),
(272, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-15 14:59:53'),
(273, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-30 07:54:39'),
(274, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-30 07:56:16'),
(275, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-30 07:56:17'),
(276, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-31 08:06:56'),
(277, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-31 08:07:03'),
(278, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 07:19:45'),
(279, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 07:19:45'),
(280, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 07:46:53'),
(281, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 07:47:52'),
(282, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 07:47:52'),
(283, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 08:10:12'),
(284, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 08:10:12'),
(285, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-04 13:16:44'),
(286, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-04 13:16:44'),
(289, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-05 12:01:57'),
(290, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-05 12:01:57'),
(291, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 08:35:53'),
(292, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 08:35:55'),
(293, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 08:53:44'),
(294, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 08:54:53'),
(295, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 08:54:53'),
(296, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-06 10:22:25'),
(297, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-06 13:09:37'),
(298, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 13:10:20'),
(302, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-07 07:37:47'),
(303, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-07 07:38:24'),
(304, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-07 07:51:54'),
(305, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-07 13:13:18'),
(306, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-08 11:26:05'),
(307, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-08 11:26:05'),
(308, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-09 07:59:03'),
(309, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-09 07:59:03'),
(310, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-14 13:00:38'),
(311, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-14 13:00:38'),
(312, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-14 13:26:54'),
(313, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-15 07:32:18'),
(314, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-15 07:32:18'),
(315, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-15 08:08:46'),
(316, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-15 08:08:46'),
(317, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 08:54:38'),
(318, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 08:55:37'),
(319, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 08:55:37'),
(320, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 09:24:23'),
(321, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 09:24:25'),
(322, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 09:47:54'),
(323, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 09:47:54'),
(324, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:05:08'),
(325, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:05:08'),
(326, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:11:58'),
(327, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:11:58'),
(333, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'postgraduate', 'ماجستير ادارة الاعمال', '2026-04-18 10:38:48'),
(334, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:40:16'),
(335, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:40:16'),
(336, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 11:33:44'),
(337, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 11:33:45'),
(339, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 12:54:22'),
(340, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 12:54:22'),
(341, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 15:25:01'),
(342, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 15:25:02'),
(343, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 15:27:42'),
(344, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 15:27:42'),
(345, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-19 08:38:52'),
(346, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-19 08:40:30'),
(347, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-19 08:40:31'),
(348, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-19 08:59:31'),
(349, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-19 09:00:59'),
(350, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-19 09:01:00'),
(351, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'bachelor', NULL, '2026-04-20 10:07:39'),
(352, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', NULL, '2026-04-20 10:09:50'),
(353, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-20 11:55:57'),
(361, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 08:40:48'),
(362, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 08:42:16'),
(363, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 08:42:18'),
(366, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 11:44:36'),
(367, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 11:45:55'),
(368, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 11:45:55'),
(369, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 09:45:35'),
(370, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 09:46:40'),
(371, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 09:46:50'),
(372, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 13:25:13'),
(373, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 13:25:13'),
(374, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 13:27:20'),
(375, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 13:27:20'),
(376, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 09:57:55'),
(377, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 10:11:37'),
(378, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 10:11:38'),
(381, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-23 11:36:32'),
(382, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-23 11:36:32'),
(386, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 11:43:16'),
(387, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 11:43:31'),
(388, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 11:43:56'),
(389, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-25 13:15:36'),
(395, '2025/2026', 'الدفعة الأولى', 'الفصل الثاني', 'postgraduate', 'ماجستير ادارة الاعمال', '2026-04-26 14:48:45'),
(399, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-27 14:03:55'),
(400, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 11:13:55'),
(401, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:21:48'),
(402, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:33:41'),
(403, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:33:44'),
(404, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:33:44'),
(405, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:38:48'),
(406, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-28 12:56:02'),
(407, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:56:58'),
(408, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-28 13:03:24'),
(409, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 13:03:47'),
(410, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 13:04:34'),
(411, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 13:05:33'),
(412, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:00:47'),
(413, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:00:47'),
(414, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:01:36'),
(415, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:39:08'),
(416, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:40:22'),
(417, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:41:46'),
(418, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:43:00'),
(419, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:20:09'),
(420, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:21:08'),
(421, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:26:25'),
(422, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:27:04'),
(423, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:32:16'),
(424, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:34:10'),
(425, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:39:51'),
(426, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:43:18'),
(427, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:45:00'),
(428, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:45:13'),
(429, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:45:17'),
(430, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:45:36'),
(432, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:45:55'),
(433, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:49:29'),
(434, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:49:59'),
(435, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:51:22'),
(436, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 10:10:59');

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` int(11) NOT NULL,
  `title` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `description` text CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `author` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `faculty` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `pdf_url` varchar(500) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `is_pdf` tinyint(1) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `is_borrowed` tinyint(1) DEFAULT 0,
  `borrower_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `borrower_id` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `borrowed_at` datetime DEFAULT NULL,
  `returned_at` datetime DEFAULT NULL,
  `copies` int(11) DEFAULT 1,
  `location` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `faculty_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `title`, `description`, `author`, `faculty`, `pdf_url`, `is_pdf`, `created_at`, `is_borrowed`, `borrower_name`, `borrower_id`, `borrowed_at`, `returned_at`, `copies`, `location`, `faculty_id`) VALUES
(1, 'Database Systems', 'كتاب شامل لقواعد البيانات', 'Elmasri', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 3, 'المكتبة الرئيسية - رف A1', 1),
(2, 'Computer Networks', 'أساسيات الشبكات', 'Tanenbaum', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 2, 'المكتبة الرئيسية - رف A2', 1),
(3, 'Operating Systems', 'مبادئ نظم التشغيل', 'Silberschatz', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 2, 'المكتبة الرئيسية - رف A3', 1),
(4, 'Software Engineering', 'مدخل لهندسة البرمجيات', 'Pressman', NULL, NULL, 10, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 1, 'المكتبة الرئيسية - رف A4', 1),
(5, 'Data Structures', 'هياكل البيانات', 'Cormen', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 2, 'المكتبة الرئيسية - رف A5', 1),
(6, 'Engineering Mechanics', 'ميكانيكا هندسية', 'Hibbeler', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 1, 'المكتبة الهندسية - رف B1', 2),
(7, 'Circuit Analysis', 'تحليل الدوائر', 'Hayt', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 2, 'المكتبة الهندسية - رف B2', 2),
(8, 'Electronics', 'إلكترونيات', 'Sedra', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 1, 'المكتبة الهندسية - رف B3', 2),
(9, 'Power Systems', 'أنظمة القدرة', 'Glover', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 1, 'المكتبة الهندسية - رف B4', 2),
(10, 'Civil Structures', 'منشآت', 'Nawy', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 1, 'المكتبة الهندسية - رف B5', 2),
(11, 'Principles of Management', 'مبادئ الإدارة', 'Robbins', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 3, 'مكتبة الاقتصاد - رف C1', 3),
(12, 'Human Resource', 'إدارة الموارد البشرية', 'Dessler', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 2, 'مكتبة الاقتصاد - رف C2', 3),
(13, 'Accounting 1', 'محاسبة 1', 'Kieso', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 2, 'مكتبة الاقتصاد - رف C3', 3),
(14, 'Microeconomics', 'اقتصاد جزئي', 'Mankiw', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 1, 'مكتبة الاقتصاد - رف C4', 3),
(15, 'Business Finance', '002', 'Ross', NULL, NULL, 0, '2025-12-28 11:20:32', 0, NULL, NULL, NULL, NULL, 1, 'مكتبة الاقتصاد - رف C5', 3),
(16, 'مقدمه في لغه بايثون', '002', 'خالد', NULL, '', 0, '2025-12-29 09:41:26', 0, NULL, NULL, NULL, NULL, 3, '', 1),
(18, 'نظرية المحاسبة', '002', 'ادم الهادي', NULL, '', 0, '2025-12-29 10:57:29', 0, NULL, NULL, NULL, NULL, 10, 'الرف الثاني', 3),
(19, 'مقدمة في الاقتصاد', '002', 'اولقا حسن', NULL, 'http://localhost:5000/uploads/1767006113066.pdf', 1, '2025-12-29 11:01:53', 0, NULL, NULL, NULL, NULL, 1, '', 3),
(20, 'test', '002', 'henary', NULL, '', 0, '2026-02-02 11:30:04', 0, NULL, NULL, NULL, NULL, 1, 'rf45', 3),
(21, 'df', '002', 'rty', NULL, 'http://localhost:5000/uploads/1770033643111.pdf', 1, '2026-02-02 12:00:25', 0, NULL, NULL, NULL, NULL, 2, '', 3),
(22, 'testing', '002', 'احمد محمد', NULL, '', 0, '2026-03-04 07:34:27', 0, NULL, NULL, NULL, NULL, 2, '', 1),
(23, 'اختبار الانظمه', '', 'هاله خالد', NULL, 'http://localhost:5000/uploads/1776251844972.docx', 1, '2026-04-15 06:58:09', 0, NULL, NULL, NULL, NULL, 1, '', 1);

-- --------------------------------------------------------

--
-- Table structure for table `borrowed_books`
--

CREATE TABLE `borrowed_books` (
  `id` int(11) NOT NULL,
  `book_id` int(11) NOT NULL,
  `student_id` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `student_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `faculty` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `borrowed_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `returned_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `borrowed_books`
--

INSERT INTO `borrowed_books` (`id`, `book_id`, `student_id`, `student_name`, `faculty`, `borrowed_at`, `returned_at`) VALUES
(4, 16, '240005', 'خالد يوسف', 'كلية علوم الحاسوب', '2026-02-02 12:03:43', NULL),
(5, 20, '240005', 'خالد يوسف', 'كلية الاقتصاد', '2026-02-02 12:30:12', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `courses`
--

CREATE TABLE `courses` (
  `id` int(11) NOT NULL,
  `faculty_id` int(11) NOT NULL,
  `department_id` int(11) NOT NULL,
  `academic_year` varchar(20) NOT NULL,
  `level_name` varchar(50) NOT NULL,
  `term_name` varchar(50) NOT NULL,
  `course_name` varchar(255) NOT NULL,
  `course_name_en` varchar(255) DEFAULT NULL,
  `instructor` varchar(255) DEFAULT NULL,
  `credit_hours` decimal(5,2) DEFAULT NULL,
  `total_mark` int(11) NOT NULL DEFAULT 100,
  `coursework_max` int(11) NOT NULL DEFAULT 40,
  `final_exam_max` int(11) NOT NULL DEFAULT 60,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `program_type` varchar(20) NOT NULL DEFAULT 'bachelor',
  `postgraduate_program` varchar(255) DEFAULT NULL,
  `created_by` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `courses`
--

INSERT INTO `courses` (`id`, `faculty_id`, `department_id`, `academic_year`, `level_name`, `term_name`, `course_name`, `course_name_en`, `instructor`, `credit_hours`, `total_mark`, `coursework_max`, `final_exam_max`, `created_at`, `updated_at`, `program_type`, `postgraduate_program`, `created_by`) VALUES
(1, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'برمجة 1', 'programming', 'د. محمد عادل', 4.00, 100, 40, 60, '2025-12-28 11:20:32', '2026-04-30 09:50:10', 'bachelor', NULL, 'kian'),
(2, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'مقدمة قواعد البيانات', NULL, 'د. محمد عادل', 3.00, 100, 40, 60, '2025-12-28 11:20:32', '2025-12-28 11:20:32', 'bachelor', NULL, NULL),
(3, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'رياضيات 1', NULL, 'د. سارة نبيل', 3.00, 100, 40, 60, '2025-12-28 11:20:32', '2025-12-28 11:20:32', 'bachelor', NULL, NULL),
(4, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'مبادئ نظم التشغيل', 'OS', 'د. سارة نبيل', 3.00, 100, 40, 60, '2025-12-28 11:20:32', '2026-04-30 09:50:32', 'bachelor', NULL, 'kian'),
(5, 1, 1, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'شبكات الحاسوب', NULL, 'د. سارة نبيل', 3.00, 100, 40, 60, '2025-12-28 11:20:32', '2025-12-28 11:20:32', 'bachelor', NULL, NULL),
(6, 1, 1, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'تحليل النظم', NULL, 'د. علي الطيب', 3.00, 100, 40, 60, '2025-12-28 11:20:32', '2025-12-28 11:20:32', 'bachelor', NULL, NULL),
(7, 2, 5, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'دوائر كهربائية', NULL, 'م. أحمد الطيب', 3.00, 100, 40, 60, '2025-12-28 11:20:32', '2025-12-28 11:20:32', 'bachelor', NULL, NULL),
(8, 2, 5, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'إلكترونيات', NULL, 'م. أحمد الطيب', 3.00, 100, 40, 60, '2025-12-28 11:20:32', '2025-12-28 11:20:32', 'bachelor', NULL, NULL),
(9, 3, 8, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'مبادئ الإدارة', NULL, 'د. نادر حسن', 3.00, 100, 40, 60, '2025-12-28 11:20:32', '2025-12-28 11:20:32', 'bachelor', NULL, NULL),
(10, 3, 8, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'إدارة الموارد البشرية', NULL, 'أ. ريم عمر', 3.00, 100, 40, 60, '2025-12-28 11:20:32', '2025-12-28 11:20:32', 'bachelor', NULL, NULL),
(11, 3, 9, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'اداره الاقتصاد', NULL, 'أ. ريم عمر', 3.00, 100, 40, 60, '2025-12-31 11:31:54', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(12, 1, 3, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'البرمجيات المدمجة', NULL, 'د. علي الطيب', 3.00, 100, 40, 60, '2025-12-31 13:51:49', '0000-00-00 00:00:00', 'bachelor', 'ماجستير البرمجيات المدمجة', NULL),
(13, 1, 3, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'هندسة برمجيات', NULL, 'د. علي الطيب', 3.00, 100, 40, 60, '2026-01-13 06:43:27', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(14, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'شبكات', NULL, 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-02-04 11:29:48', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(15, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'تفاعل الانسان والحاسوب', NULL, 'د. علي الطيب', 3.00, 100, 40, 60, '2026-02-05 08:02:49', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(16, 4, 10, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'test', NULL, 'د.محمد علي', 2.00, 100, 40, 60, '2026-02-07 15:22:32', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(17, 4, 10, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'test1', NULL, 'د.محمد علي', 3.00, 100, 40, 60, '2026-02-07 15:22:40', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(18, 4, 10, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'test3', NULL, 'د.محمد علي', 3.00, 100, 40, 60, '2026-02-07 15:23:22', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(19, 4, 10, '2025/2026', 'المستوى الأول', 'الفصل الأول', 't1', NULL, 'د.محمد علي', 2.00, 100, 40, 60, '2026-02-08 07:03:52', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(20, 4, 10, '2025/2026', 'المستوى الأول', 'الفصل الأول', 't2', NULL, 'د.محمد علي', 3.00, 100, 40, 60, '2026-02-08 07:03:59', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(21, 4, 10, '2025/2026', 'المستوى الأول', 'الفصل الأول', 't3', NULL, 'د.محمد علي', 3.00, 100, 40, 60, '2026-02-08 07:04:14', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(22, 4, 10, '2025/2026', 'المستوى الأول', 'الفصل الأول', 't4', NULL, 'د.محمد علي', 2.00, 100, 40, 60, '2026-02-08 07:04:25', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(23, 5, 12, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'تحليل', NULL, 'هاشم علي', 3.00, 100, 40, 60, '2026-02-09 07:28:38', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(24, 5, 12, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'كيمياء تحليليه', NULL, 'هاشم علي', 3.00, 100, 40, 60, '2026-02-09 07:28:51', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(25, 5, 12, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'طفيليات', NULL, 'هاشم علي', 2.00, 100, 40, 60, '2026-02-09 07:29:08', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(26, 3, 7, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'اداره', NULL, 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-03-02 14:12:22', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(27, 3, 7, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'حسبان', NULL, 'أ. ريم عمر', 2.00, 100, 40, 60, '2026-03-02 14:12:34', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(28, 3, 8, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'اقتصاد', NULL, 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-03-02 14:13:49', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(29, 3, 8, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'رياضيات', NULL, 'د. نادر حسن', 2.00, 100, 40, 60, '2026-03-02 14:14:03', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(30, 2, 5, '2025/2026', 'المستوى الخامس', 'الفصل الأول', 'الكترونيات', NULL, 'م. مروة صالح', 3.00, 100, 40, 60, '2026-03-03 11:58:00', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(31, 3, 8, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'تحليل', NULL, 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-03-09 11:30:38', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(32, 3, 8, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'جبر', NULL, 'د. نادر حسن', 2.00, 100, 40, 60, '2026-03-09 11:31:23', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(33, 3, 8, '2025/2026', 'المستوى الثالث', 'الفصل الأول', 'حسابات', NULL, 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-03-09 11:32:14', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(34, 3, 8, '2025/2026', 'المستوى الثالث', 'الفصل الأول', 'تسويق', NULL, 'د. نادر حسن', 3.00, 100, 40, 60, '2026-03-09 11:32:35', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(35, 3, 8, '2025/2026', 'المستوى الثالث', 'الفصل الثاني', 'تنظيم', NULL, 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-03-09 11:32:55', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(36, 3, 8, '2025/2026', 'المستوى الثالث', 'الفصل الثاني', 'جبر2', NULL, 'أ. خالد صالح', 2.00, 100, 40, 60, '2026-03-09 11:33:16', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(37, 3, 8, '2025/2026', 'المستوى الرابع', 'الفصل الأول', 'طرق البحث', NULL, 'أ. ريم عمر', 3.00, 100, 40, 60, '2026-03-09 11:33:47', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(38, 3, 8, '2025/2026', 'المستوى الرابع', 'الفصل الأول', 'تحليل2', NULL, 'د. نادر حسن', 3.00, 100, 40, 60, '2026-03-09 11:33:58', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(39, 3, 8, '2025/2026', 'المستوى الرابع', 'الفصل الثاني', 'طرق بحث 2', NULL, 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-03-09 11:34:15', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(40, 3, 8, '2025/2026', 'المستوى الرابع', 'الفصل الثاني', 'تنظيم2', NULL, 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-03-09 11:34:25', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(41, 3, 8, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'تحيل سوق العمل', NULL, 'أ. ريم عمر', 3.00, 100, 40, 60, '2026-03-09 11:38:14', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(42, 3, 8, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'محاسبه', NULL, 'أ. خالد صالح', 2.00, 100, 40, 60, '2026-03-09 11:38:31', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(43, 3, 8, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'اداره', NULL, 'د. نادر حسن', 3.00, 100, 40, 60, '2026-03-09 11:38:48', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(44, 3, 8, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'جبر2', NULL, 'أ. خالد صالح', 2.00, 100, 40, 60, '2026-03-09 11:39:02', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(45, 3, 8, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'ادارة وتحليل', NULL, 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-03-09 11:39:39', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(46, 3, 8, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'اداره وتنظيم', NULL, 'د. نادر حسن', 3.00, 100, 40, 60, '2026-03-09 11:39:55', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(47, 3, 8, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'نظم', NULL, 'د. نادر حسن', 2.00, 100, 40, 60, '2026-03-09 11:40:10', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(48, 3, 8, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'حوسبه', NULL, 'أ. ريم عمر', 3.00, 100, 40, 60, '2026-03-09 11:40:23', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(49, 3, 8, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'طرق البحث', NULL, 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-03-09 11:41:07', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(50, 3, 8, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'اقتصاد', NULL, 'د. نادر حسن', 3.00, 100, 40, 60, '2026-03-09 11:41:38', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(51, 3, 8, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'طرق البحث 2', NULL, 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-03-09 11:41:58', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(52, 3, 8, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'اقتصاد2', NULL, 'د. نادر حسن', 3.00, 100, 40, 60, '2026-03-09 11:42:07', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(53, 1, 2, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'DB1', NULL, 'د. علي الطيب', 3.00, 100, 40, 60, '2026-03-09 11:45:16', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(54, 1, 2, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'HCI', NULL, 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-03-09 11:45:34', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(55, 1, 2, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'testing', NULL, 'د. محمد عادل', 3.00, 100, 40, 60, '2026-03-09 11:45:59', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(56, 1, 2, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'web development', NULL, 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-03-09 11:46:52', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(57, 1, 2, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'DB2', NULL, 'د. علي الطيب', 3.00, 100, 40, 60, '2026-03-09 11:47:25', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(58, 1, 2, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'تدريب عملي', NULL, 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-03-09 11:47:55', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(59, 1, 2, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'AI', NULL, 'د. محمد عادل', 3.00, 100, 40, 60, '2026-03-09 11:48:15', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(60, 1, 2, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'تدريب عملي 2', NULL, 'د. علي الطيب', 3.00, 100, 40, 60, '2026-03-09 11:48:34', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(61, 1, 2, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'مشروع', NULL, 'د. علي الطيب', 3.00, 100, 40, 60, '2026-03-09 11:48:53', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(62, 1, 2, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'طرق البحث', NULL, 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-03-09 11:49:05', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(63, 1, 2, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'طرق البحث 2', NULL, 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-03-09 11:49:25', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(64, 1, 2, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'مشروع2', NULL, 'د. علي الطيب', 3.00, 100, 40, 60, '2026-03-09 11:49:44', '0000-00-00 00:00:00', 'bachelor', NULL, NULL),
(65, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'منطق الاقتصاد', NULL, 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-04-26 11:05:24', '0000-00-00 00:00:00', 'postgraduate', 'ماجستير ادارة الاعمال', NULL),
(66, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'ريادة الاعمال', NULL, 'د. نادر حسن', 3.00, 100, 40, 60, '2026-04-26 11:06:23', '0000-00-00 00:00:00', 'postgraduate', 'ماجستير ادارة الاعمال', NULL),
(67, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'ادارة الجودة الشامله', NULL, 'أ. ريم عمر', 3.00, 100, 40, 60, '2026-04-26 11:06:43', '0000-00-00 00:00:00', 'postgraduate', 'ماجستير ادارة الاعمال', NULL),
(68, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'تفاعل', 'hci', 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-04-30 09:43:45', '2026-04-30 09:43:45', 'bachelor', NULL, 'kian'),
(69, 7, 13, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'ترجمة', 'tran', 'حامد محمد', 2.00, 100, 40, 60, '2026-04-30 10:11:26', '2026-04-30 10:11:26', 'bachelor', NULL, 'kian'),
(70, 7, 13, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'متطلبات', 'req', 'هارون حين', 3.00, 100, 40, 60, '2026-04-30 10:11:45', '2026-04-30 10:11:45', 'bachelor', NULL, 'kian'),
(71, 7, 13, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'رياضيات', 'ma', 'حامد محمد', 3.00, 100, 40, 60, '2026-04-30 10:12:12', '2026-04-30 10:12:12', 'bachelor', NULL, 'kian');

-- --------------------------------------------------------

--
-- Table structure for table `course_grades`
--

CREATE TABLE `course_grades` (
  `id` int(11) NOT NULL,
  `course_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `attempt_number` tinyint(3) UNSIGNED NOT NULL DEFAULT 1,
  `coursework_mark` decimal(6,2) DEFAULT NULL,
  `final_exam_mark` decimal(6,2) DEFAULT NULL,
  `total_mark` decimal(6,2) DEFAULT NULL,
  `letter` varchar(10) DEFAULT NULL,
  `points` decimal(4,2) DEFAULT NULL,
  `created_by` varchar(100) DEFAULT NULL,
  `updated_by` varchar(100) DEFAULT NULL,
  `is_repeat` tinyint(1) NOT NULL DEFAULT 0,
  `is_absent` tinyint(1) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `penalty_type` varchar(50) DEFAULT 'none',
  `suspension_duration` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `course_grades`
--

INSERT INTO `course_grades` (`id`, `course_id`, `student_id`, `attempt_number`, `coursework_mark`, `final_exam_mark`, `total_mark`, `letter`, `points`, `created_by`, `updated_by`, `is_repeat`, `is_absent`, `created_at`, `updated_at`, `penalty_type`, `suspension_duration`) VALUES
(190, 1, 8, 1, 0.00, 0.00, 0.00, 'F', 0.00, NULL, 'kian', 0, 1, '2026-04-26 09:01:43', '2026-04-30 07:05:00', 'none', NULL),
(191, 1, 1, 1, 34.00, 44.00, 78.00, 'B+', 3.50, NULL, 'kian', 0, 0, '2026-04-26 09:01:43', '2026-04-30 07:05:00', 'none', NULL),
(192, 1, 128, 1, 0.00, 0.00, 0.00, 'F', 0.00, NULL, 'kian', 0, 0, '2026-04-26 09:01:43', '2026-04-30 07:05:00', 'suspension', 'one_year'),
(193, 1, 3, 1, 25.00, 45.00, 70.00, 'B', 3.00, NULL, 'kian', 0, 0, '2026-04-26 09:01:43', '2026-04-30 07:05:00', 'none', NULL),
(194, 1, 7, 1, 35.00, 44.00, 79.00, 'B+', 3.50, NULL, 'kian', 0, 0, '2026-04-26 09:01:43', '2026-04-30 07:05:00', 'none', 'one_year'),
(195, 1, 4, 1, 10.00, 55.00, 65.00, 'B', 3.00, NULL, 'kian', 0, 0, '2026-04-26 09:01:43', '2026-04-30 07:05:00', 'none', NULL),
(196, 3, 8, 1, 40.00, 60.00, 100.00, 'A', 4.00, NULL, 'kian', 0, 0, '2026-04-26 09:02:40', '2026-04-29 14:31:15', 'none', NULL),
(197, 3, 1, 1, 35.00, 55.00, 90.00, 'A', 4.00, NULL, 'kian', 0, 0, '2026-04-26 09:02:40', '2026-04-29 14:31:15', 'none', NULL),
(198, 3, 128, 1, 30.00, 50.00, 80.00, 'B+', 3.50, NULL, 'kian', 0, 0, '2026-04-26 09:02:40', '2026-04-29 14:31:15', 'none', NULL),
(199, 3, 3, 1, 25.00, 45.00, 70.00, 'B', 3.00, NULL, 'kian', 0, 0, '2026-04-26 09:02:40', '2026-04-29 14:31:15', 'warning', NULL),
(200, 3, 7, 1, 15.00, 40.00, 55.00, 'C+', 2.50, NULL, 'kian', 0, 0, '2026-04-26 09:02:40', '2026-04-29 14:31:15', 'none', NULL),
(201, 3, 4, 1, 0.00, 0.00, 0.00, 'F', 0.00, NULL, 'kian', 0, 1, '2026-04-26 09:02:40', '2026-04-29 14:31:15', 'none', NULL),
(202, 4, 8, 1, 40.00, 60.00, 100.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 09:03:16', '0000-00-00 00:00:00', 'none', NULL),
(203, 4, 1, 1, 40.00, 55.00, 95.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 09:03:16', '0000-00-00 00:00:00', 'none', NULL),
(204, 4, 128, 1, 40.00, 45.00, 85.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 09:03:16', '0000-00-00 00:00:00', 'none', NULL),
(205, 4, 3, 1, 40.00, 40.00, 80.00, 'B+', 3.50, NULL, NULL, 0, 0, '2026-04-26 09:03:16', '0000-00-00 00:00:00', 'none', NULL),
(206, 4, 7, 1, 40.00, 35.00, 75.00, 'B+', 3.50, NULL, NULL, 0, 0, '2026-04-26 09:03:16', '0000-00-00 00:00:00', 'none', NULL),
(207, 4, 4, 1, 40.00, 30.00, 70.00, 'B', 3.00, NULL, NULL, 0, 0, '2026-04-26 09:03:16', '0000-00-00 00:00:00', 'none', NULL),
(208, 2, 8, 1, 40.00, 35.00, 75.00, 'B+', 3.50, NULL, NULL, 0, 0, '2026-04-26 09:04:02', '0000-00-00 00:00:00', 'none', NULL),
(209, 2, 1, 1, 40.00, 40.00, 80.00, 'B+', 3.50, NULL, NULL, 0, 0, '2026-04-26 09:04:02', '0000-00-00 00:00:00', 'none', NULL),
(210, 2, 128, 1, 40.00, 45.00, 85.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 09:04:02', '0000-00-00 00:00:00', 'none', NULL),
(211, 2, 3, 1, 40.00, 50.00, 90.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 09:04:02', '0000-00-00 00:00:00', 'none', NULL),
(212, 2, 7, 1, 40.00, 55.00, 95.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 09:04:02', '0000-00-00 00:00:00', 'none', NULL),
(213, 2, 4, 1, 40.00, 60.00, 100.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 09:04:02', '0000-00-00 00:00:00', 'none', NULL),
(214, 67, 125, 1, 40.00, 45.00, 85.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 11:07:27', '2026-04-27 11:12:26', 'none', NULL),
(215, 67, 115, 1, 35.00, 44.00, 79.00, 'B+', 3.50, NULL, NULL, 0, 0, '2026-04-26 11:07:27', '2026-04-27 11:12:26', 'none', NULL),
(216, 67, 124, 1, 40.00, 60.00, 100.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 11:07:27', '2026-04-27 11:12:26', 'none', NULL),
(217, 66, 125, 1, 40.00, 60.00, 100.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 11:07:50', '2026-04-27 11:12:41', 'none', NULL),
(218, 66, 115, 1, 40.00, 55.00, 95.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 11:07:50', '2026-04-27 11:12:41', 'none', NULL),
(219, 66, 124, 1, 40.00, 60.00, 100.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 11:07:50', '2026-04-27 11:12:41', 'none', NULL),
(220, 65, 125, 1, 40.00, 55.00, 95.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 11:08:11', '2026-04-27 11:12:54', 'none', NULL),
(221, 65, 115, 1, 40.00, 60.00, 100.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-26 11:08:11', '2026-04-27 11:12:54', 'none', NULL),
(222, 65, 124, 1, 40.00, 20.00, 60.00, 'C+', 2.50, NULL, NULL, 0, 0, '2026-04-26 11:08:11', '2026-04-27 11:12:54', 'none', NULL),
(223, 67, 134, 1, 0.00, 0.00, 0.00, 'F', 0.00, NULL, NULL, 0, 0, '2026-04-27 11:12:26', '0000-00-00 00:00:00', 'none', NULL),
(224, 67, 137, 1, 35.00, 45.00, 80.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-27 11:12:26', '0000-00-00 00:00:00', 'none', NULL),
(225, 67, 133, 1, 0.00, 0.00, 0.00, 'F', 0.00, NULL, NULL, 0, 0, '2026-04-27 11:12:26', '0000-00-00 00:00:00', 'none', NULL),
(226, 66, 134, 1, 0.00, 0.00, 0.00, 'F', 0.00, NULL, NULL, 0, 0, '2026-04-27 11:12:41', '0000-00-00 00:00:00', 'none', NULL),
(227, 66, 137, 1, 30.00, 60.00, 90.00, 'A', 4.00, NULL, NULL, 0, 0, '2026-04-27 11:12:41', '0000-00-00 00:00:00', 'none', NULL),
(228, 66, 133, 1, 0.00, 0.00, 0.00, 'F', 0.00, NULL, NULL, 0, 0, '2026-04-27 11:12:41', '0000-00-00 00:00:00', 'none', NULL),
(229, 65, 134, 1, 0.00, 0.00, 0.00, 'F', 0.00, NULL, NULL, 0, 0, '2026-04-27 11:12:54', '0000-00-00 00:00:00', 'none', NULL),
(230, 65, 137, 1, 33.00, 45.00, 78.00, 'B+', 3.50, NULL, NULL, 0, 0, '2026-04-27 11:12:54', '0000-00-00 00:00:00', 'none', NULL),
(231, 65, 133, 1, 0.00, 0.00, 0.00, 'F', 0.00, NULL, NULL, 0, 0, '2026-04-27 11:12:54', '0000-00-00 00:00:00', 'none', NULL),
(232, 69, 139, 1, 0.00, 0.00, 0.00, 'F', 0.00, 'kian', 'kian', 0, 0, '2026-04-30 10:13:21', '2026-04-30 11:36:32', 'suspension', 'one_year'),
(233, 69, 106, 1, 40.00, 55.00, 95.00, 'A', 4.00, 'kian', 'kian', 0, 0, '2026-04-30 10:13:21', '2026-04-30 11:36:32', 'none', NULL),
(234, 69, 104, 1, 40.00, 44.00, 84.00, 'A', 4.00, 'kian', 'kian', 0, 0, '2026-04-30 10:13:21', '2026-04-30 11:36:32', 'none', NULL),
(235, 69, 127, 1, 23.00, 15.00, 38.00, 'F', 0.00, 'kian', 'kian', 0, 0, '2026-04-30 10:13:21', '2026-04-30 11:36:32', 'none', NULL),
(236, 69, 109, 1, 40.00, 44.00, 84.00, 'A', 4.00, 'kian', 'kian', 0, 0, '2026-04-30 10:13:21', '2026-04-30 11:36:32', 'none', NULL),
(237, 71, 139, 1, 30.00, 44.00, 74.00, 'B', 3.00, 'kian', 'kian', 0, 0, '2026-04-30 10:35:28', '2026-04-30 11:36:38', 'none', NULL),
(238, 71, 106, 1, 39.00, 33.00, 72.00, 'B', 3.00, 'kian', 'kian', 0, 0, '2026-04-30 10:35:28', '2026-04-30 11:36:38', 'none', NULL),
(239, 71, 104, 1, 33.00, 44.00, 77.00, 'B+', 3.50, 'kian', 'kian', 0, 0, '2026-04-30 10:35:28', '2026-04-30 11:36:38', 'none', NULL),
(240, 71, 127, 1, 10.00, 15.00, 25.00, 'F', 0.00, 'kian', 'kian', 0, 0, '2026-04-30 10:35:28', '2026-04-30 11:36:38', 'none', NULL),
(241, 71, 109, 1, 0.00, 0.00, 0.00, 'F', 0.00, 'kian', 'kian', 0, 0, '2026-04-30 10:35:28', '2026-04-30 11:36:38', 'expulsion', NULL),
(242, 70, 139, 1, 33.00, 34.00, 67.00, 'C+', 2.50, 'kian', 'kian', 0, 0, '2026-04-30 10:54:54', '2026-04-30 11:36:47', 'none', NULL),
(243, 70, 106, 1, 40.00, 34.00, 74.00, 'B', 3.00, 'kian', 'kian', 0, 0, '2026-04-30 10:54:54', '2026-04-30 11:36:47', 'none', NULL),
(244, 70, 104, 1, 34.00, 43.00, 77.00, 'B+', 3.50, 'kian', 'kian', 0, 0, '2026-04-30 10:54:54', '2026-04-30 11:36:47', 'none', NULL),
(245, 70, 127, 1, 10.00, 10.00, 20.00, 'F', 0.00, 'kian', 'kian', 0, 0, '2026-04-30 10:54:54', '2026-04-30 11:36:47', 'none', NULL),
(246, 70, 109, 1, 33.00, 34.00, 67.00, 'C+', 2.50, 'kian', 'kian', 0, 0, '2026-04-30 10:54:54', '2026-04-30 11:36:47', 'none', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `departments`
--

CREATE TABLE `departments` (
  `id` int(11) NOT NULL,
  `faculty_id` int(11) NOT NULL,
  `department_name` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `levels_count` int(11) DEFAULT 4
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `departments`
--

INSERT INTO `departments` (`id`, `faculty_id`, `department_name`, `levels_count`) VALUES
(1, 1, 'نظم المعلومات', 4),
(2, 1, 'علوم الحاسوب', 4),
(3, 1, 'الشبكات', 4),
(4, 2, 'تمويل', 4),
(5, 2, 'إدارة أعمال', 4),
(6, 2, 'محاسبة تكاليف', 4),
(7, 3, 'محاسبة', 4),
(8, 3, 'إدارة أعمال', 4),
(9, 3, 'اقتصاد', 4),
(10, 4, 'باطني', 4),
(11, 4, 'جراحه', 4),
(12, 5, 'الطفيليات', 4),
(13, 7, 'اللغة الانجليزية', 4),
(14, 1, 'تقنية المعلومات', 4),
(15, 6, 'طب اسنان', 5);

-- --------------------------------------------------------

--
-- Table structure for table `faculties`
--

CREATE TABLE `faculties` (
  `id` int(11) NOT NULL,
  `faculty_name` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `faculty_type` enum('theoretical','practical') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'theoretical',
  `faculty_code` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `faculties`
--

INSERT INTO `faculties` (`id`, `faculty_name`, `faculty_type`, `faculty_code`) VALUES
(1, 'كلية علوم الحاسوب', 'practical', 'PAU004'),
(2, 'كلية العلوم الأدارية', 'theoretical', 'PAU006'),
(3, 'كلية الإقتصاد والعلوم المصرفيه', 'theoretical', 'PAU005'),
(4, 'كلية علوم التمريض', 'practical', 'PAU003'),
(5, 'كلية علوم المختبرات الطبية', 'practical', 'PAU002'),
(6, 'كلية الطب والجراحة', 'theoretical', 'PAU001'),
(7, 'كلية اللغات والترجمه', 'theoretical', 'PAU007');

-- --------------------------------------------------------

--
-- Table structure for table `fees`
--

CREATE TABLE `fees` (
  `id` int(11) NOT NULL,
  `student_id` int(11) DEFAULT NULL,
  `academic_year` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `level_name` varchar(60) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `currency` enum('SDG','USD') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'SDG',
  `term_name` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `program_type` enum('diploma','bachelor','postgraduate') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'bachelor',
  `postgraduate_program` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `department_id` int(11) DEFAULT NULL,
  `registration_fee` decimal(10,2) DEFAULT NULL,
  `tuition_fee` decimal(10,2) DEFAULT NULL,
  `late_fee` decimal(10,2) DEFAULT NULL,
  `scholarship_type` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT 'لا منحة',
  `scholarship_percentage` decimal(5,2) DEFAULT 0.00 COMMENT 'نسبة الخصم',
  `scholarship_granted_by` varchar(150) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `payment_start_date` date DEFAULT NULL,
  `payment_end_date` date DEFAULT NULL,
  `installment_1` decimal(10,2) DEFAULT NULL,
  `installment_1_id` int(11) DEFAULT NULL,
  `installment_1_start` date DEFAULT NULL,
  `installment_1_end` date DEFAULT NULL,
  `installment_1_paid` tinyint(1) DEFAULT 0,
  `installment_1_paid_at` date DEFAULT NULL,
  `installment_2` decimal(10,2) DEFAULT NULL,
  `installment_2_id` int(11) DEFAULT NULL,
  `installment_2_start` date DEFAULT NULL,
  `installment_2_end` date DEFAULT NULL,
  `installment_2_paid` tinyint(1) DEFAULT 0,
  `installment_2_paid_at` date DEFAULT NULL,
  `installment_3` decimal(10,2) DEFAULT NULL,
  `installment_3_id` int(11) DEFAULT NULL,
  `installment_3_start` date DEFAULT NULL,
  `installment_3_end` date DEFAULT NULL,
  `installment_3_paid` tinyint(1) DEFAULT 0,
  `installment_3_paid_at` date DEFAULT NULL,
  `installment_4` decimal(10,2) DEFAULT NULL,
  `installment_4_id` int(11) DEFAULT NULL,
  `installment_4_start` date DEFAULT NULL,
  `installment_4_end` date DEFAULT NULL,
  `installment_4_paid` tinyint(1) DEFAULT 0,
  `installment_4_paid_at` date DEFAULT NULL,
  `installment_5` decimal(10,2) DEFAULT NULL,
  `installment_5_id` int(11) DEFAULT NULL,
  `installment_5_start` date DEFAULT NULL,
  `installment_5_end` date DEFAULT NULL,
  `installment_5_paid` tinyint(1) DEFAULT 0,
  `installment_5_paid_at` date DEFAULT NULL,
  `installment_6` decimal(10,2) DEFAULT NULL,
  `installment_6_id` int(11) DEFAULT NULL,
  `installment_6_start` date DEFAULT NULL,
  `installment_6_end` date DEFAULT NULL,
  `installment_6_paid` tinyint(1) DEFAULT 0,
  `installment_6_paid_at` date DEFAULT NULL,
  `registrar` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `freeze_fee` decimal(10,2) DEFAULT 0.00,
  `unfreeze_fee` decimal(10,2) DEFAULT 0.00,
  `repeat_discount` int(11) DEFAULT 50,
  `is_paid` tinyint(1) DEFAULT 0 COMMENT '0 = غير مدفوع, 1 = مدفوع',
  `is_synced` tinyint(4) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `fees`
--

INSERT INTO `fees` (`id`, `student_id`, `academic_year`, `level_name`, `currency`, `term_name`, `program_type`, `postgraduate_program`, `department_id`, `registration_fee`, `tuition_fee`, `late_fee`, `scholarship_type`, `scholarship_percentage`, `scholarship_granted_by`, `payment_start_date`, `payment_end_date`, `installment_1`, `installment_1_id`, `installment_1_start`, `installment_1_end`, `installment_1_paid`, `installment_1_paid_at`, `installment_2`, `installment_2_id`, `installment_2_start`, `installment_2_end`, `installment_2_paid`, `installment_2_paid_at`, `installment_3`, `installment_3_id`, `installment_3_start`, `installment_3_end`, `installment_3_paid`, `installment_3_paid_at`, `installment_4`, `installment_4_id`, `installment_4_start`, `installment_4_end`, `installment_4_paid`, `installment_4_paid_at`, `installment_5`, `installment_5_id`, `installment_5_start`, `installment_5_end`, `installment_5_paid`, `installment_5_paid_at`, `installment_6`, `installment_6_id`, `installment_6_start`, `installment_6_end`, `installment_6_paid`, `installment_6_paid_at`, `registrar`, `created_at`, `updated_at`, `freeze_fee`, `unfreeze_fee`, `repeat_discount`, `is_paid`, `is_synced`) VALUES
(1, NULL, '2026/2027', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, 8, 2500.00, 3500.00, 500.00, 'لا منحة', 0.00, NULL, '2026-04-04', '2026-05-05', NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-02-19 11:49:07', '2026-02-21 12:58:00', 0.00, 0.00, 50, 0, 0),
(4, NULL, '2026/2027', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, 5, 55000.00, 60000.00, 0.00, 'لا منحة', 0.00, NULL, '2026-02-23', '2026-03-23', 0.00, NULL, NULL, NULL, 0, NULL, 0.00, NULL, NULL, NULL, 0, NULL, 0.00, NULL, NULL, NULL, 0, NULL, 0.00, NULL, NULL, NULL, 0, NULL, 0.00, NULL, NULL, NULL, 0, NULL, 0.00, NULL, NULL, NULL, 0, NULL, '', '2026-02-23 10:58:34', '2026-02-23 10:58:34', 0.00, 0.00, 50, 0, 0),
(5, NULL, '2025/2026', 'المستوى الثاني', 'SDG', '', 'bachelor', NULL, 5, 1500.00, 3500.00, 0.00, 'لا منحة', 0.00, NULL, '2026-02-23', '2026-02-28', NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-02-23 12:55:35', '2026-02-23 12:55:35', 0.00, 0.00, 50, 0, 0),
(6, 3, '2025/2026', 'المستوى الثاني', 'SDG', '', 'bachelor', NULL, NULL, 1500.00, 1750.00, 0.00, 'أخرى', 50.00, NULL, '2026-02-22', '2026-02-27', NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-02-25 11:09:13', '2026-02-25 11:09:13', 0.00, 0.00, 50, 0, 1),
(7, 2, '2025/2026', 'المستوى الثاني', 'SDG', '', 'bachelor', NULL, NULL, 1500.00, 875.00, 0.00, 'منحة أبناء عاملين', 75.00, NULL, '2026-02-22', '2026-02-27', NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-02-25 11:59:50', '2026-02-25 11:59:50', 0.00, 0.00, 50, 0, 1),
(9, 9, '2025/2026', 'المستوى الثاني', 'SDG', '', 'bachelor', NULL, NULL, 1500.00, 875.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 2375.00, NULL, '2026-02-22', '2026-03-22', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-02-25 12:51:07', '2026-02-26 10:37:52', 0.00, 0.00, 50, 0, 1),
(10, NULL, '2026/2027', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, 10, 15000.00, 9000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-02-26 11:03:49', '2026-02-26 11:03:49', 0.00, 0.00, 50, 0, 0),
(11, NULL, '2026/2027', 'المستوى الثاني', 'SDG', '', 'bachelor', NULL, 2, 15000.00, 5000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-01 07:53:13', '2026-03-01 07:53:13', 0.00, 0.00, 50, 0, 0),
(12, 3, '2026/2027', 'المستوى الثاني', 'SDG', '', 'bachelor', NULL, NULL, 15000.00, 1750.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 8375.00, NULL, '2026-03-02', '2026-03-30', 1, '2026-04-08', 8375.00, NULL, '2026-04-01', '2026-04-30', 1, '2026-04-08', NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-01 07:56:40', '2026-03-01 07:58:24', 0.00, 0.00, 50, 0, 1),
(13, 6, '2026/2027', 'المستوى الثاني', 'SDG', '', 'bachelor', NULL, NULL, 15000.00, 2450.00, 0.00, 'منحة أشقاء', 30.00, NULL, NULL, NULL, 17450.00, NULL, '2026-03-02', '2026-04-02', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-01 11:11:13', '2026-03-01 11:31:45', 0.00, 0.00, 50, 0, 1),
(14, NULL, '2027/2028', 'المستوى الثالث', 'SDG', '', 'bachelor', NULL, 1, 24000.00, 16000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-01 11:36:53', '2026-03-01 11:36:53', 0.00, 0.00, 50, 0, 0),
(16, 6, '2027/2028', 'المستوى الثالث', 'SDG', '', 'bachelor', NULL, NULL, 24000.00, 11200.00, 0.00, 'منحة أشقاء', 30.00, NULL, NULL, NULL, 17600.00, NULL, '2026-03-02', '2026-04-02', 0, NULL, 17600.00, NULL, '2026-05-02', '2026-06-02', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-01 12:53:29', '2026-03-01 12:53:29', 0.00, 0.00, 50, 0, 1),
(17, 83, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15000.00, 18800.00, 0.00, 'أخرى', 20.00, 'الوكيل (محمد خالد)', NULL, NULL, 33800.00, NULL, '2026-02-01', '2026-02-14', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-02 14:09:42', '2026-03-30 08:04:50', 0.00, 0.00, 50, 0, 1),
(18, NULL, '2025/2026', 'المستوى الخامس', 'SDG', '', 'bachelor', NULL, 5, 25000.00, 15000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-03 09:37:40', '2026-03-03 09:37:40', 0.00, 0.00, 50, 0, 0),
(19, 17, '2025/2026', 'المستوى الخامس', 'SDG', '', 'bachelor', NULL, NULL, 25000.00, 15000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 20000.00, NULL, '2026-02-02', '2026-02-28', 1, '2026-03-03', 20000.00, NULL, '2026-03-02', '2026-03-30', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-03 09:39:32', '2026-03-03 09:39:32', 0.00, 0.00, 50, 0, 1),
(20, NULL, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, 8, 15200.00, 18800.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-04 11:15:06', '2026-03-04 11:15:06', 0.00, 0.00, 50, 0, 0),
(21, 86, '2025/2026', 'المستوى الأول', 'USD', '', 'bachelor', NULL, NULL, 15200.00, 18800.00, 0.00, 'منحة أشقاء', 50.00, 'المدير', NULL, NULL, 17000.00, NULL, '2026-03-04', '2026-03-25', 1, '2026-04-02', 5666.67, NULL, '2026-04-04', '2026-04-25', 0, NULL, 5666.67, NULL, '2026-05-07', '2026-05-25', 0, NULL, 5666.66, 15, '2026-06-08', '2026-06-30', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-04 11:16:15', '2026-04-08 10:30:15', 0.00, 0.00, 50, 0, 1),
(23, 85, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15200.00, 18800.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 17000.00, NULL, '2026-03-04', '2026-03-25', 0, NULL, 17000.00, NULL, '2026-04-04', '2026-04-25', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-04 11:24:33', '2026-03-04 11:24:33', 0.00, 0.00, 50, 0, 1),
(24, 84, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15200.00, 18800.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 11333.34, NULL, '2026-03-04', '2026-03-25', 0, NULL, 11333.33, NULL, '2026-04-04', '2026-04-25', 0, NULL, 11333.33, NULL, '2026-05-04', '2026-05-25', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-04 11:30:59', '2026-03-04 12:02:38', 0.00, 0.00, 50, 0, 1),
(25, 87, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15200.00, 18800.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 17000.00, NULL, '2026-03-07', '2026-03-28', 1, NULL, 17000.00, NULL, '2026-04-07', '2026-04-28', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-07 11:53:49', '2026-03-07 11:53:49', 0.00, 0.00, 50, 0, 1),
(26, 88, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15200.00, 18800.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 11333.34, NULL, '2026-03-07', '2026-03-25', 1, NULL, 11333.33, NULL, '2026-04-07', '2026-04-25', 1, NULL, 5666.67, NULL, '2026-05-07', '2026-05-25', 0, NULL, 5666.66, NULL, '2026-06-07', '2026-06-25', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-07 12:07:01', '2026-03-07 12:09:10', 0.00, 0.00, 50, 0, 1),
(27, 89, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15200.00, 18800.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 17000.00, NULL, '2026-03-07', '2026-03-25', 0, NULL, 17000.00, NULL, '2026-04-07', '2026-04-25', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-07 13:05:11', '2026-03-07 13:05:11', 0.00, 0.00, 50, 0, 1),
(28, NULL, '2026/2027', 'المستوى الأول', 'SDG', '', 'postgraduate', 'ماجستير البرمجيات المدمجة', 3, 5500.00, 500.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-12 08:21:15', '2026-03-12 08:21:15', 0.00, 0.00, 50, 0, 0),
(30, 90, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15200.00, 9000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 12100.00, NULL, '2026-03-12', '2026-03-26', 0, NULL, 12100.00, NULL, '2026-04-12', '2026-04-26', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-12 10:15:26', '2026-03-12 10:15:26', 0.00, 0.00, 50, 0, 1),
(31, 2, '2026/2027', 'المستوى الثاني', 'SDG', '', 'bachelor', NULL, NULL, 15000.00, 5000.00, 0.00, 'منحة أبناء عاملين', 75.00, 'المدير محمد  خالد', NULL, NULL, 10000.00, NULL, '2026-03-12', '2026-04-26', 0, NULL, 10000.00, NULL, '2026-04-12', '2026-04-26', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-12 10:46:57', '2026-03-12 10:46:57', 0.00, 0.00, 50, 0, 1),
(32, 20, '2026/2027', 'المستوى الثاني', 'SDG', '', 'bachelor', NULL, NULL, 15000.00, 5000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 10000.00, NULL, '2026-03-12', '2026-03-28', 1, NULL, 10000.00, NULL, '2026-04-12', '2026-04-28', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-12 12:49:44', '2026-03-12 12:49:44', 0.00, 0.00, 50, 0, 1),
(33, 76, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15200.00, 9000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 12100.00, NULL, '2026-03-12', '2026-03-27', 0, NULL, 12100.00, NULL, '2026-04-12', '2026-04-30', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-12 13:29:24', '2026-03-12 13:29:24', 0.00, 0.00, 50, 0, 1),
(34, 91, '2025/2026', 'المستوى الأول', 'SDG', '', 'diploma', NULL, NULL, 500.00, 9000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 4750.00, NULL, '2026-03-13', '2026-03-30', 1, NULL, 2375.00, NULL, '2026-05-12', '2026-05-30', 0, NULL, 2375.00, NULL, '2026-06-12', '2026-06-27', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-12 13:37:32', '2026-03-12 13:42:40', 0.00, 0.00, 50, 0, 1),
(35, 93, '2025/2026', 'المستوى الأول', 'USD', '', 'bachelor', NULL, NULL, 15200.00, 18800.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 17000.00, NULL, '2026-03-15', '2026-03-31', 0, NULL, 17000.00, NULL, '2026-04-15', '2026-04-30', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-15 15:26:11', '2026-03-15 16:12:30', 0.00, 0.00, 50, 0, 1),
(36, 94, '2025/2026', 'المستوى الأول', 'USD', '', 'bachelor', NULL, NULL, 15200.00, 18800.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 17000.00, NULL, '2026-03-30', '2026-04-30', 0, NULL, 17000.00, NULL, '2026-05-30', '2026-06-30', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-30 08:02:26', '2026-03-30 08:02:26', 0.00, 0.00, 50, 0, 1),
(37, 95, '2026/2027', 'المستوى الأول', 'USD', '', 'bachelor', NULL, NULL, 15000.00, 500.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 7750.00, NULL, '2026-03-31', '2026-04-30', 0, NULL, 7750.00, NULL, '2026-05-01', '2026-06-01', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-03-31 08:07:54', '2026-03-31 08:07:54', 0.00, 0.00, 50, 0, 1),
(40, 96, '2026/2027', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15000.00, 400.00, 0.00, 'منحة أشقاء', 20.00, 'الوكيل', NULL, NULL, 7700.00, 1, '2026-04-01', '2026-05-01', 0, NULL, 7700.00, 2, '2026-06-01', '2026-07-01', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-01 07:45:18', '2026-04-01 07:45:18', 0.00, 0.00, 50, 0, 1),
(41, 97, '2026/2027', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15000.00, 500.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 5166.67, 3, '2026-04-01', '2026-04-30', 0, NULL, 5166.67, 4, '2026-05-01', '2026-05-31', 0, NULL, 5166.66, 5, '2026-06-01', '2026-06-30', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-01 07:48:41', '2026-04-01 07:48:41', 0.00, 0.00, 50, 0, 1),
(42, NULL, '2026/2027', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, 13, 15000.00, 55000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-01 08:07:57', '2026-04-01 08:07:57', 0.00, 0.00, 50, 0, 0),
(43, 98, '2026/2027', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15000.00, 55000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 17500.00, 6, '2026-04-01', '2026-04-30', 1, '2026-04-04', 26250.00, 7, '2026-05-01', '2026-05-31', 1, '2026-04-04', 26250.00, 8, '2026-06-01', '2026-07-31', 0, NULL, NULL, 9, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'SYSTEM', '2026-04-01 08:12:09', '2026-04-04 13:12:40', 0.00, 0.00, 50, 0, 1),
(44, NULL, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, 13, 30000.00, 15000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-01 12:37:41', '2026-04-01 12:40:21', 0.00, 0.00, 50, 0, 0),
(45, 99, '2026/2027', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 15000.00, 55000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 23333.34, NULL, '2026-04-04', '2026-04-30', 0, NULL, 15555.56, NULL, '2026-05-04', '2026-05-31', 0, NULL, 15555.55, NULL, '2026-06-04', '2026-06-30', 0, NULL, 15555.55, NULL, '2026-07-04', '2026-07-31', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'SYSTEM', '2026-04-04 13:17:58', '2026-04-04 13:20:22', 0.00, 0.00, 50, 0, 1),
(47, 101, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 30000.00, 15040.00, 0.00, 'منحة أشقاء', 20.00, 'الوكيل محمد', NULL, NULL, 15013.34, 10, '2026-04-06', '2026-04-30', 1, NULL, 15013.33, 11, '2026-05-06', '2026-05-31', 0, NULL, 15013.33, 12, '2026-06-06', '2026-06-30', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-06 11:23:55', '2026-04-06 11:23:55', 0.00, 0.00, 50, 0, 1),
(48, NULL, '2026/2027', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, 4, 58000.00, 98000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-06 12:09:44', '2026-04-06 12:09:44', 0.00, 0.00, 50, 0, 0),
(49, NULL, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, 4, 55000.00, 65000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-06 12:22:21', '2026-04-06 12:22:21', 0.00, 0.00, 50, 0, 0),
(50, 103, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 55000.00, 16250.00, 0.00, 'منحة أبناء عاملين', 75.00, 'المدير خالد', NULL, NULL, 35625.00, 13, '2026-04-06', '2026-04-30', 0, NULL, 35625.00, 14, '2026-05-06', '2026-05-31', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-06 12:23:15', '2026-04-06 12:23:15', 0.00, 0.00, 50, 0, 1),
(51, NULL, '2026/2027', 'المستوى الثاني', 'SDG', '', 'bachelor', NULL, 4, 55000.00, 155000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-06 13:10:54', '2026-04-06 13:10:54', 0.00, 0.00, 50, 0, 0),
(52, 12, '2026/2027', 'المستوى الثالث', 'SDG', '', 'bachelor', NULL, NULL, 15000.00, 18800.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 16900.00, 16, '2026-04-08', '2026-04-30', 0, NULL, 16900.00, 17, '2026-05-08', '2026-05-31', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-08 10:35:36', '2026-04-08 10:37:08', 0.00, 0.00, 50, 0, 1),
(53, 104, '2025/2026', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 55000.00, 65000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 40000.00, 18, '2026-04-08', '2026-04-30', 0, NULL, 40000.00, 19, '2026-05-08', '2026-05-31', 0, NULL, 40000.00, 22, '2026-06-08', '2026-06-30', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-08 10:59:15', '2026-04-08 12:08:04', 0.00, 0.00, 50, 0, 1),
(54, NULL, '2026/2027', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, 15, 55000.00, 15000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-08 11:27:26', '2026-04-08 11:27:26', 0.00, 0.00, 50, 0, 0),
(55, 105, '2026/2027', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 55000.00, 15000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 23333.34, 20, '2026-04-08', '2026-04-30', 1, '2026-04-08', 23333.33, 21, '2026-05-08', '2026-05-31', 1, '2026-04-08', 23333.33, 23, '2026-06-08', '2026-06-30', 1, '2026-04-08', NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-08 11:27:59', '2026-04-08 12:47:08', 0.00, 0.00, 50, 0, 1),
(56, NULL, '2025/2026', 'المستوى الأول', 'SDG', 'الفصل الأول', 'bachelor', NULL, 7, 5000.00, 4000.00, 40000.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-15 09:24:37', '2026-04-15 09:24:37', 0.00, 0.00, 50, 0, 0),
(57, NULL, '2028/2029', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, 7, 400.00, 4500.00, 4500.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-15 10:32:50', '2026-04-15 10:32:50', 0.00, 0.00, 50, 0, 0),
(58, 108, '2028/2029', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, NULL, 400.00, 4500.00, 4500.00, 'لا منحة', 0.00, NULL, NULL, NULL, 9400.00, 24, '2026-04-01', '2026-04-20', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-15 11:39:20', '2026-04-15 11:39:20', 0.00, 0.00, 50, 0, 0),
(59, NULL, '2028/2029', 'المستوى الأول', 'SDG', '', 'bachelor', NULL, 15, 400.00, 5000.00, 45000.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-15 11:41:29', '2026-04-15 11:41:29', 0.00, 0.00, 50, 0, 0),
(60, 7, '2027/2028', 'المستوى الثالث', 'SDG', NULL, 'bachelor', NULL, NULL, 24000.00, 16000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 40000.00, 25, '2026-04-20', '2026-04-30', 1, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-20 09:58:52', '2026-04-20 09:58:52', 0.00, 0.00, 50, 0, 0),
(61, 7, '2028/2029', 'المستوى الرابع', 'SDG', NULL, 'bachelor', NULL, NULL, 40000.00, 60000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 100000.00, 26, '2026-04-20', '2026-04-30', 1, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-20 10:09:05', '2026-04-20 10:09:05', 0.00, 0.00, 50, 0, 0),
(62, NULL, '2025/2026', 'الدفعة الأولى', 'SDG', '', 'postgraduate', 'ماجستير ادارة الاعمال', 8, 40000.00, 60000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-21 06:52:56', '2026-04-21 06:52:56', 0.00, 0.00, 50, 0, 0),
(63, 124, '2025/2026', 'الدفعة الأولى', 'SDG', 'الفصل الأول', 'postgraduate', 'ماجستير ادارة الاعمال', NULL, 40000.00, 60000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 50000.00, 27, '2026-04-21', '2026-05-21', 0, NULL, 50000.00, 49, '2026-06-23', '2026-07-23', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-21 06:53:40', '2026-04-23 09:56:51', 0.00, 0.00, 50, 0, 0),
(64, 125, '2025/2026', 'الدفعة الأولى', 'SDG', 'الفصل الأول', 'postgraduate', 'ماجستير ادارة الاعمال', NULL, 40000.00, 60000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 50000.00, 28, '2026-04-21', '2026-05-21', 0, NULL, 50000.00, 29, '2026-06-21', '2026-07-21', 0, NULL, NULL, NULL, '2026-08-21', '2026-09-21', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-21 07:00:50', '2026-04-21 09:12:55', 0.00, 0.00, 50, 0, 1),
(65, 126, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 5000.00, 4000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 4500.00, 31, '2026-04-21', '2026-05-21', 0, NULL, 4500.00, 32, '2026-06-21', '2026-07-21', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-21 08:54:50', '2026-04-21 09:10:34', 0.00, 0.00, 50, 0, 1),
(66, 121, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 5000.00, 4000.00, 40000.00, 'لا منحة', 0.00, NULL, NULL, NULL, 16333.34, 33, '2026-04-21', '2026-05-21', 1, '2026-04-22', 16333.33, 34, '2026-06-21', '2026-07-21', 0, NULL, 16333.33, 41, '2026-08-22', '2026-09-22', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-21 09:33:23', '2026-04-22 08:24:37', 0.00, 0.00, 50, 0, 0),
(67, 123, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 5000.00, 4000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 2250.00, 35, '2026-04-21', '2026-05-21', 0, NULL, 2250.00, 36, '2026-06-21', '2026-07-21', 0, NULL, 2250.00, 37, '2026-08-21', '2026-09-21', 0, NULL, 2250.00, 38, '2026-10-21', '2026-11-21', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-21 10:26:13', '2026-04-21 10:31:07', 0.00, 0.00, 50, 0, 1),
(68, NULL, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 250000.00, 450000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-21 11:47:27', '2026-04-21 11:47:27', 0.00, 0.00, 50, 0, 0),
(69, 127, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 250000.00, 450000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 350000.00, 39, NULL, NULL, 0, NULL, 350000.00, 40, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-21 11:48:06', '2026-04-21 11:48:06', 0.00, 0.00, 50, 0, 0),
(71, 122, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 250000.00, 450000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 350000.00, 42, '2026-04-22', '2026-04-30', 1, '2026-04-23', 175000.00, 43, '2026-05-22', '2026-05-31', 1, '2026-04-23', 175000.00, 48, '2026-06-23', '2026-07-23', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-22 08:19:08', '2026-04-23 09:26:28', 0.00, 0.00, 50, 0, 0),
(72, 115, '2025/2026', 'الدفعة الأولى', 'SDG', 'الفصل الأول', 'postgraduate', 'ماجستير ادارة الاعمال', NULL, 40000.00, 60000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 50000.00, 44, '2026-04-22', '2026-05-22', 1, '2026-04-22', 25000.00, 45, '2026-06-22', '2026-07-22', 0, NULL, 25000.00, 46, '2026-08-22', '2026-09-22', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-22 08:36:25', '2026-04-22 09:20:06', 0.00, 0.00, 50, 0, 0),
(73, NULL, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, 7, 5000.00, 4000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-22 12:53:16', '2026-04-22 12:53:16', 0.00, 0.00, 50, 0, 0),
(75, 114, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 0.00, 0.00, 0.00, 'منحة تفوق', 100.00, 'الوزارة', NULL, NULL, 0.00, NULL, '2026-04-22', '2026-04-30', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-22 13:16:41', '2026-04-23 09:52:39', 0.00, 0.00, 50, 0, 0),
(76, 129, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 5000.00, 4000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 9000.00, 47, '2026-04-22', '2026-05-22', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-22 13:25:48', '2026-04-22 13:25:48', 0.00, 0.00, 50, 0, 0),
(77, 131, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 0.00, 0.00, 0.00, 'منحة أبناء مؤسسين', 100.00, 'الجامعة', NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-23 10:12:23', '2026-04-23 10:46:05', 0.00, 0.00, 50, 0, 0),
(78, 107, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 0.00, 0.00, 0.00, 'منحة أبناء مؤسسين', 100.00, 'الجامعه', NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-23 10:56:49', '2026-04-23 10:56:49', 0.00, 0.00, 50, 0, 0),
(79, 133, '2025/2026', 'الدفعة الأولى', 'SDG', 'الفصل الأول', 'postgraduate', 'ماجستير ادارة الاعمال', NULL, 40000.00, 60000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 50000.00, 50, '2026-04-26', '2026-04-30', 0, NULL, 50000.00, 51, '2026-05-26', '2026-05-31', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-26 11:22:10', '2026-04-26 11:22:10', 0.00, 0.00, 50, 0, 0),
(80, 134, '2025/2026', 'الدفعة الأولى', 'USD', 'الفصل الأول', 'postgraduate', 'ماجستير ادارة الاعمال', NULL, 40000.00, 60000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 100000.00, 52, '2026-04-26', '2026-04-30', 1, '2026-04-26', NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-26 13:00:32', '2026-04-26 13:00:32', 0.00, 0.00, 50, 0, 0),
(81, 137, '2025/2026', 'الدفعة الأولى', 'SDG', 'الفصل الأول', 'postgraduate', 'ماجستير ادارة الاعمال', NULL, 40000.00, 60000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 100000.00, 53, '2026-04-28', '2026-05-28', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-27 11:09:40', '2026-04-27 11:09:40', 0.00, 0.00, 50, 0, 0),
(82, NULL, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, 2, 40000.00, 155000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-28 12:58:28', '2026-04-28 12:58:28', 0.00, 0.00, 50, 0, 0),
(83, 4, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 40000.00, 155000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 195000.00, 54, '2026-04-01', '2026-04-30', 1, '2026-04-28', NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-28 13:02:32', '2026-04-28 13:02:32', 0.00, 0.00, 50, 0, 0),
(84, 139, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 40000.00, 155000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 97500.00, 55, '2026-04-30', '2026-05-08', 0, NULL, 97500.00, 56, '2026-05-30', '2026-06-06', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', '2026-04-30 08:01:22', '2026-04-30 08:01:22', 0.00, 0.00, 50, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `grading_rules`
--

CREATE TABLE `grading_rules` (
  `id` int(11) NOT NULL,
  `rule_type` varchar(30) NOT NULL,
  `program_mode` varchar(20) DEFAULT NULL,
  `label` varchar(255) NOT NULL,
  `min_value` decimal(6,2) NOT NULL,
  `max_value` decimal(6,2) NOT NULL,
  `points` decimal(4,2) DEFAULT NULL,
  `term_calc_mode` enum('percentage','courses') DEFAULT NULL,
  `gpa_max` decimal(4,2) DEFAULT NULL,
  `cumulative_calc_mode` enum('simple_avg','weighted_avg') DEFAULT NULL,
  `sort_order` int(11) NOT NULL DEFAULT 0,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL,
  `faculty_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `grading_rules`
--

INSERT INTO `grading_rules` (`id`, `rule_type`, `program_mode`, `label`, `min_value`, `max_value`, `points`, `term_calc_mode`, `gpa_max`, `cumulative_calc_mode`, `sort_order`, `created_at`, `updated_at`, `faculty_id`) VALUES
(53, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(56, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(59, 'grade_scale', NULL, 'B+', 75.00, 79.99, 3.50, NULL, NULL, NULL, 2, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(62, 'grade_scale', NULL, 'B', 70.00, 74.99, 3.00, NULL, NULL, NULL, 3, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(65, 'grade_scale', NULL, 'C+', 60.00, 69.99, 2.50, NULL, NULL, NULL, 4, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(68, 'grade_scale', NULL, 'C', 50.00, 59.99, 2.00, NULL, NULL, NULL, 5, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(71, 'grade_scale', NULL, 'F', 0.00, 49.99, 0.00, NULL, NULL, NULL, 7, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(87, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(90, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(93, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(96, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(99, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(105, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(108, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(111, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(114, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(212, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(213, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(214, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(215, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(216, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(217, 'grade_scale', NULL, 'C', 50.00, 59.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(218, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(219, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 7, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(220, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(221, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(222, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(223, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(224, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(225, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(226, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(227, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(243, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(244, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(245, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(246, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(247, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(248, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(249, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 6, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(250, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(251, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(252, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(253, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.99, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(254, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(255, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(256, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(257, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(258, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(259, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(260, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(261, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(262, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(263, 'grade_scale', NULL, 'C', 50.00, 59.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(264, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(265, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 7, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(266, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(267, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(268, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(269, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(270, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(271, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(272, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(273, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(274, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(275, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(276, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(277, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(278, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(279, 'grade_scale', NULL, 'C', 50.00, 59.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(280, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(281, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 7, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(282, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(283, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(284, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(285, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(286, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(287, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(288, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(289, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(290, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(291, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(292, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(293, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(294, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(295, 'grade_scale', NULL, 'C', 50.00, 59.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(296, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(297, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 7, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(298, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(299, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(300, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(301, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(302, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(303, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(304, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(305, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(306, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(307, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(308, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(309, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(310, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(311, 'grade_scale', NULL, 'C', 50.00, 59.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(312, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(313, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 7, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(314, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(315, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(316, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(317, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(318, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(319, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(320, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(321, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5);

-- --------------------------------------------------------

--
-- Table structure for table `payments`
--

CREATE TABLE `payments` (
  `id` int(11) NOT NULL,
  `university_id` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `academic_year` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `level_name` varchar(60) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `term_name` varchar(60) DEFAULT NULL,
  `amount_paid` decimal(12,2) NOT NULL,
  `payment_date` datetime NOT NULL,
  `transaction_id` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `bank_ref` varchar(100) DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 0,
  `currency` varchar(10) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT 'SDG',
  `notes` text CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `received_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `is_confirmed` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `payments`
--

INSERT INTO `payments` (`id`, `university_id`, `academic_year`, `level_name`, `term_name`, `amount_paid`, `payment_date`, `transaction_id`, `bank_ref`, `status`, `currency`, `notes`, `received_at`, `is_confirmed`) VALUES
(9, '2025220004', '2025/2026', 'المستوى الأول', NULL, 16333.34, '2026-04-22 08:34:09', '33', 'BANK-REF-XKFNEB31B', 1, 'SDG', '', '2026-04-22 08:33:55', 0),
(11, '321456', '2025/2026', NULL, 'الفصل الأول', 50000.00, '2026-04-22 09:20:30', '44', 'BANK-REF-N7HM7IH26', 1, 'SDG', '', '2026-04-22 08:37:34', 0),
(16, '2025220008', '2025/2026', 'المستوى الأول', NULL, 350000.00, '2026-04-23 09:32:54', '42', 'BANK-REF-IR1RCWZIG', 1, 'SDG', '', '2026-04-23 09:26:35', 1),
(17, '2025220008', '2025/2026', 'المستوى الأول', NULL, 175000.00, '2026-04-23 09:26:42', '43', 'BANK-REF-M23TFIAI6', 1, 'SDG', '', '2026-04-23 09:26:42', 0);

-- --------------------------------------------------------

--
-- Table structure for table `rooms`
--

CREATE TABLE `rooms` (
  `id` int(11) NOT NULL,
  `room_name` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `rooms`
--

INSERT INTO `rooms` (`id`, `room_name`, `created_at`) VALUES
(1, 'قاعة 1', '2025-12-30 12:16:30'),
(2, 'قاعة 2', '2025-12-30 13:36:58'),
(3, 'قاعة 3', '2025-12-30 13:37:03'),
(4, 'قاعة 4', '2026-01-13 07:16:18');

-- --------------------------------------------------------

--
-- Table structure for table `staff_members`
--

CREATE TABLE `staff_members` (
  `id` int(11) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `staff_code` varchar(50) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `faculty_id` int(11) NOT NULL,
  `department_id` int(11) DEFAULT NULL,
  `academic_rank` varchar(100) DEFAULT NULL,
  `specialization` varchar(255) DEFAULT NULL,
  `status` enum('active','inactive') NOT NULL DEFAULT 'active',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `staff_members`
--

INSERT INTO `staff_members` (`id`, `full_name`, `staff_code`, `email`, `phone`, `faculty_id`, `department_id`, `academic_rank`, `specialization`, `status`, `created_at`, `updated_at`) VALUES
(1, 'د. محمد عادل', 'STF-001', 'm.adel@uni.edu', '0912345678', 1, 2, 'أستاذ مساعد', 'قواعد بيانات', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(2, 'د. سارة نبيل', 'STF-002', 's.nabil@uni.edu', '0912345679', 1, 1, 'محاضر', 'شبكات', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(3, 'د. علي الطيب', 'STF-003', 'a.tayeb@uni.edu', '0912345680', 1, 3, 'محاضر', 'هندسة برمجيات', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(4, 'م. أحمد الطيب', 'STF-004', 'eng.ahmed@uni.edu', '0912345681', 2, 5, 'محاضر', 'قدرة وتحكم', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(5, 'م. مروة صالح', 'STF-005', 'm.salih@uni.edu', '0912345682', 2, 4, 'محاضر', 'إنشاءات', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(6, 'د. نادر حسن', 'STF-006', 'n.hassan@uni.edu', '0912345683', 3, 8, 'محاضر', 'إدارة', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(7, 'أ. خالد صالح', 'STF-007', 'k.saleh@uni.edu', '0912345684', 3, 7, 'محاضر', 'محاسبة', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(8, 'أ. ريم عمر', 'STF-008', 'r.omar@uni.edu', '0912345685', 3, 9, 'محاضر', 'اقتصاد', 'active', '2025-12-28 11:20:32', '2026-02-05 12:36:18'),
(10, 'د.محمد علي', NULL, NULL, '09090909', 4, NULL, 'أستاذ مساعد', 'جراحة', 'active', '2025-12-29 13:50:45', '0000-00-00 00:00:00'),
(11, 'هاشم علي', NULL, NULL, NULL, 5, NULL, 'محاضر', 'مختبرات', 'active', '2026-02-09 07:26:18', '0000-00-00 00:00:00'),
(12, 'حامد محمد', NULL, NULL, NULL, 7, NULL, 'أستاذ مساعد', 'لغات', 'active', '2026-04-30 08:02:09', '0000-00-00 00:00:00'),
(13, 'هارون حين', NULL, NULL, NULL, 7, NULL, 'محاضر', 'لغات', 'active', '2026-04-30 08:02:22', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- Table structure for table `students`
--

CREATE TABLE `students` (
  `id` int(11) NOT NULL,
  `first_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `second_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `third_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `fourth_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `full_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `nationality` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT 'الجنسية',
  `gender` enum('male','female') CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `status` enum('active','inactive') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'active',
  `university_id` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '0',
  `phone` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `receipt_number` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `department_id` int(11) DEFAULT NULL,
  `college` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `level` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `academic_year` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `academic_status` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `registration_status` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `notes` text CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `registrar` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `university_id_for_unique` varchar(50) GENERATED ALWAYS AS (nullif(trim(`university_id`),'0')) STORED
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `students`
--

INSERT INTO `students` (`id`, `first_name`, `second_name`, `third_name`, `fourth_name`, `full_name`, `nationality`, `gender`, `status`, `university_id`, `phone`, `receipt_number`, `department_id`, `college`, `level`, `academic_year`, `academic_status`, `registration_status`, `notes`, `registrar`, `created_at`) VALUES
(1, NULL, NULL, NULL, NULL, 'أحمد محمد', NULL, 'male', 'active', '240001', '0978901234', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(2, NULL, NULL, NULL, NULL, 'سارة علي', NULL, 'female', 'active', '240002', '0945678901', NULL, 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(3, 'عمر', 'حسن', 'احمد', 'ابراهيم', 'عمر حسن احمد ابراهيم', 'سوداني', 'male', 'active', '240003', '0912345678', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(4, NULL, NULL, NULL, NULL, 'مريم عثمان', NULL, 'female', 'active', '240004', '0989012345', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(5, NULL, NULL, NULL, NULL, 'خالد يوسف', NULL, 'male', 'active', '240005', '0956789012', NULL, 3, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(6, NULL, NULL, NULL, NULL, 'هبة أحمد', NULL, 'female', 'active', '240006', '0923456789', NULL, 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(7, NULL, NULL, NULL, NULL, 'محمد عبدالسلام', NULL, 'male', 'active', '240007', '0901122334', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(8, NULL, NULL, NULL, NULL, 'آلاء عمر', NULL, 'female', 'active', '240008', '0902233445', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(9, NULL, NULL, NULL, NULL, 'ريم خالد', NULL, 'female', 'active', '240009', '0903344556', NULL, 5, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(10, NULL, NULL, NULL, NULL, 'مصطفى عادل', NULL, 'male', 'active', '240010', '0904455667', NULL, 5, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(11, NULL, NULL, NULL, NULL, 'نهى حسن', NULL, 'female', 'active', '240011', '0905566778', NULL, 5, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(12, NULL, NULL, NULL, NULL, 'ضياء أحمد', NULL, 'male', 'active', '240012', '0906677889', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(13, NULL, NULL, NULL, NULL, 'رنا يوسف', NULL, 'female', 'active', '240013', '0907788990', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(14, NULL, NULL, NULL, NULL, 'إيهاب عثمان', NULL, 'male', 'active', '240014', '0908899001', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(15, NULL, NULL, NULL, NULL, 'سلمى محمد', NULL, 'female', 'active', '240015', '0909900112', NULL, 7, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-28 11:20:32'),
(16, NULL, NULL, NULL, NULL, 'عبير عبده ادم صالح', NULL, 'female', 'active', '201822000313', '090123456', NULL, 3, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-31 13:50:37'),
(17, NULL, NULL, NULL, NULL, 'عبير عبده', NULL, 'female', 'active', '123456789', '09552288', NULL, 5, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-01-14 06:13:04'),
(19, NULL, NULL, NULL, NULL, 'علي هاشم', NULL, 'male', 'active', '147852369', '0987456321', NULL, 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-01-14 08:08:11'),
(20, NULL, NULL, NULL, NULL, 'منعم احمد', NULL, 'male', 'active', '250003', '0905050545', NULL, 10, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-05 12:32:20'),
(21, NULL, NULL, NULL, NULL, 's1', 'سوري', NULL, 'active', 's0001', '122334', NULL, 10, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-07 15:18:18'),
(22, NULL, NULL, NULL, NULL, 's2', NULL, NULL, 'active', 's0002', '321232', NULL, 10, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-07 15:18:44'),
(23, NULL, NULL, NULL, NULL, 's3', NULL, NULL, 'active', 's0003', '32456789', NULL, 10, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-07 15:19:18'),
(24, NULL, NULL, NULL, NULL, 's4', NULL, NULL, 'active', 's0004', '213456789', NULL, 10, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-07 15:19:49'),
(25, NULL, NULL, NULL, NULL, 's5', NULL, NULL, 'active', 's0005', '123456', NULL, 10, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-07 15:20:15'),
(26, NULL, NULL, NULL, NULL, 'أحمد محمد علي', NULL, 'male', 'active', 'MED-250001', '0912345678', 'REC-2501', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(27, NULL, NULL, NULL, NULL, 'سارة حسن عمر', NULL, NULL, 'active', 'MED-250002', '0923456789', 'REC-2502', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(28, NULL, NULL, NULL, NULL, 'عمر خالد يوسف', NULL, NULL, 'active', 'MED-250003', '0934567890', 'REC-2503', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(29, NULL, NULL, NULL, NULL, 'مريم عثمان أحمد', NULL, NULL, 'active', 'MED-250004', '0945678901', 'REC-2504', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(30, NULL, NULL, NULL, NULL, 'خالد محمد حسن', NULL, NULL, 'active', 'MED-250005', '0956789012', 'REC-2505', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(31, NULL, NULL, NULL, NULL, 'هبة علي عبدالله', NULL, NULL, 'active', 'MED-250006', '0967890123', 'REC-2506', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(32, NULL, NULL, NULL, NULL, 'محمد يوسف عمر', NULL, NULL, 'active', 'MED-250007', '0978901234', 'REC-2507', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(33, NULL, NULL, NULL, NULL, 'آلاء أحمد خالد', NULL, NULL, 'active', 'MED-250008', '0989012345', 'REC-2508', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(34, NULL, NULL, NULL, NULL, 'ريم حسن محمد', NULL, NULL, 'active', 'MED-250009', '0990123456', 'REC-2509', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(35, NULL, NULL, NULL, NULL, 'مصطفى عثمان علي', NULL, NULL, 'active', 'MED-250010', '0901234567', 'REC-2510', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(36, NULL, NULL, NULL, NULL, 'نهى خالد يوسف', NULL, NULL, 'active', 'MED-250011', '0912345679', 'REC-2511', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(37, NULL, NULL, NULL, NULL, 'ضياء محمد حسن', NULL, NULL, 'active', 'MED-250012', '0923456790', 'REC-2512', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(38, NULL, NULL, NULL, NULL, 'رنا علي عمر', NULL, NULL, 'active', 'MED-250013', '0934567901', 'REC-2513', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(39, NULL, NULL, NULL, NULL, 'إيهاب يوسف أحمد', NULL, NULL, 'active', 'MED-250014', '0945679012', 'REC-2514', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(40, NULL, NULL, NULL, NULL, 'سلمى حسن خالد', NULL, NULL, 'active', 'MED-250015', '0956789123', 'REC-2515', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(41, NULL, NULL, NULL, NULL, 'عبير محمد عثمان', NULL, NULL, 'active', 'MED-250016', '0967891234', 'REC-2516', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(42, NULL, NULL, NULL, NULL, 'علي أحمد حسن', NULL, NULL, 'active', 'MED-250017', '0978901345', 'REC-2517', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(43, NULL, NULL, NULL, NULL, 'منعم يوسف محمد', NULL, NULL, 'active', 'MED-250018', '0989013456', 'REC-2518', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(44, NULL, NULL, NULL, NULL, 'فاطمة عمر خالد', NULL, NULL, 'active', 'MED-250019', '0990124567', 'REC-2519', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(45, NULL, NULL, NULL, NULL, 'حسن عثمان علي', NULL, NULL, 'active', 'MED-250020', '0901235678', 'REC-2520', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(46, NULL, NULL, NULL, NULL, 'يوسف محمد حسن', NULL, NULL, 'active', 'MED-250021', '0912346789', 'REC-2521', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(47, NULL, NULL, NULL, NULL, 'خالد علي يوسف', NULL, NULL, 'active', 'MED-250022', '0923457890', 'REC-2522', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(48, NULL, NULL, NULL, NULL, 'لينا محمود عبدالله', NULL, NULL, 'active', 'MED-250023', '0934568901', 'REC-2523', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(49, NULL, NULL, NULL, NULL, 'زينب عمر محمد', NULL, NULL, 'active', 'MED-250024', '0945679012', 'REC-2524', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(50, NULL, NULL, NULL, NULL, 'بدر الدين خالد', NULL, NULL, 'active', 'MED-250025', '0956780123', 'REC-2525', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(51, NULL, NULL, NULL, NULL, 'نورا حسن يوسف', NULL, NULL, 'active', 'MED-250026', '0967891234', 'REC-2526', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(52, NULL, NULL, NULL, NULL, 'أيمن علي عثمان', NULL, NULL, 'active', 'MED-250027', '0978902345', 'REC-2527', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(53, NULL, NULL, NULL, NULL, 'سمية محمد أحمد', NULL, NULL, 'active', 'MED-250028', '0989013456', 'REC-2528', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(54, NULL, NULL, NULL, NULL, 'طارق يوسف عمر', NULL, NULL, 'active', 'MED-250029', '0990124567', 'REC-2529', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(55, NULL, NULL, NULL, NULL, 'رقية حسن خالد', NULL, NULL, 'active', 'MED-250030', '0901235678', 'REC-2530', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(56, NULL, NULL, NULL, NULL, 'إبراهيم عثمان علي', NULL, NULL, 'active', 'MED-250031', '0912346789', 'REC-2531', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(57, NULL, NULL, NULL, NULL, 'أمل محمد حسن', NULL, NULL, 'active', 'MED-250032', '0923457890', 'REC-2532', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(58, NULL, NULL, NULL, NULL, 'جمال خالد يوسف', NULL, NULL, 'active', 'MED-250033', '0934568901', 'REC-2533', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(59, NULL, NULL, NULL, NULL, 'لطيفة علي عمر', NULL, NULL, 'active', 'MED-250034', '0945679012', 'REC-2534', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(60, NULL, NULL, NULL, NULL, 'صلاح أحمد محمد', NULL, NULL, 'active', 'MED-250035', '0956780123', 'REC-2535', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(61, NULL, NULL, NULL, NULL, 'هند حسن عثمان', NULL, NULL, 'active', 'MED-250036', '0967891234', 'REC-2536', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(62, NULL, NULL, NULL, NULL, 'عبدالله يوسف خالد', NULL, NULL, 'active', 'MED-250037', '0978902345', 'REC-2537', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(63, NULL, NULL, NULL, NULL, 'مريم علي أحمد', NULL, NULL, 'active', 'MED-250038', '0989013456', 'REC-2538', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(64, NULL, NULL, NULL, NULL, 'فهد محمد عمر', NULL, NULL, 'active', 'MED-250039', '0990124567', 'REC-2539', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(65, NULL, NULL, NULL, NULL, 'سجود حسن يوسف', NULL, NULL, 'active', 'MED-250040', '0901235678', 'REC-2540', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(66, NULL, NULL, NULL, NULL, 'بلال خالد عثمان', NULL, NULL, 'active', 'MED-250041', '0912346789', 'REC-2541', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(67, NULL, NULL, NULL, NULL, 'نوال أحمد محمد', NULL, NULL, 'active', 'MED-250042', '0923457890', 'REC-2542', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(68, NULL, NULL, NULL, NULL, 'عادل علي حسن', NULL, NULL, 'active', 'MED-250043', '0934568901', 'REC-2543', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(69, NULL, NULL, NULL, NULL, 'شيماء يوسف عمر', NULL, NULL, 'active', 'MED-250044', '0945679012', 'REC-2544', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(70, NULL, NULL, NULL, NULL, 'مازن محمد خالد', NULL, NULL, 'active', 'MED-250045', '0956780123', 'REC-2545', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(71, NULL, NULL, NULL, NULL, 'روان حسن أحمد', NULL, NULL, 'active', 'MED-250046', '0967891234', 'REC-2546', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(72, NULL, NULL, NULL, NULL, 'عمار عثمان يوسف', NULL, NULL, 'active', 'MED-250047', '0978902345', 'REC-2547', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(73, NULL, NULL, NULL, NULL, 'لمعان علي محمد', NULL, NULL, 'active', 'MED-250048', '0989013456', 'REC-2548', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(74, NULL, NULL, NULL, NULL, 'بسمة خالد عمر', NULL, NULL, 'active', 'MED-250049', '0990124567', 'REC-2549', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(75, NULL, NULL, NULL, NULL, 'زياد أحمد حسن', NULL, NULL, 'active', 'MED-250050', '0901235679', 'REC-2550', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-02-08 11:25:30'),
(76, NULL, NULL, NULL, NULL, 'فاطمه احمد', NULL, NULL, 'active', '260003', '123456789', NULL, 12, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-09 07:30:08'),
(77, NULL, NULL, NULL, NULL, 'عبدالرحمن', NULL, NULL, 'active', '260001', '0123456789', NULL, 4, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-11 06:43:34'),
(78, NULL, NULL, NULL, NULL, 'وليد', NULL, NULL, 'active', '260004', '3346658', NULL, 11, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-14 12:12:01'),
(79, NULL, NULL, NULL, NULL, 'عواطف عاطف', NULL, NULL, 'active', '250007', '325', NULL, 11, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-14 12:14:58'),
(80, NULL, NULL, NULL, NULL, 'ابتهال عاطف', NULL, NULL, 'active', '250008', '325', NULL, 11, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-14 12:16:48'),
(81, 'هاله', 'حسن', 'احمد', 'ابراهيم', 'هاله حسن احمد ابراهيم', 'سوداني', 'female', 'active', '260002', '0111478552', NULL, 11, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-14 12:17:57'),
(82, NULL, NULL, NULL, NULL, 'عاليه', NULL, NULL, 'active', '357000', '542864', NULL, 11, NULL, NULL, NULL, NULL, NULL, NULL, 'المسجل', '2026-02-14 12:21:47'),
(83, NULL, NULL, NULL, NULL, 'احمد محمد', NULL, NULL, 'active', '2500001', '09052487', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-02 14:06:34'),
(84, NULL, NULL, NULL, NULL, 'خالد احمد', NULL, NULL, 'active', '2500002', '0904580950', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-04 08:44:27'),
(85, NULL, NULL, NULL, NULL, 'ابراهيم محمد', NULL, NULL, 'active', '2500003', '095863987', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-04 08:49:26'),
(86, NULL, NULL, NULL, NULL, 'عبدالرحمن محمد', NULL, NULL, 'active', '2500004', '0114879632', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-04 09:05:02'),
(87, NULL, NULL, NULL, NULL, 'محسن خالد', NULL, NULL, 'active', '2500005', '0118896352', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-04 09:08:57'),
(88, NULL, NULL, NULL, NULL, 'منذر محمد', NULL, NULL, 'active', '2500006', '0115639874', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-04 11:46:11'),
(89, NULL, NULL, NULL, NULL, 'مازن محمد', NULL, NULL, 'active', '2500007', '0114806967', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-04 13:14:43'),
(90, NULL, NULL, NULL, NULL, 'هاشم محمد', NULL, NULL, 'active', '2500010', '0902587412', NULL, 7, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-12 10:12:48'),
(91, NULL, NULL, NULL, NULL, 'ساره خالد', NULL, NULL, 'active', '260012', '0908542158', NULL, 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-12 13:36:27'),
(92, NULL, NULL, NULL, NULL, 'ابراهيم يوسف', 'سوداني', 'male', '', '2025/123456', '098574123', NULL, 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-15 14:32:16'),
(93, NULL, NULL, NULL, NULL, 'ايه محمد', 'سوداني', 'female', 'active', '2025/23456', '0902580910', NULL, 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-15 14:59:53'),
(94, NULL, NULL, NULL, NULL, 'عبدالرازق محمد', 'سوداني', 'male', '', '2500015', '0905800910', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-30 07:56:17'),
(95, NULL, NULL, NULL, NULL, 'يوسف خالد', 'سوداني', 'male', '', '2600001', '09035200001', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-03-31 08:07:03'),
(96, NULL, NULL, NULL, NULL, 'برعي ابراهيم', 'مصري', 'male', '', '2600002', '0900080000', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-01 07:19:45'),
(97, NULL, NULL, NULL, NULL, 'مهند بكري', 'مصري', 'male', '', '2600003', '0114800089', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-01 07:47:52'),
(98, NULL, NULL, NULL, NULL, 'أمنة خالد', 'سوداني', 'female', '', '2026/00001', '0905060850', NULL, 13, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-01 08:10:12'),
(99, NULL, NULL, NULL, NULL, 'خنساء احمد', 'سوداني', 'female', '', '2026/260005', '0900055200', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-04 13:16:44'),
(100, NULL, NULL, NULL, NULL, 'خالد محمد خالد', 'سوداني', 'male', '', '2025/250001', '0900000010', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-05 07:58:48'),
(101, NULL, NULL, NULL, NULL, 'منال محمد علي احمد', 'سوداني', 'female', '', '319011/26', '092508417', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-05 12:01:57'),
(102, 'محمد', 'خالد', 'حسن', 'ابراهيم', 'محمد خالد حسن ابراهيم', 'سوداني', 'male', '', '3258877/26', '0945213699', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-06 08:35:55'),
(103, 'حامد', 'محمد', 'خالد', 'حسن', 'حامد محمد خالد حسن', 'يمني', 'male', '', '55587/26', '0987456321', NULL, 4, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-06 08:54:53'),
(104, 'عابده', 'خالد', 'حسن', 'محمداحمد', 'عابده خالد حسن محمداحمد', NULL, NULL, '', '258963/26', '0125874963', NULL, 13, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-07 07:26:47'),
(105, 'هالة', 'محمدعلي', 'خالد', 'حسن', 'هالة محمدعلي خالد حسن', 'سوداني', 'female', '', '147852/26', '0114785236', NULL, 15, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-08 11:26:05'),
(106, 'خالدة', 'ابراهيم', 'محمد علي', 'احمد', 'خالدة ابراهيم محمد علي احمد', 'سوداني', 'female', '', '369852/26', '0147852369', NULL, 13, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-09 07:59:03'),
(107, 'زينب', 'يوسف', 'محمد', 'خالد', 'زينب يوسف محمد خالد', 'سوداني', 'female', '', '852147', '0114785222', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-14 13:00:38'),
(108, 'حسن', 'محمد', 'حسن', 'ابراهيم', 'حسن محمد حسن ابراهيم', 'سوداني', 'male', '', '3652', '0148555522', NULL, 10, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-15 07:32:18'),
(109, 'مهاب', 'علي', 'حسن', 'ابراهيم', 'مهاب علي حسن ابراهيم', 'سوداني', 'male', 'inactive', '789654', '0114444444', NULL, 13, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-15 08:08:46'),
(110, 'ابتسام', 'محمد احمد', 'علي', 'كرار', 'ابتسام محمد احمد علي كرار', 'سوداني', 'female', 'inactive', '2025147852', '0114785555', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 08:55:37'),
(111, 'منهل', 'خالد', 'ادريس', 'ابكر', 'منهل  خالد ادريس ابكر', 'سوداني', 'female', 'active', '2025369852', '0114523666', NULL, 15, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 09:24:25'),
(112, 'بلقيس', 'حسن', 'فرح', 'همد', 'بلقيس حسن فرح همد', 'سوداني', 'female', 'active', '2025258963', '0114523666', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 09:47:54'),
(113, 'ابتسام', 'محمد احمد', 'حسن', 'محمد احمد', 'ابتسام محمد احمد حسن محمد احمد', 'سوداني', 'female', 'active', '2025258741', '0111478888', NULL, 7, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 10:05:08'),
(114, 'مهاب', 'محمد احمد', 'علي', 'خالد', 'مهاب محمد احمد علي خالد', 'سوري', 'male', 'active', '2025987456', '0114525555', NULL, 7, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 10:11:58'),
(115, 'عبق', 'احمد', 'علي', 'حسن', 'عبق احمد علي حسن', 'سوداني', NULL, '', '2025330002', '0114445552', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 10:36:20'),
(116, 'همس', 'عبدالمنعم', 'محمد', 'عبدالمنعم', 'همس عبدالمنعم محمد عبدالمنعم', 'سوداني', 'female', 'active', '2025785412', '0114888555', NULL, 7, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 10:38:31'),
(117, 'احمد', 'محمد', 'عبدالجليل', 'محمد', 'احمد محمد عبدالجليل محمد', 'سوداني', 'male', 'active', '20258280', '0114703895', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 10:40:16'),
(118, 'محمد', 'ابراهيم', 'حسن', 'محمد', 'محمد ابراهيم حسن محمد', NULL, NULL, 'active', '2025220000', '0114709597', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 11:33:44'),
(119, 'ايه', 'حمزة', 'خالد', 'حسن', 'ايه حمزة خالد حسن', 'سوداني', 'female', 'active', '2025220001', '0114523698', NULL, 7, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 12:54:22'),
(120, 'خنساء', 'احمد', 'ابراهيم', 'علي', 'خنساء احمد ابراهيم علي', 'سوداني', 'female', 'active', '2025220003', '0114777888', NULL, 7, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 15:25:01'),
(121, 'mohammed', 'ali', 'ahmed', 'ali', 'mohammed ali ahmed ali', 'سوداني', 'male', 'active', '2025220004', '0111144455', NULL, 7, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-18 15:27:42'),
(122, 'ali', 'ahmed', 'abdo', 'adam', 'ali ahmed abdo adam', 'سوداني', 'male', 'inactive', '2025220008', '0114789563', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-19 08:40:30'),
(123, 'هاله', 'محمد', 'خالد', 'حسن', 'هاله محمد خالد حسن', 'سوداني', 'female', 'active', '2025170001', '0114505544', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-19 09:00:59'),
(124, 'هاله', 'عبدالمنعم', 'محمد', 'خالد', 'هاله عبدالمنعم محمد خالد', 'سوداني', 'female', 'active', '202500044', '0114709597', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-21 06:49:48'),
(125, 'انسام', 'عبدالله', 'خالد', 'محمد', 'انسام عبدالله خالد محمد', 'سوداني', 'female', 'active', '202500077', '0114778888', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-21 06:59:50'),
(126, 'خالده', 'حسن', 'محمد احمد', 'حسن', 'خالده حسن محمد احمد حسن', 'سوداني', 'female', 'active', '202500088', '0114778855', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-21 08:42:18'),
(127, 'علاء', 'خالد', 'عبدالله', 'ازهري', 'علاء خالد عبدالله ازهري', 'سوداني', 'female', 'active', '202500024', '0114789666', NULL, 13, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-21 11:45:55'),
(128, 'ابراهيم', 'ازهري', 'محمد', 'علي', 'ابراهيم ازهري محمد علي', 'سوداني', 'male', 'active', '202500059', '0114777888', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-22 09:46:50'),
(129, 'صالح', 'حسن', 'عبدالله', 'محمد', 'صالح حسن عبدالله محمد', 'سوداني', 'male', 'active', '202400001', '0114702589', NULL, 7, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-22 13:25:13'),
(130, 'ميمان', 'عوض', 'خالد', 'احمد', 'ميمان عوض خالد احمد', 'سوداني', 'female', 'active', '0', '0114788888', NULL, 7, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-22 13:27:20'),
(131, 'عبدالرحيم', 'محمد', 'عبدالله', 'محمد', 'عبدالرحيم محمد عبدالله محمد', 'سوداني', 'male', 'active', '20250014', '0144788888', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-23 10:11:38'),
(132, 'عناب', 'عامر', 'عمر', 'حسن', 'عناب عامر عمر حسن', NULL, NULL, 'active', '2025000147', '0114777888', NULL, 3, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-25 13:15:36'),
(133, 'محراب', 'علي', 'محمد', 'حسن', 'محراب علي محمد حسن', 'سوداني', 'female', 'active', '202500478', '0987777774', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-26 11:21:36'),
(134, 'امتنان', 'هاشم', 'عطا', 'خالد', 'امتنان هاشم عطا خالد', 'سوداني', 'female', 'active', '20254477', '0114477788', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-26 13:00:03'),
(137, 'لدن', 'محمد', 'علي', 'محمد', 'لدن محمد علي محمد', 'سوداني', 'female', 'active', '202500034', '0988887777', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-27 11:08:37'),
(138, 'هاله', 'توم', 'محمد', 'توم', 'هاله توم محمد توم', 'سوداني', 'female', 'active', '0', '0114785222', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-28 12:33:44'),
(139, 'امتنان', 'حسن', 'صالح', 'حسن', 'امتنان حسن صالح حسن', 'سوداني', 'female', 'active', '20254411', '0114785236', NULL, 13, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-30 08:00:47');

-- --------------------------------------------------------

--
-- Table structure for table `student_registrations`
--

CREATE TABLE `student_registrations` (
  `id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `academic_year` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `level_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `term_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `academic_status` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'منتظم',
  `registration_status` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'NUll',
  `receipt_number` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `notes` text CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `repeated_courses` text CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `registrar` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `result_status` tinyint(1) DEFAULT NULL COMMENT '1 = ناجح, 0 = راسب',
  `program_type` enum('diploma','bachelor','postgraduate') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'bachelor',
  `postgraduate_data` longtext CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `postgraduate_program` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `repeat_count` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `student_registrations`
--

INSERT INTO `student_registrations` (`id`, `student_id`, `academic_year`, `level_name`, `term_name`, `academic_status`, `registration_status`, `receipt_number`, `notes`, `repeated_courses`, `registrar`, `created_at`, `result_status`, `program_type`, `postgraduate_data`, `postgraduate_program`, `repeat_count`) VALUES
(1, 1, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025001', NULL, NULL, 'seed', '2025-12-28 09:20:32', 1, 'bachelor', NULL, NULL, 0),
(2, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025002', NULL, NULL, 'seed', '2025-12-28 09:20:32', NULL, 'bachelor', NULL, NULL, 0),
(3, 3, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025003', NULL, NULL, 'seed', '2025-12-28 09:20:32', 1, 'bachelor', NULL, NULL, 0),
(4, 4, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025004', NULL, NULL, 'seed', '2025-12-28 09:20:32', 1, 'bachelor', NULL, NULL, 0),
(5, 5, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025005', NULL, NULL, 'seed', '2025-12-28 09:20:32', NULL, 'bachelor', NULL, NULL, 0),
(6, 6, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025006', NULL, NULL, 'seed', '2025-12-28 09:20:32', NULL, 'bachelor', NULL, NULL, 0),
(7, 7, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025007', NULL, NULL, 'seed', '2025-12-28 09:20:32', 1, 'bachelor', NULL, NULL, 0),
(8, 8, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025008', NULL, NULL, 'seed', '2025-12-28 09:20:32', 1, 'bachelor', NULL, NULL, 0),
(9, 9, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'مجمّد', 'مسجّل', 'REG-2025009', NULL, NULL, 'admin', '2025-12-28 09:20:32', 1, 'bachelor', NULL, NULL, 0),
(10, 10, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025010', NULL, NULL, 'seed', '2025-12-28 09:20:32', 1, 'bachelor', NULL, NULL, 0),
(11, 11, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025011', NULL, NULL, 'seed', '2025-12-28 09:20:32', 0, 'bachelor', NULL, NULL, 0),
(12, 12, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025012', NULL, NULL, 'seed', '2025-12-28 09:20:32', 1, 'bachelor', NULL, NULL, 0),
(13, 13, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025013', NULL, NULL, 'seed', '2025-12-28 09:20:32', 1, 'bachelor', NULL, NULL, 0),
(14, 14, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025014', NULL, NULL, 'seed', '2025-12-28 09:20:32', 1, 'bachelor', NULL, NULL, 0),
(15, 15, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-2025015', NULL, NULL, 'seed', '2025-12-28 09:20:32', NULL, 'bachelor', NULL, NULL, 0),
(16, 16, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'مجمّد', 'مسجّل', NULL, NULL, NULL, 'admin', '2025-12-31 11:50:37', NULL, 'postgraduate', '{\"prev_degree\":\"بكالوريوس\",\"prev_university\":\"السودان\",\"prev_grad_year\":\"2025\",\"study_type\":\"بالبحث\"}', 'ماجستير البرمجيات المدمجة', 0),
(32, 12, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-01 08:36:31', NULL, 'bachelor', NULL, NULL, 0),
(33, 13, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-01 08:36:31', NULL, 'bachelor', NULL, NULL, 0),
(34, 14, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-01 08:36:31', NULL, 'bachelor', NULL, NULL, 0),
(35, 12, '2026/2027', 'المستوى الثالث', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-02 07:49:14', NULL, 'bachelor', NULL, NULL, 0),
(36, 13, '2026/2027', 'المستوى الثالث', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-02 07:49:14', NULL, 'bachelor', NULL, NULL, 0),
(37, 14, '2026/2027', 'المستوى الثالث', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-02 07:49:14', NULL, 'bachelor', NULL, NULL, 0),
(48, 1, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-03 14:25:48', 1, 'bachelor', NULL, NULL, 0),
(49, 3, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, 'إعادة مادة راسبة', '3', 'admin', '2026-02-03 14:25:48', 1, 'bachelor', NULL, NULL, 0),
(51, 7, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-03 14:25:48', 1, 'bachelor', NULL, NULL, 0),
(52, 8, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-03 14:25:48', 1, 'bachelor', NULL, NULL, 0),
(53, 1, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-05 12:22:50', 1, 'bachelor', NULL, NULL, 0),
(54, 3, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-05 12:22:50', 1, 'bachelor', NULL, NULL, 0),
(56, 7, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-05 12:22:50', 1, 'bachelor', NULL, NULL, 0),
(57, 8, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'admin', '2026-02-05 12:22:50', 1, 'bachelor', NULL, NULL, 0),
(58, 20, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-05 12:32:20', 0, 'bachelor', NULL, NULL, 0),
(65, 17, '2025/2026', 'المستوى الخامس', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-07 11:10:34', 1, 'bachelor', NULL, NULL, 0),
(66, 17, '2025/2026', 'المستوى الخامس', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, 'إعادة مادة راسبة', '30', 'admin', '2026-02-07 11:11:04', 1, 'bachelor', NULL, NULL, 0),
(67, 21, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-07 15:18:18', 1, 'bachelor', NULL, NULL, 0),
(68, 22, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-07 15:18:44', 1, 'bachelor', NULL, NULL, 0),
(69, 23, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-07 15:19:18', 1, 'bachelor', NULL, NULL, 0),
(70, 24, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-07 15:19:49', 0, 'bachelor', NULL, NULL, 0),
(71, 25, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-07 15:20:15', 0, 'bachelor', NULL, NULL, 0),
(72, 20, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-07 15:21:07', 0, 'bachelor', NULL, NULL, 0),
(73, 21, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-07 15:21:07', 1, 'bachelor', NULL, NULL, 0),
(74, 22, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-07 15:21:07', 1, 'bachelor', NULL, NULL, 0),
(75, 23, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-07 15:21:07', 1, 'bachelor', NULL, NULL, 0),
(76, 24, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-07 15:21:07', 0, 'bachelor', NULL, NULL, 0),
(77, 25, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-07 15:21:07', 0, 'bachelor', NULL, NULL, 0),
(108, 20, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:07:51', NULL, 'bachelor', NULL, NULL, 0),
(109, 21, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:07:51', NULL, 'bachelor', NULL, NULL, 0),
(110, 22, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:07:51', NULL, 'bachelor', NULL, NULL, 0),
(111, 23, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:07:51', NULL, 'bachelor', NULL, NULL, 0),
(112, 24, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'إعادة', 'مسجّل', NULL, NULL, '16,17,18,19,20,21,22', 'المسجل', '2026-02-08 11:07:51', NULL, 'bachelor', NULL, NULL, 1),
(113, 25, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:07:51', NULL, 'bachelor', NULL, NULL, 0),
(114, 26, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252501', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(115, 27, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252502', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(116, 28, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252503', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(117, 29, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252504', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(118, 30, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252505', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(119, 31, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252506', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(120, 32, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252507', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(121, 33, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252508', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(122, 34, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252509', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(123, 35, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252510', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(124, 36, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252511', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(125, 37, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252512', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(126, 38, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252513', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(127, 39, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', 'REG-20252514', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(128, 40, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252515', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(129, 41, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252516', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(130, 42, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252517', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(131, 43, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252518', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(132, 44, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252519', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(133, 45, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252520', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(134, 46, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252521', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(135, 47, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252522', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(136, 48, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252523', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(137, 49, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252524', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(138, 50, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252525', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(139, 51, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252526', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(140, 52, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252527', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(141, 53, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252528', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(142, 54, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252529', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(143, 55, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252530', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(144, 56, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252531', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(145, 57, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252532', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(146, 58, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252533', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(147, 59, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252534', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(148, 60, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252535', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(149, 61, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252536', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(150, 62, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252537', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(151, 63, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252538', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(152, 64, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252539', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(153, 65, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252540', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(154, 66, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252541', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(155, 67, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252542', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(156, 68, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252543', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(157, 69, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252544', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(158, 70, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252545', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(159, 71, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252546', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(160, 72, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252547', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(161, 73, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252548', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(162, 74, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252549', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(163, 75, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', 'REG-20252550', NULL, NULL, 'admin', '2026-02-08 11:42:18', 1, 'bachelor', NULL, NULL, 0),
(164, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(165, 6, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(166, 40, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(167, 41, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(168, 42, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(169, 43, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(170, 44, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(171, 45, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(172, 46, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(173, 47, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(174, 48, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(175, 49, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(176, 50, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(177, 51, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(178, 52, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(179, 53, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(180, 54, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(181, 55, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(182, 56, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(183, 57, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(184, 58, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(185, 59, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(186, 60, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(187, 61, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(188, 62, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(189, 63, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(190, 64, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(191, 65, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(192, 66, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(193, 67, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(194, 68, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(195, 69, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(196, 70, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(197, 71, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(198, 72, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(199, 73, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(200, 74, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(201, 75, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-02-08 11:58:40', NULL, 'bachelor', NULL, NULL, 0),
(202, 2, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(203, 6, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(204, 40, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(205, 41, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(206, 42, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(207, 43, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(208, 44, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(209, 45, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(210, 46, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(211, 47, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(212, 48, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(213, 49, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(214, 50, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(215, 51, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(216, 52, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(217, 53, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(218, 54, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(219, 55, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(220, 56, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(221, 57, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(222, 58, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(223, 59, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(224, 60, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(225, 61, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(226, 62, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(227, 63, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(228, 64, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(229, 65, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(230, 66, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(231, 67, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(232, 68, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(233, 69, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(234, 70, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(235, 71, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(236, 72, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(237, 73, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(238, 74, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(239, 75, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-08 12:58:48', NULL, 'bachelor', NULL, NULL, 0),
(240, 76, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-09 07:30:08', NULL, 'bachelor', NULL, NULL, 0),
(241, 77, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'ahdi', '2026-02-11 06:43:34', NULL, 'bachelor', NULL, NULL, 0),
(242, 78, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'ahdi', '2026-02-14 12:12:01', NULL, 'bachelor', NULL, NULL, 0),
(243, 82, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-02-14 12:21:47', NULL, 'bachelor', NULL, NULL, 0),
(244, 6, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-03-01 11:33:25', NULL, 'bachelor', NULL, NULL, 0),
(245, 6, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-03-01 11:35:12', NULL, 'bachelor', NULL, NULL, 0),
(246, 83, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-03-02 14:06:34', 1, 'bachelor', NULL, NULL, 0),
(247, 83, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'admin', '2026-03-04 07:39:32', NULL, 'bachelor', NULL, NULL, 0),
(248, 84, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-03-04 08:44:27', NULL, 'bachelor', NULL, NULL, 0),
(249, 85, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'المسجل', '2026-03-04 08:49:26', NULL, 'bachelor', NULL, NULL, 0),
(250, 86, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'ki', '2026-03-04 09:05:02', NULL, 'bachelor', NULL, NULL, 0),
(251, 87, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'ki', '2026-03-04 09:08:58', NULL, 'bachelor', NULL, NULL, 0),
(252, 85, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, '', '2026-03-04 09:11:57', NULL, 'bachelor', NULL, NULL, 0),
(253, 84, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'نظامي', 'مسجّل', NULL, NULL, NULL, '', '2026-03-04 09:11:57', NULL, 'bachelor', NULL, NULL, 0),
(254, 86, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'mohmed', '2026-03-04 09:11:57', NULL, 'bachelor', NULL, NULL, 0),
(255, 87, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'mohmed', '2026-03-04 09:11:57', NULL, 'bachelor', NULL, NULL, 0),
(256, 88, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', ' غير مسجّل', NULL, NULL, NULL, 'mohmed', '2026-03-04 11:46:11', NULL, 'bachelor', NULL, NULL, 0),
(257, 89, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'ki', '2026-03-04 13:14:43', NULL, 'bachelor', NULL, NULL, 0),
(258, 1, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-03-09 11:53:00', 1, 'bachelor', NULL, NULL, 0),
(259, 3, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-03-09 11:53:00', 1, 'bachelor', NULL, NULL, 0),
(260, 7, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-03-09 11:53:00', 1, 'bachelor', NULL, NULL, 0),
(262, 1, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-03-09 11:54:48', 0, 'bachelor', NULL, NULL, 0),
(263, 3, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-03-09 11:54:48', 1, 'bachelor', NULL, NULL, 0),
(264, 7, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-03-09 11:54:48', 1, 'bachelor', NULL, NULL, 0),
(266, 1, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-03-09 11:57:30', 1, 'bachelor', NULL, NULL, 0),
(267, 3, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-03-09 11:57:30', 1, 'bachelor', NULL, NULL, 0),
(268, 7, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-03-09 11:57:30', 1, 'bachelor', NULL, NULL, 0),
(270, 90, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-03-12 10:12:48', NULL, 'bachelor', NULL, NULL, 0),
(271, 91, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-03-12 13:36:27', NULL, 'diploma', NULL, NULL, 0),
(272, 92, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-03-15 14:32:16', NULL, 'bachelor', NULL, NULL, 0),
(273, 93, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-03-15 14:59:53', NULL, 'bachelor', NULL, NULL, 0),
(274, 94, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-03-30 07:56:17', NULL, 'bachelor', NULL, NULL, 0),
(275, 95, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-03-31 08:07:03', NULL, 'bachelor', NULL, NULL, 0),
(276, 96, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-01 07:19:45', NULL, 'bachelor', NULL, NULL, 0),
(277, 97, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-01 07:47:52', NULL, 'bachelor', NULL, NULL, 0),
(278, 98, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-01 08:10:12', NULL, 'bachelor', NULL, NULL, 0),
(279, 99, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-04 13:16:44', NULL, 'bachelor', NULL, NULL, 0),
(280, 100, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'xxyy', '2026-04-05 07:58:48', NULL, 'postgraduate', '{\"prev_degree\":\"بكالوريوس\",\"prev_university\":\"الاهليه\",\"prev_grad_year\":\"2024\",\"study_type\":\"بالبحث\"}', 'ماجستير ادارة الاعمال', 0),
(281, 101, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'mohmmed', '2026-04-05 12:01:57', NULL, 'bachelor', NULL, NULL, 0),
(282, 102, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-06 08:35:55', NULL, 'bachelor', NULL, NULL, 0),
(283, 103, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-06 08:54:53', NULL, 'bachelor', NULL, NULL, 0),
(284, 101, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-06 10:22:25', NULL, 'bachelor', NULL, NULL, 0),
(285, 103, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-06 13:09:37', NULL, 'bachelor', NULL, NULL, 0),
(286, 103, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-06 13:10:20', NULL, 'bachelor', NULL, NULL, 0),
(288, 104, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-07 07:38:24', 1, 'bachelor', NULL, NULL, 0),
(289, 101, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-07 13:13:18', NULL, 'bachelor', NULL, NULL, 0),
(290, 105, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-08 11:26:05', NULL, 'bachelor', NULL, NULL, 0),
(291, 106, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-09 07:59:03', 1, 'bachelor', NULL, NULL, 0),
(292, 107, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'مجمّد', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-14 13:00:38', NULL, 'bachelor', NULL, NULL, 0),
(293, 94, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-14 13:26:54', NULL, 'bachelor', NULL, NULL, 0),
(294, 108, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-15 07:32:18', NULL, 'bachelor', NULL, NULL, 0),
(295, 109, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'فصل', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-15 08:08:46', 0, 'bachelor', NULL, NULL, 0),
(296, 110, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-18 08:55:37', NULL, 'bachelor', NULL, NULL, 0),
(297, 111, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-18 09:24:25', NULL, 'bachelor', NULL, NULL, 0),
(298, 112, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-18 09:47:54', NULL, 'bachelor', NULL, NULL, 0),
(299, 113, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-18 10:05:08', NULL, 'bachelor', NULL, NULL, 0),
(300, 114, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-18 10:11:58', NULL, 'bachelor', NULL, NULL, 0),
(301, 115, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-18 10:36:20', 1, 'postgraduate', '{\"prev_degree\":\"بكالوريوس\",\"prev_university\":\"جامعه البحر الاحمر\",\"prev_grad_year\":\"2025\",\"study_type\":\"بالكورسات\"}', 'ماجستير ادارة الاعمال', 0),
(302, 116, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-18 10:38:31', NULL, 'postgraduate', '{\"prev_degree\":\"بكالوريوس\",\"prev_university\":\"كلية الشرق\",\"prev_grad_year\":\"2025\",\"study_type\":\"بالكورسات\"}', 'ماجستير ادارة الاعمال', 0),
(303, 117, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-18 10:40:16', NULL, 'bachelor', NULL, NULL, 0),
(304, 118, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, '', '2026-04-18 11:33:45', NULL, 'bachelor', NULL, NULL, 0),
(305, 119, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-18 12:54:22', NULL, 'bachelor', NULL, NULL, 0),
(306, 120, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-18 15:25:02', NULL, 'bachelor', NULL, NULL, 0),
(307, 121, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-18 15:27:42', NULL, 'bachelor', NULL, NULL, 0),
(308, 93, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-19 08:38:52', NULL, 'bachelor', NULL, NULL, 0),
(309, 122, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-19 08:40:31', NULL, 'bachelor', NULL, NULL, 0),
(310, 123, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-19 09:01:00', NULL, 'bachelor', NULL, NULL, 0),
(311, 7, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-20 10:07:39', 1, 'bachelor', NULL, NULL, 0),
(312, 7, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-20 10:09:50', 1, 'bachelor', NULL, NULL, 0),
(313, 124, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-21 06:49:49', 1, 'postgraduate', '{\"prev_degree\":\"بكالوريوس\",\"prev_university\":\"كليه الشرق\",\"prev_grad_year\":\"2025\",\"study_type\":\"بالكورسات\"}', 'ماجستير ادارة الاعمال', 0),
(314, 125, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-21 06:59:51', 1, 'postgraduate', '{\"prev_degree\":\"بكالوريوس\",\"prev_university\":\"جامعه السودان\",\"prev_grad_year\":\"2025\",\"study_type\":\"بالكورسات\"}', 'ماجستير ادارة الاعمال', 0),
(315, 126, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-21 08:42:18', NULL, 'bachelor', NULL, NULL, 0),
(316, 127, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-21 11:45:55', 0, 'bachelor', NULL, NULL, 0),
(317, 128, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-22 09:46:50', 1, 'bachelor', NULL, NULL, 0),
(318, 129, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-22 13:25:13', NULL, 'bachelor', NULL, NULL, 0),
(319, 130, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-22 13:27:20', NULL, 'bachelor', NULL, NULL, 0),
(320, 131, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-23 10:11:38', NULL, 'bachelor', NULL, NULL, 0),
(321, 107, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-23 11:36:32', NULL, 'bachelor', NULL, NULL, 0),
(322, 131, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-23 11:36:32', NULL, 'bachelor', NULL, NULL, 0),
(323, 132, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, '', '2026-04-25 13:15:36', NULL, 'diploma', NULL, NULL, 0),
(324, 133, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-26 11:21:36', 0, 'postgraduate', '{\"prev_degree\":\"بكالوريوس\",\"prev_university\":\"المشرق\",\"prev_grad_year\":\"2025\",\"study_type\":\"بالكورسات\"}', 'ماجستير ادارة الاعمال', 0),
(325, 134, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-26 13:00:03', 0, 'postgraduate', '{\"prev_degree\":\"بكالوريوس\",\"prev_university\":\"الفجر\",\"prev_grad_year\":\"2025\",\"study_type\":\"بالكورسات\"}', 'ماجستير ادارة الاعمال', 0),
(326, 115, '2025/2026', 'الدفعة الأولى', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-26 14:48:45', NULL, 'postgraduate', NULL, 'ماجستير ادارة الاعمال', 0),
(327, 134, '2025/2026', 'الدفعة الأولى', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-26 14:48:45', NULL, 'postgraduate', NULL, 'ماجستير ادارة الاعمال', 0),
(328, 137, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-27 11:08:37', 1, 'postgraduate', '{\"prev_degree\":\"بكالوريوس\",\"prev_university\":\"كلية الشرق\",\"prev_grad_year\":\"2025\",\"study_type\":\"بالكورسات\"}', 'ماجستير ادارة الاعمال', 0),
(329, 138, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-28 12:33:44', NULL, 'bachelor', NULL, NULL, 0),
(330, 4, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-04-28 13:03:24', NULL, 'bachelor', NULL, NULL, 0),
(331, 4, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, 'إعادة مادة راسبة', '3', 'kian', '2026-04-28 13:03:47', NULL, 'bachelor', NULL, NULL, 0),
(332, 139, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'إيقاف (one_year)', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-04-30 08:00:47', 1, 'bachelor', NULL, NULL, 0),
(333, 139, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'NUll', NULL, NULL, NULL, NULL, '2026-04-30 10:29:22', NULL, 'bachelor', NULL, NULL, 0),
(334, 139, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'NUll', NULL, NULL, NULL, NULL, '2026-04-30 11:34:36', NULL, 'bachelor', NULL, NULL, 0),
(335, 139, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'NUll', NULL, NULL, NULL, NULL, '2026-04-30 11:36:32', NULL, 'bachelor', NULL, NULL, 0);

-- --------------------------------------------------------

--
-- Table structure for table `term_results`
--

CREATE TABLE `term_results` (
  `id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `faculty_id` int(11) NOT NULL,
  `department_id` int(11) NOT NULL,
  `academic_year` varchar(20) NOT NULL,
  `level_name` varchar(60) NOT NULL,
  `term_name` varchar(50) NOT NULL,
  `program_type` enum('diploma','bachelor','postgraduate') NOT NULL DEFAULT 'bachelor',
  `program_mode` enum('honors','general') NOT NULL DEFAULT 'honors',
  `term_gpa` decimal(4,2) DEFAULT NULL,
  `cumulative_gpa` decimal(4,2) DEFAULT NULL,
  `term_total_points` decimal(10,2) DEFAULT NULL,
  `term_total_hours` decimal(10,2) DEFAULT NULL,
  `classification_label` varchar(255) DEFAULT NULL,
  `courses_count` int(11) DEFAULT 0,
  `completed_courses` int(11) DEFAULT 0,
  `missing_courses` int(11) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `postgraduate_program` varchar(255) DEFAULT NULL,
  `failed_hours` int(11) DEFAULT 0 COMMENT 'ساعات المواد المرسوبة في الفصل',
  `recommendation` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `term_results`
--

INSERT INTO `term_results` (`id`, `student_id`, `faculty_id`, `department_id`, `academic_year`, `level_name`, `term_name`, `program_type`, `program_mode`, `term_gpa`, `cumulative_gpa`, `term_total_points`, `term_total_hours`, `classification_label`, `courses_count`, `completed_courses`, `missing_courses`, `created_at`, `updated_at`, `postgraduate_program`, `failed_hours`, `recommendation`) VALUES
(61, 8, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 2.65, 2.65, 34.50, 13.00, 'مرتبة الشرف الثانية (القسم الثاني)', 4, 4, 0, '2026-04-26 09:04:17', '2026-04-30 06:59:00', NULL, 4, NULL),
(62, 1, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 2.65, 2.65, 34.50, 13.00, 'مرتبة الشرف الثانية (القسم الثاني)', 4, 4, 0, '2026-04-26 09:04:17', '2026-04-30 06:59:00', NULL, 4, NULL),
(63, 128, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 2.65, 2.65, 34.50, 13.00, 'مرتبة الشرف الثانية (القسم الثاني)', 4, 4, 0, '2026-04-26 09:04:17', '2026-04-30 06:59:00', NULL, 4, NULL),
(64, 3, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 3.35, 3.35, 43.50, 13.00, 'مرتبة الشرف الثانية (القسم الأول)', 4, 4, 0, '2026-04-26 09:04:17', '2026-04-30 06:59:00', NULL, 0, NULL),
(65, 7, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 3.38, 3.38, 44.00, 13.00, 'مرتبة الشرف الثانية (القسم الأول)', 4, 4, 0, '2026-04-26 09:04:17', '2026-04-30 06:59:00', NULL, 0, NULL),
(66, 4, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 2.54, 2.54, 33.00, 13.00, 'مرتبة الشرف الثانية (القسم الثاني)', 4, 4, 0, '2026-04-26 09:04:17', '2026-04-30 06:59:00', NULL, 3, NULL),
(67, 125, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'postgraduate', 'general', 4.00, 4.00, 36.00, 9.00, 'ممتاز', 3, 3, 0, '2026-04-26 11:08:37', '2026-04-27 13:28:28', 'ماجستير ادارة الاعمال', 0, NULL),
(68, 115, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'postgraduate', 'general', 3.83, 3.83, 34.50, 9.00, 'ممتاز', 3, 3, 0, '2026-04-26 11:08:37', '2026-04-27 13:28:28', 'ماجستير ادارة الاعمال', 0, NULL),
(69, 124, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'postgraduate', 'general', 3.50, 3.50, 31.50, 9.00, 'ممتاز', 3, 3, 0, '2026-04-26 11:08:37', '2026-04-27 13:28:28', 'ماجستير ادارة الاعمال', 0, NULL),
(70, 134, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'postgraduate', 'general', 0.00, 0.00, 0.00, 9.00, NULL, 3, 3, 0, '2026-04-27 11:14:28', '2026-04-27 13:28:28', 'ماجستير ادارة الاعمال', 9, NULL),
(71, 137, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'postgraduate', 'general', 3.83, 3.83, 34.50, 9.00, 'ممتاز', 3, 3, 0, '2026-04-27 11:14:28', '2026-04-27 13:28:28', 'ماجستير ادارة الاعمال', 0, NULL),
(72, 133, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'postgraduate', 'general', 0.00, 0.00, 0.00, 9.00, NULL, 3, 3, 0, '2026-04-27 11:14:28', '2026-04-27 13:28:28', 'ماجستير ادارة الاعمال', 9, NULL),
(73, 139, 7, 13, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 2.06, 2.06, 16.50, 8.00, 'مرتبة الشرف الثالثة', 3, 3, 0, '2026-04-30 11:07:53', '2026-04-30 11:37:05', NULL, 2, NULL),
(74, 106, 7, 13, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 3.25, 3.25, 26.00, 8.00, 'مرتبة الشرف الثانية(القسم الأول)', 3, 3, 0, '2026-04-30 11:07:53', '2026-04-30 11:37:05', NULL, 0, NULL),
(75, 104, 7, 13, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 3.63, 3.63, 29.00, 8.00, 'مرتبة الشرف الأولى', 3, 3, 0, '2026-04-30 11:07:53', '2026-04-30 11:37:05', NULL, 0, NULL),
(76, 127, 7, 13, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 0.00, 0.00, 0.00, 8.00, NULL, 3, 3, 0, '2026-04-30 11:07:53', '2026-04-30 11:37:05', NULL, 8, NULL),
(77, 109, 7, 13, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 1.94, 1.94, 15.50, 8.00, NULL, 3, 3, 0, '2026-04-30 11:07:53', '2026-04-30 11:37:05', NULL, 3, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `timetable_sessions`
--

CREATE TABLE `timetable_sessions` (
  `id` int(11) NOT NULL,
  `faculty_id` int(11) NOT NULL,
  `department_id` int(11) NOT NULL,
  `academic_year` varchar(20) NOT NULL,
  `level_name` varchar(50) NOT NULL,
  `term_name` varchar(50) NOT NULL,
  `program_type` enum('diploma','bachelor','postgraduate') NOT NULL DEFAULT 'bachelor',
  `postgraduate_program` varchar(120) DEFAULT NULL,
  `course_id` int(11) NOT NULL,
  `instructor_staff_id` int(11) DEFAULT NULL,
  `instructor_name` varchar(150) DEFAULT NULL,
  `room_id` int(11) NOT NULL,
  `day_of_week` varchar(20) NOT NULL,
  `start_time` time NOT NULL,
  `end_time` time NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `timetable_sessions`
--

INSERT INTO `timetable_sessions` (`id`, `faculty_id`, `department_id`, `academic_year`, `level_name`, `term_name`, `program_type`, `postgraduate_program`, `course_id`, `instructor_staff_id`, `instructor_name`, `room_id`, `day_of_week`, `start_time`, `end_time`, `created_at`) VALUES
(1, 3, 8, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, 10, NULL, 'أ. ريم عمر', 2, 'الأحد', '08:00:00', '10:00:00', '2025-12-30 12:50:43'),
(5, 2, 5, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, 8, NULL, 'م. أحمد الطيب', 3, 'الأحد', '10:00:00', '12:00:00', '2025-12-31 09:04:46'),
(11, 3, 9, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, 11, NULL, 'أ. ريم عمر', 1, 'السبت', '08:00:00', '10:00:00', '2025-12-31 12:24:48'),
(12, 1, 3, '2026/2027', 'المسوى الأول', 'الفصل الأول', 'postgraduate', 'ماجستير البرمجيات المدمجة', 12, NULL, 'د. علي الطيب', 1, 'السبت', '08:00:00', '10:00:00', '2025-12-31 13:52:56'),
(13, 3, 8, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, 9, NULL, 'د. نادر حسن', 3, 'السبت', '08:00:00', '10:00:00', '2026-01-12 08:44:34'),
(16, 1, 1, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, 6, NULL, 'د. علي الطيب', 2, 'السبت', '08:00:00', '10:00:00', '2026-01-13 06:35:14'),
(17, 3, 8, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, 10, NULL, 'أ. ريم عمر', 1, 'السبت', '12:00:00', '14:00:00', '2026-01-13 08:24:23'),
(19, 1, 3, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'postgraduate', 'ماجستير البرمجيات المدمجة', 12, NULL, NULL, 1, 'الأحد', '09:00:00', '10:00:00', '2026-01-17 14:27:31'),
(21, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, 15, NULL, 'د. علي الطيب', 2, 'السبت', '10:00:00', '12:00:00', '2026-02-05 12:46:29'),
(22, 3, 8, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, 10, NULL, 'أ. ريم عمر', 2, 'السبت', '14:00:00', '15:00:00', '2026-02-09 12:20:44'),
(23, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, 1, NULL, 'د. محمد عادل', 1, 'السبت', '14:00:00', '15:00:00', '2026-04-20 12:49:34'),
(24, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, 3, NULL, 'د. سارة نبيل', 2, 'الاثنين', '08:00:00', '10:00:00', '2026-04-20 12:50:52'),
(25, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'postgraduate', 'ماجستير ادارة الاعمال', 67, NULL, 'أ. ريم عمر', 1, 'السبت', '10:00:00', '12:00:00', '2026-04-26 13:07:41');

--
-- Triggers `timetable_sessions`
--
DELIMITER $$
CREATE TRIGGER `trg_timetable_no_conflicts` BEFORE INSERT ON `timetable_sessions` FOR EACH ROW BEGIN
    -- 1. Instructor conflict → مقيد بالسنة الدراسية فقط (بدون term_name)
    IF NEW.instructor_name IS NOT NULL THEN
        IF EXISTS (
            SELECT 1
            FROM timetable_sessions
            WHERE instructor_name = NEW.instructor_name
              AND academic_year   = NEW.academic_year          -- السنة بس
              AND day_of_week     = NEW.day_of_week
              AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
        ) THEN
            SIGNAL SQLSTATE '45000'
            SET MESSAGE_TEXT = 'تضارب: الأستاذ لديه محاضرة أخرى في نفس الزمن واليوم في هذه السنة الدراسية';
        END IF;
    END IF;

    -- 2. Room conflict → مقيد بالسنة الدراسية فقط (بدون term_name)
    IF EXISTS (
        SELECT 1
        FROM timetable_sessions
        WHERE room_id       = NEW.room_id
          AND academic_year = NEW.academic_year              -- السنة بس
          AND day_of_week   = NEW.day_of_week
          AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
    ) THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'تضارب: القاعة مشغولة في نفس الزمن واليوم في هذه السنة الدراسية';
    END IF;

    -- 3. Department + Level conflict → نتركه مقيد بالسنة والفصل (لأنه منطقي أكثر هنا)
    IF EXISTS (
        SELECT 1
        FROM timetable_sessions
        WHERE faculty_id    = NEW.faculty_id
          AND department_id = NEW.department_id
          AND level_name    = NEW.level_name
          AND academic_year = NEW.academic_year
          AND term_name     = NEW.term_name               -- نحتفظ بالفصل هنا
          AND day_of_week   = NEW.day_of_week
          AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
    ) THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'تضارب: نفس القسم والمستوى لديه محاضرة أخرى في نفس الزمن والفصل';
    END IF;

END
$$
DELIMITER ;
DELIMITER $$
CREATE TRIGGER `trg_timetable_no_conflicts_update` BEFORE UPDATE ON `timetable_sessions` FOR EACH ROW BEGIN
    -- 1. Instructor conflict 
    IF NEW.instructor_name IS NOT NULL THEN
        IF EXISTS (
            SELECT 1
            FROM timetable_sessions
            WHERE instructor_name = NEW.instructor_name
              AND academic_year   = NEW.academic_year
              AND day_of_week     = NEW.day_of_week
              AND id <> OLD.id
              AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
        ) THEN
            SIGNAL SQLSTATE '45000'
            SET MESSAGE_TEXT = 'تضارب: الأستاذ لديه محاضرة أخرى في نفس الزمن واليوم في هذه السنة بعد التعديل';
        END IF;
    END IF;

    -- 2. Room conflict 
    IF EXISTS (
        SELECT 1
        FROM timetable_sessions
        WHERE room_id       = NEW.room_id
          AND academic_year = NEW.academic_year
          AND day_of_week   = NEW.day_of_week
          AND id <> OLD.id
          AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
    ) THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'تضارب: القاعة مشغولة في نفس الزمن واليوم في هذه السنة بعد التعديل';
    END IF;

    -- 3. Department + Level conflict 
    IF EXISTS (
        SELECT 1
        FROM timetable_sessions
        WHERE faculty_id    = NEW.faculty_id
          AND department_id = NEW.department_id
          AND level_name    = NEW.level_name
          AND academic_year = NEW.academic_year
          AND term_name     = NEW.term_name
          AND day_of_week   = NEW.day_of_week
          AND id <> OLD.id
          AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
    ) THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'تضارب: نفس القسم والمستوى لديه محاضرة أخرى بعد التعديل';
    END IF;

END
$$
DELIMITER ;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(100) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `full_name` varchar(150) DEFAULT NULL,
  `email` varchar(150) DEFAULT NULL,
  `department` varchar(100) DEFAULT NULL,
  `role` varchar(50) DEFAULT 'user',
  `is_active` tinyint(1) DEFAULT 1,
  `allowed_pages` text DEFAULT NULL,
  `allowed_program_types` text DEFAULT NULL,
  `allowed_faculties` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `last_login` datetime DEFAULT NULL,
  `registration_tab_permissions` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password_hash`, `full_name`, `email`, `department`, `role`, `is_active`, `allowed_pages`, `allowed_program_types`, `allowed_faculties`, `created_at`, `updated_at`, `last_login`, `registration_tab_permissions`) VALUES
(9, 'kian', '$2b$10$i5t0EynzIA5dqbyDCabISe0qh4CNQi6yWQsxUzrItLwjFri/GQ/wq', NULL, NULL, NULL, 'admin', 1, '[]', '[]', '[]', '2026-03-04 08:25:53', '0000-00-00 00:00:00', NULL, '{}'),
(18, 'mohmmed', '$2b$10$MfHtzSGDW858s71GNGRhnOTW3nRxZhJjIKIr0wj58mo.Bd0e5nGCe', NULL, NULL, 'شؤون الطلاب', 'user', 1, '[\"القبول والتسجيل\"]', '[\"bachelor\",\"diploma\",\"postgraduate\"]', '[3]', '2026-04-05 10:13:13', '0000-00-00 00:00:00', NULL, '{\"single\":true,\"fees\":true,\"promotion\":true,\"failed-courses\":true}'),
(19, 'سهام محمد', '$2b$10$dvtk4OHpPOj7/lNqQHgx.u5bnVkNT4Y4BofG.9ruCVOkRv/22.FlS', NULL, NULL, NULL, 'user', 1, '[\"المكتبة\",\"الجداول الدراسية\",\"القبول والتسجيل\",\"الشهادات\",\"إعدادات النظام الأكاديمي\",\"إدخال الدرجات\",\"حساب النتائج\",\"قوائم الطلاب\",\"أعضاء هيئة التدريس\",\"السجل الأكاديمي\",\"التقارير\"]', '[\"bachelor\",\"diploma\",\"postgraduate\"]', '[3,6,7,5,2,4,1]', '2026-04-14 07:57:49', '0000-00-00 00:00:00', NULL, '{\"promotion\":true,\"single\":true,\"failed-courses\":true,\"fees\":true}'),
(20, 'بلقيس محمد', '$2b$10$lyiMZBBWsXBafi5lFWtjAeaziGEB0YOO402/q0JKO0lwjaH.sGdwO', NULL, NULL, 'الدراسات العليا والبحث العلمى', 'user', 1, '[\"المكتبة\",\"القبول والتسجيل\",\"إعدادات النظام الأكاديمي\",\"إدخال الدرجات\",\"قوائم الطلاب\",\"حساب النتائج\",\"أعضاء هيئة التدريس\",\"المستخدمين والصلاحيات\",\"التقارير\",\"السجل الأكاديمي\",\"الشهادات\",\"الجداول الدراسية\"]', '[\"postgraduate\"]', '[3,1,6,5,2,7,4,9]', '2026-04-23 12:29:08', '0000-00-00 00:00:00', NULL, '{\"promotion\":true,\"single\":true,\"fees\":true}');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `academic_periods`
--
ALTER TABLE `academic_periods`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_period` (`academic_year`,`level_name`,`term_name`,`program_type`,`postgraduate_program`),
  ADD KEY `idx_academic_periods_academic_year` (`academic_year`),
  ADD KEY `idx_academic_periods_level_name` (`level_name`),
  ADD KEY `idx_academic_periods_term_name` (`term_name`),
  ADD KEY `idx_academic_periods_program_type` (`program_type`),
  ADD KEY `idx_academic_periods_postgraduate_program` (`postgraduate_program`),
  ADD KEY `idx_academic_periods_program_type_postgraduate_program` (`program_type`,`postgraduate_program`),
  ADD KEY `idx_ap_year` (`academic_year`),
  ADD KEY `idx_ap_level` (`level_name`),
  ADD KEY `idx_ap_term` (`term_name`),
  ADD KEY `idx_ap_prog_type` (`program_type`),
  ADD KEY `idx_ap_pg_program` (`postgraduate_program`),
  ADD KEY `idx_ap_prog_pg` (`program_type`,`postgraduate_program`),
  ADD KEY `idx_ap_year_prog_pg` (`academic_year`,`program_type`,`postgraduate_program`),
  ADD KEY `idx_ap_year_level_prog` (`academic_year`,`level_name`,`program_type`),
  ADD KEY `idx_academic_periods_year_level_term` (`academic_year`,`level_name`,`term_name`);

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_books_faculty` (`faculty_id`);

--
-- Indexes for table `borrowed_books`
--
ALTER TABLE `borrowed_books`
  ADD PRIMARY KEY (`id`),
  ADD KEY `book_id` (`book_id`);

--
-- Indexes for table `courses`
--
ALTER TABLE `courses`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_courses_filter` (`faculty_id`,`department_id`,`academic_year`,`level_name`,`term_name`),
  ADD KEY `fk_courses_department` (`department_id`),
  ADD KEY `idx_courses_faculty_id` (`faculty_id`),
  ADD KEY `idx_courses_department_id` (`department_id`),
  ADD KEY `idx_courses_academic_year` (`academic_year`),
  ADD KEY `idx_courses_level_name` (`level_name`),
  ADD KEY `idx_courses_term_name` (`term_name`),
  ADD KEY `idx_courses_program_type` (`program_type`),
  ADD KEY `idx_courses_postgraduate_program` (`postgraduate_program`),
  ADD KEY `idx_courses_course_name` (`course_name`),
  ADD KEY `idx_crs_faculty` (`faculty_id`),
  ADD KEY `idx_crs_dept` (`department_id`),
  ADD KEY `idx_crs_year` (`academic_year`),
  ADD KEY `idx_crs_level` (`level_name`),
  ADD KEY `idx_crs_term` (`term_name`),
  ADD KEY `idx_crs_prog` (`program_type`),
  ADD KEY `idx_crs_pg` (`postgraduate_program`),
  ADD KEY `idx_crs_name` (`course_name`),
  ADD KEY `idx_crs_fac_dept` (`faculty_id`,`department_id`),
  ADD KEY `idx_crs_period` (`academic_year`,`level_name`,`term_name`),
  ADD KEY `idx_crs_prog_pg` (`program_type`,`postgraduate_program`),
  ADD KEY `idx_crs_yr_lvl_term` (`academic_year`,`level_name`,`term_name`),
  ADD KEY `idx_crs_fac_yr_lvl` (`faculty_id`,`academic_year`,`level_name`);

--
-- Indexes for table `course_grades`
--
ALTER TABLE `course_grades`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_student_course_attempt` (`student_id`,`course_id`,`attempt_number`),
  ADD KEY `fk_course_grades_student` (`student_id`),
  ADD KEY `fk_course_grades_course` (`course_id`),
  ADD KEY `idx_course_grades_student_id` (`student_id`),
  ADD KEY `idx_course_grades_course_id` (`course_id`),
  ADD KEY `idx_course_grades_attempt_number` (`attempt_number`),
  ADD KEY `idx_course_grades_student_id_course_id` (`student_id`,`course_id`),
  ADD KEY `idx_grd_std_course` (`student_id`,`course_id`),
  ADD KEY `idx_grd_attempt` (`attempt_number`),
  ADD KEY `idx_course_grades_student_course` (`student_id`,`course_id`),
  ADD KEY `idx_course_grades_course` (`course_id`);

--
-- Indexes for table `departments`
--
ALTER TABLE `departments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `faculty_id` (`faculty_id`),
  ADD KEY `idx_departments_faculty_id` (`faculty_id`),
  ADD KEY `idx_departments_department_name` (`department_name`);

--
-- Indexes for table `faculties`
--
ALTER TABLE `faculties`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_faculties_faculty_name` (`faculty_name`);

--
-- Indexes for table `fees`
--
ALTER TABLE `fees`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_student_period` (`student_id`,`academic_year`,`level_name`,`term_name`,`program_type`,`postgraduate_program`),
  ADD UNIQUE KEY `uq_default_period` (`department_id`,`academic_year`,`level_name`,`term_name`,`program_type`,`postgraduate_program`),
  ADD UNIQUE KEY `installment_1_id` (`installment_1_id`),
  ADD UNIQUE KEY `installment_2_id` (`installment_2_id`),
  ADD UNIQUE KEY `installment_3_id` (`installment_3_id`),
  ADD UNIQUE KEY `installment_4_id` (`installment_4_id`),
  ADD UNIQUE KEY `installment_5_id` (`installment_5_id`),
  ADD UNIQUE KEY `installment_6_id` (`installment_6_id`),
  ADD KEY `fk_fees_student` (`student_id`),
  ADD KEY `fk_fees_department` (`department_id`),
  ADD KEY `idx_fees_student_year_level` (`student_id`,`academic_year`,`level_name`),
  ADD KEY `idx_fees_year_level` (`academic_year`,`level_name`),
  ADD KEY `idx_fees_dept_year_level` (`department_id`,`academic_year`,`level_name`),
  ADD KEY `idx_fees_is_synced` (`is_synced`),
  ADD KEY `idx_fees_student_id` (`student_id`);

--
-- Indexes for table `grading_rules`
--
ALTER TABLE `grading_rules`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_grading_rules_faculty` (`faculty_id`),
  ADD KEY `idx_grading_rules_faculty_id` (`faculty_id`),
  ADD KEY `idx_grading_rules_rule_type` (`rule_type`),
  ADD KEY `idx_grading_rules_faculty_id_rule_type` (`faculty_id`,`rule_type`),
  ADD KEY `idx_grd_fac_type` (`faculty_id`,`rule_type`);

--
-- Indexes for table `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `transaction_id` (`transaction_id`),
  ADD KEY `idx_university_year` (`university_id`,`academic_year`),
  ADD KEY `idx_installment` (`university_id`,`academic_year`),
  ADD KEY `idx_status` (`status`),
  ADD KEY `idx_received` (`received_at`);

--
-- Indexes for table `rooms`
--
ALTER TABLE `rooms`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_room_name` (`room_name`),
  ADD KEY `room_name` (`room_name`);

--
-- Indexes for table `staff_members`
--
ALTER TABLE `staff_members`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_staff_code` (`staff_code`),
  ADD UNIQUE KEY `uq_staff_email` (`email`),
  ADD KEY `idx_staff_faculty` (`faculty_id`),
  ADD KEY `idx_staff_department` (`department_id`);

--
-- Indexes for table `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_students_full_name` (`full_name`),
  ADD UNIQUE KEY `idx_students_university_id_unique` (`university_id_for_unique`),
  ADD KEY `fk_students_department` (`department_id`),
  ADD KEY `idx_students_university_id` (`university_id`),
  ADD KEY `idx_std_univ_name` (`university_id`,`full_name`),
  ADD KEY `idx_std_dept_name` (`department_id`,`full_name`),
  ADD KEY `idx_std_univ_dept` (`university_id`,`department_id`),
  ADD KEY `idx_students_dept_status` (`department_id`,`academic_status`),
  ADD KEY `idx_student_id` (`id`);

--
-- Indexes for table `student_registrations`
--
ALTER TABLE `student_registrations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_reg_student` (`student_id`),
  ADD KEY `idx_student_registrations_student_id` (`student_id`),
  ADD KEY `idx_student_registrations_academic_year` (`academic_year`),
  ADD KEY `idx_student_registrations_level_name` (`level_name`),
  ADD KEY `idx_student_registrations_term_name` (`term_name`),
  ADD KEY `idx_student_registrations_program_type` (`program_type`),
  ADD KEY `idx_student_registrations_postgraduate_program` (`postgraduate_program`(191)),
  ADD KEY `idx_student_registrations_registration_status` (`registration_status`),
  ADD KEY `idx_reg_student` (`student_id`),
  ADD KEY `idx_reg_year` (`academic_year`),
  ADD KEY `idx_reg_level` (`level_name`),
  ADD KEY `idx_reg_term` (`term_name`),
  ADD KEY `idx_reg_prog` (`program_type`),
  ADD KEY `idx_reg_pg` (`postgraduate_program`(191)),
  ADD KEY `idx_reg_status` (`registration_status`),
  ADD KEY `idx_reg_std_period` (`student_id`,`academic_year`,`level_name`,`term_name`),
  ADD KEY `idx_reg_prog_pg` (`program_type`,`postgraduate_program`(191)),
  ADD KEY `idx_reg_year_prog` (`academic_year`,`program_type`,`postgraduate_program`(191)),
  ADD KEY `idx_reg_status_year` (`registration_status`,`academic_year`),
  ADD KEY `idx_reg_std_yr_lvl` (`student_id`,`academic_year`,`level_name`),
  ADD KEY `idx_reg_student_period` (`student_id`,`academic_year`,`level_name`,`term_name`),
  ADD KEY `idx_registrations_student_year_level_term` (`student_id`,`academic_year`,`level_name`,`term_name`);

--
-- Indexes for table `term_results`
--
ALTER TABLE `term_results`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_term_result` (`student_id`,`faculty_id`,`department_id`,`academic_year`,`level_name`,`term_name`,`program_type`,`postgraduate_program`,`program_mode`),
  ADD KEY `idx_term_results_student` (`student_id`),
  ADD KEY `idx_res_std_period` (`student_id`,`academic_year`,`level_name`,`term_name`);

--
-- Indexes for table `timetable_sessions`
--
ALTER TABLE `timetable_sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_room_day_time` (`room_id`,`day_of_week`,`start_time`,`end_time`),
  ADD KEY `idx_instructor_day_time` (`instructor_staff_id`,`day_of_week`,`start_time`,`end_time`),
  ADD KEY `idx_scope` (`academic_year`,`term_name`,`program_type`,`postgraduate_program`),
  ADD KEY `idx_ts_room_time` (`academic_year`,`term_name`,`program_type`,`postgraduate_program`,`day_of_week`,`room_id`,`start_time`,`end_time`),
  ADD KEY `idx_ts_instructor_time` (`academic_year`,`term_name`,`program_type`,`postgraduate_program`,`day_of_week`,`instructor_staff_id`,`start_time`,`end_time`),
  ADD KEY `idx_ts_dept_time` (`faculty_id`,`department_id`,`academic_year`,`level_name`,`term_name`,`program_type`,`postgraduate_program`,`day_of_week`,`start_time`,`end_time`),
  ADD KEY `idx_instructor_time` (`instructor_staff_id`,`academic_year`,`term_name`,`program_type`,`day_of_week`,`start_time`,`end_time`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD KEY `idx_users_username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `academic_periods`
--
ALTER TABLE `academic_periods`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=437;

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `borrowed_books`
--
ALTER TABLE `borrowed_books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `courses`
--
ALTER TABLE `courses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=72;

--
-- AUTO_INCREMENT for table `course_grades`
--
ALTER TABLE `course_grades`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=247;

--
-- AUTO_INCREMENT for table `departments`
--
ALTER TABLE `departments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `faculties`
--
ALTER TABLE `faculties`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `fees`
--
ALTER TABLE `fees`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=85;

--
-- AUTO_INCREMENT for table `grading_rules`
--
ALTER TABLE `grading_rules`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=322;

--
-- AUTO_INCREMENT for table `payments`
--
ALTER TABLE `payments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `rooms`
--
ALTER TABLE `rooms`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `staff_members`
--
ALTER TABLE `staff_members`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `students`
--
ALTER TABLE `students`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=140;

--
-- AUTO_INCREMENT for table `student_registrations`
--
ALTER TABLE `student_registrations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=336;

--
-- AUTO_INCREMENT for table `term_results`
--
ALTER TABLE `term_results`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;

--
-- AUTO_INCREMENT for table `timetable_sessions`
--
ALTER TABLE `timetable_sessions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `books`
--
ALTER TABLE `books`
  ADD CONSTRAINT `fk_books_faculty` FOREIGN KEY (`faculty_id`) REFERENCES `faculties` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `borrowed_books`
--
ALTER TABLE `borrowed_books`
  ADD CONSTRAINT `borrowed_books_ibfk_1` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`);

--
-- Constraints for table `courses`
--
ALTER TABLE `courses`
  ADD CONSTRAINT `fk_courses_department` FOREIGN KEY (`department_id`) REFERENCES `departments` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_courses_faculty` FOREIGN KEY (`faculty_id`) REFERENCES `faculties` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `course_grades`
--
ALTER TABLE `course_grades`
  ADD CONSTRAINT `fk_course_grades_course` FOREIGN KEY (`course_id`) REFERENCES `courses` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_course_grades_student` FOREIGN KEY (`student_id`) REFERENCES `students` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `departments`
--
ALTER TABLE `departments`
  ADD CONSTRAINT `departments_ibfk_1` FOREIGN KEY (`faculty_id`) REFERENCES `faculties` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `fees`
--
ALTER TABLE `fees`
  ADD CONSTRAINT `fk_fees_department` FOREIGN KEY (`department_id`) REFERENCES `departments` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `fk_fees_student` FOREIGN KEY (`student_id`) REFERENCES `students` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `students`
--
ALTER TABLE `students`
  ADD CONSTRAINT `fk_students_department` FOREIGN KEY (`department_id`) REFERENCES `departments` (`id`);

--
-- Constraints for table `student_registrations`
--
ALTER TABLE `student_registrations`
  ADD CONSTRAINT `fk_reg_student` FOREIGN KEY (`student_id`) REFERENCES `students` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
