-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 20, 2026 at 10:29 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `university_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `academic_periods`
--

CREATE TABLE `academic_periods` (
  `id` int(11) NOT NULL,
  `academic_year` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `level_name` varchar(60) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `term_name` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `program_type` enum('diploma','bachelor','postgraduate') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'bachelor',
  `postgraduate_program` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `academic_periods`
--

INSERT INTO `academic_periods` (`id`, `academic_year`, `level_name`, `term_name`, `program_type`, `postgraduate_program`, `created_at`) VALUES
(1, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:20:32'),
(2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2025-12-28 11:20:32'),
(3, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:20:32'),
(4, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-28 11:20:32'),
(5, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:33:52'),
(6, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:34:03'),
(7, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:34:19'),
(8, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:38:37'),
(9, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:38:51'),
(10, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 11:46:27'),
(11, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-28 13:19:52'),
(12, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 13:42:54'),
(13, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-28 14:13:18'),
(14, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-28 14:13:32'),
(15, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 07:27:07'),
(16, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-29 08:08:32'),
(17, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-29 09:50:09'),
(18, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 09:59:03'),
(19, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2025-12-29 11:15:11'),
(20, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 11:26:52'),
(21, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 13:36:00'),
(22, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 13:51:06'),
(23, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-29 14:08:06'),
(24, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-30 14:21:32'),
(25, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2025-12-31 11:29:58'),
(26, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-31 11:30:09'),
(27, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-31 11:31:24'),
(28, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2025-12-31 11:31:35'),
(29, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'postgraduate', 'ماجستير البرمجيات المدمجة', '2025-12-31 13:50:33'),
(30, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-01-13 06:43:01'),
(31, '2025/2026', 'المستوى الأول', 'الفصل الأول', '', NULL, '2026-01-14 06:12:55'),
(32, '2025/2026', 'المستوى الأول', 'الفصل الأول', '', NULL, '2026-01-14 06:13:04'),
(33, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'postgraduate', 'ماجستير الحوسبة السحابية', '2026-01-14 08:08:08'),
(35, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'postgraduate', 'ماجستير الحوسبة السحابية', '2026-01-14 08:09:21'),
(36, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:16:34'),
(37, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:21:05'),
(38, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:28:55'),
(39, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:43:37'),
(40, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:49:04'),
(41, '2025/2026', 'المستوي الثاني', 'الفصل الثاني', '', NULL, '2026-01-22 08:49:44'),
(42, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:55:33'),
(43, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:56:25'),
(44, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 08:59:52'),
(45, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 09:01:41'),
(46, '2025/2026', 'المستوى الثاني', 'الفصل الأول', '', NULL, '2026-01-22 09:02:07'),
(47, '2025/2026', 'المستوى الأول', 'الفصل الأول', '', NULL, '2026-01-22 09:02:18'),
(48, '2025/2026', 'المستوى الأول', 'الفصل الأول', '', NULL, '2026-01-22 09:02:22'),
(49, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-02 08:44:01'),
(50, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-02 08:45:29'),
(51, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-02 08:49:18'),
(52, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-02 12:24:51'),
(53, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-02 12:25:28'),
(54, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 13:07:37'),
(55, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 14:02:12'),
(56, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:02:19'),
(57, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:09:37'),
(58, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:12:50'),
(59, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:15:42'),
(60, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 14:16:17'),
(61, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:16:39'),
(62, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:19:10'),
(63, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 14:20:35'),
(64, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:20:47'),
(65, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-03 14:25:08'),
(66, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 14:25:33'),
(67, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-03 14:26:05'),
(68, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-04 11:29:31'),
(69, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-05 08:02:11'),
(70, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-05 11:46:50'),
(71, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-05 11:47:21'),
(72, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-05 12:23:35'),
(73, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-05 12:32:20'),
(74, '2025/2026', 'المستوى الخامس', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 11:10:34'),
(75, '2025/2026', 'المستوى الخامس', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 11:10:34'),
(76, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:18:18'),
(77, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:18:18'),
(78, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:18:44'),
(79, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:18:44'),
(80, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:19:18'),
(81, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:19:18'),
(82, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:19:49'),
(83, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:19:49'),
(84, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:20:15'),
(85, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-07 15:20:15'),
(86, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-07 15:22:18'),
(87, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-07 15:23:11'),
(88, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 07:03:40'),
(89, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 11:07:51'),
(90, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 11:07:51'),
(91, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 11:07:51'),
(92, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 11:07:51'),
(93, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:07:51'),
(94, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 11:07:51'),
(95, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(96, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(97, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(98, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(99, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(100, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(101, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(102, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(103, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(104, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(105, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(106, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(107, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(108, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(109, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(110, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(111, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(112, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(113, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(114, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(115, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(116, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(117, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(118, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(119, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(120, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(121, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(122, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(123, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(124, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(125, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(126, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(127, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(128, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(129, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(130, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(131, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(132, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 11:58:40'),
(133, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-02-08 12:01:02'),
(134, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:51:12'),
(136, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(137, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(138, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(139, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(140, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(141, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(142, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(143, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(144, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(145, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(146, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(147, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(148, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(149, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(150, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(151, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(152, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(153, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(154, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(155, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(156, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(157, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(158, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(159, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(160, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(161, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(162, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(163, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(164, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(165, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(166, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(167, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(168, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(169, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(170, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(171, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(172, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(173, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-02-08 12:58:48'),
(174, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-09 07:25:50'),
(175, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-09 07:28:28'),
(176, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-09 07:30:06'),
(177, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-09 07:30:08'),
(178, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-09 12:58:58'),
(179, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-11 06:43:34'),
(180, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-11 06:43:34'),
(181, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:12:01'),
(182, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:12:01'),
(183, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:14:35'),
(184, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:17:57'),
(185, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:21:47'),
(186, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-02-14 12:21:47'),
(187, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-01 11:32:40'),
(188, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-01 11:33:25'),
(189, '2026/2027', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-01 11:33:55'),
(190, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-01 11:35:12'),
(191, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-01 11:35:12'),
(192, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-02 14:05:57'),
(193, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-02 14:06:34'),
(194, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-02 14:12:09'),
(195, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-02 14:13:37'),
(196, '2025/2026', 'المستوى الخامس', 'الفصل الأول', 'bachelor', NULL, '2026-03-03 11:57:16'),
(197, '2025/2026', 'المستوى الخامس', 'الفصل الأول', 'bachelor', NULL, '2026-03-03 12:01:36'),
(198, '2025/2026', 'المستوى الخامس', 'الفصل الثاني', 'bachelor', NULL, '2026-03-03 12:01:49'),
(199, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-04 07:39:32'),
(200, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 08:44:24'),
(201, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 08:44:27'),
(202, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 08:49:26'),
(203, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 08:49:26'),
(204, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 09:02:22'),
(205, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 09:05:02'),
(206, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 09:05:02'),
(207, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 09:08:55'),
(208, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 09:08:57'),
(209, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-04 09:11:57'),
(210, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-04 09:11:57'),
(211, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-04 09:11:57'),
(212, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-04 09:11:57'),
(213, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 11:46:09'),
(214, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 11:46:11'),
(215, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 12:44:08'),
(216, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 12:48:21'),
(217, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 12:53:00'),
(218, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 12:56:28'),
(219, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 13:06:22'),
(220, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 13:10:31'),
(221, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 13:14:35'),
(222, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-04 13:14:43'),
(223, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:30:24'),
(224, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:30:27'),
(225, '2025/2026', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:30:55'),
(226, '2025/2026', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:31:46'),
(227, '2025/2026', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:32:43'),
(228, '2025/2026', 'المستوى الرابع', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:33:30'),
(229, '2025/2026', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:34:05'),
(230, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:34:39'),
(232, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:35:45'),
(233, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:37:42'),
(234, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:38:37'),
(235, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:39:15'),
(236, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:40:02'),
(237, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:40:53'),
(238, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:41:45'),
(240, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:44:25'),
(241, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:45:40'),
(242, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:47:09'),
(243, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:48:00'),
(244, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:48:44'),
(245, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:49:11'),
(246, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:53:00'),
(247, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:53:00'),
(248, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:53:00'),
(249, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:53:00'),
(250, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:54:48'),
(251, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:54:48'),
(252, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:54:48'),
(253, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-03-09 11:54:48'),
(254, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:15'),
(255, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:30'),
(256, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:30'),
(257, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:30'),
(258, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:30'),
(259, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:57:53'),
(260, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:59:29'),
(261, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-03-09 11:59:33'),
(262, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-12 10:11:48'),
(263, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-12 10:12:48'),
(264, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-12 10:12:48'),
(265, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-12 13:34:49'),
(266, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'diploma', NULL, '2026-03-12 13:36:26'),
(267, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'diploma', NULL, '2026-03-12 13:36:27'),
(268, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-15 14:32:16'),
(269, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-15 14:32:16'),
(270, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-15 14:58:43'),
(271, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-15 14:59:52'),
(272, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-15 14:59:53'),
(273, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-30 07:54:39'),
(274, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-30 07:56:16'),
(275, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-30 07:56:17'),
(276, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-31 08:06:56'),
(277, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-03-31 08:07:03'),
(278, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 07:19:45'),
(279, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 07:19:45'),
(280, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 07:46:53'),
(281, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 07:47:52'),
(282, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 07:47:52'),
(283, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 08:10:12'),
(284, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-01 08:10:12'),
(285, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-04 13:16:44'),
(286, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-04 13:16:44'),
(289, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-05 12:01:57'),
(290, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-05 12:01:57'),
(291, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 08:35:53'),
(292, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 08:35:55'),
(293, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 08:53:44'),
(294, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 08:54:53'),
(295, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 08:54:53'),
(296, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-06 10:22:25'),
(297, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-06 13:09:37'),
(298, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-06 13:10:20'),
(302, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-07 07:37:47'),
(303, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-07 07:38:24'),
(304, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-07 07:51:54'),
(305, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-07 13:13:18'),
(306, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-08 11:26:05'),
(307, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-08 11:26:05'),
(308, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-09 07:59:03'),
(309, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-09 07:59:03'),
(310, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-14 13:00:38'),
(311, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-14 13:00:38'),
(312, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-14 13:26:54'),
(313, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-15 07:32:18'),
(314, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-15 07:32:18'),
(315, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-15 08:08:46'),
(316, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-15 08:08:46'),
(317, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 08:54:38'),
(318, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 08:55:37'),
(319, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 08:55:37'),
(320, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 09:24:23'),
(321, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 09:24:25'),
(322, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 09:47:54'),
(323, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 09:47:54'),
(324, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:05:08'),
(325, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:05:08'),
(326, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:11:58'),
(327, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:11:58'),
(333, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'postgraduate', 'ماجستير ادارة الاعمال', '2026-04-18 10:38:48'),
(334, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:40:16'),
(335, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 10:40:16'),
(336, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 11:33:44'),
(337, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 11:33:45'),
(339, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 12:54:22'),
(340, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 12:54:22'),
(341, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 15:25:01'),
(342, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 15:25:02'),
(343, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 15:27:42'),
(344, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-18 15:27:42'),
(345, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-19 08:38:52'),
(346, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-19 08:40:30'),
(347, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-19 08:40:31'),
(348, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-19 08:59:31'),
(349, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-19 09:00:59'),
(350, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-19 09:01:00'),
(351, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'bachelor', NULL, '2026-04-20 10:07:39'),
(352, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', NULL, '2026-04-20 10:09:50'),
(353, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-20 11:55:57'),
(361, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 08:40:48'),
(362, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 08:42:16'),
(363, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 08:42:18'),
(366, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 11:44:36'),
(367, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 11:45:55'),
(368, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-21 11:45:55'),
(369, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 09:45:35'),
(370, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 09:46:40'),
(371, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 09:46:50'),
(372, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 13:25:13'),
(373, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 13:25:13'),
(374, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 13:27:20'),
(375, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-22 13:27:20'),
(376, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 09:57:55'),
(377, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 10:11:37'),
(378, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 10:11:38'),
(381, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-23 11:36:32'),
(382, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-23 11:36:32'),
(386, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 11:43:16'),
(387, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 11:43:31'),
(388, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-23 11:43:56'),
(389, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-25 13:15:36'),
(395, '2025/2026', 'الدفعة الأولى', 'الفصل الثاني', 'postgraduate', 'ماجستير ادارة الاعمال', '2026-04-26 14:48:45'),
(399, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-27 14:03:55'),
(400, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 11:13:55'),
(401, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:21:48'),
(402, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:33:41'),
(403, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:33:44'),
(404, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:33:44'),
(405, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:38:48'),
(406, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-28 12:56:02'),
(407, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 12:56:58'),
(408, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-04-28 13:03:24'),
(409, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 13:03:47'),
(410, '2025/2026', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 13:04:34'),
(411, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-04-28 13:05:33'),
(412, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:00:47'),
(413, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:00:47'),
(414, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:01:36'),
(415, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:39:08'),
(416, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:40:22'),
(417, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:41:46'),
(418, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 08:43:00'),
(419, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:20:09'),
(420, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:21:08'),
(421, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:26:25'),
(422, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:27:04'),
(423, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:32:16'),
(424, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:34:10'),
(425, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:39:51'),
(426, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:43:18'),
(427, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:45:00'),
(428, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:45:13'),
(429, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:45:17'),
(430, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:45:36'),
(432, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:45:55'),
(433, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:49:29'),
(434, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:49:59'),
(435, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 09:51:22'),
(436, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-04-30 10:10:59'),
(437, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-04 08:13:17'),
(438, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-05 07:29:01'),
(439, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-05 07:29:17'),
(440, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-07 07:23:46'),
(441, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-07 07:23:47'),
(442, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-07 08:14:20'),
(443, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-07 08:14:56'),
(444, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-07 08:15:53'),
(445, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-07 08:17:00'),
(446, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-07 11:46:21'),
(447, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-07 11:46:39'),
(448, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-07 13:46:08'),
(449, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-07 13:57:21'),
(450, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-07 13:59:32'),
(451, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-07 14:01:03'),
(452, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-07 14:02:44'),
(453, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-07 14:08:56'),
(454, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-11 10:40:35'),
(455, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-11 10:41:30'),
(456, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-11 10:43:28'),
(457, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-11 10:43:35'),
(458, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-11 10:44:45'),
(459, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-11 10:44:52'),
(460, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-12 09:24:27'),
(461, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-12 09:28:14'),
(462, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-12 09:28:14'),
(463, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-12 09:29:00'),
(464, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-12 09:29:00'),
(465, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-12 09:29:56'),
(466, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-12 09:29:56'),
(467, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 10:22:39'),
(468, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 10:22:49'),
(469, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 11:12:22'),
(470, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:22:22'),
(471, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:22:22'),
(472, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:22:22'),
(473, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:22:22'),
(474, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:22:22'),
(475, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:25:06'),
(476, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:25:06'),
(477, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:25:06'),
(478, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:25:06'),
(479, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:25:06'),
(480, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:25:06'),
(481, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:25:06'),
(482, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:25:06'),
(483, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:25:06'),
(484, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:25:06'),
(485, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:50'),
(486, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:50'),
(487, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:50'),
(488, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:50'),
(489, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:50'),
(490, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:50'),
(491, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:50'),
(492, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:50'),
(493, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:50'),
(494, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:50'),
(495, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:51'),
(496, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:51'),
(497, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:51'),
(498, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:51'),
(499, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:51'),
(500, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:51'),
(501, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:51'),
(502, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:51'),
(503, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:51'),
(504, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 12:35:51'),
(505, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:12:19'),
(506, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:12:19'),
(507, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:12:19'),
(508, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:12:19'),
(509, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:16:19'),
(510, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:16:19'),
(511, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:16:19'),
(512, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:16:19'),
(513, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:16:19'),
(514, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:16:19'),
(515, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:16:19'),
(516, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:16:19'),
(517, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:16:19'),
(518, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:16:19'),
(519, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:22:21'),
(520, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:22:21'),
(521, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:22:21'),
(522, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:22:21'),
(523, '2026/2027', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-12 14:22:21'),
(524, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 07:48:47'),
(525, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 07:49:02'),
(526, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 08:59:28'),
(527, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 08:59:28'),
(528, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 09:02:17'),
(529, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 09:02:29'),
(530, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 09:03:45'),
(531, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 09:03:45'),
(532, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 09:13:12'),
(533, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 09:13:12'),
(534, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 09:14:27'),
(535, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 09:14:27'),
(536, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 10:00:41'),
(537, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 10:06:37'),
(538, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 10:10:44'),
(539, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 10:20:01'),
(540, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 12:20:39'),
(541, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 12:22:31'),
(542, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 12:22:31'),
(543, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 12:22:31'),
(544, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 12:22:31'),
(545, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 13:52:56'),
(546, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 14:15:15'),
(547, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 14:15:28'),
(548, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 14:32:00'),
(549, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'bachelor', NULL, '2026-05-13 14:32:10'),
(550, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', NULL, '2026-05-13 14:33:14'),
(551, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:14:27'),
(552, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', NULL, '2026-05-14 07:14:35'),
(553, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:18:59'),
(554, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-05-14 07:20:07'),
(555, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:21:33'),
(556, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-05-14 07:33:59'),
(557, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:34:08'),
(558, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-14 07:39:31'),
(559, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:39:42'),
(560, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:39:44'),
(561, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:40:36'),
(562, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:41:54'),
(563, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', NULL, '2026-05-14 07:51:37'),
(564, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:51:46'),
(565, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:52:37'),
(566, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:53:16'),
(567, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:53:35'),
(568, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'bachelor', NULL, '2026-05-14 07:54:05'),
(569, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 07:56:40'),
(570, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-14 08:02:09'),
(574, '2025/2026', 'الدفعة الأولى', 'الفصل الثالث', 'postgraduate', 'ماجستير ادارة الاعمال', '2026-05-17 09:21:42'),
(578, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'diploma', NULL, '2026-05-18 07:50:48'),
(579, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-18 07:51:51'),
(580, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-18 07:51:51'),
(581, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'diploma', NULL, '2026-05-18 07:54:16'),
(582, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'diploma', NULL, '2026-05-18 07:54:16'),
(583, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'diploma', NULL, '2026-05-18 08:00:30'),
(584, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'diploma', NULL, '2026-05-18 08:00:47'),
(585, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'diploma', NULL, '2026-05-18 08:00:47'),
(586, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-18 08:06:04'),
(587, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, '2026-05-18 08:06:04'),
(588, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-18 08:21:07');
INSERT INTO `academic_periods` (`id`, `academic_year`, `level_name`, `term_name`, `program_type`, `postgraduate_program`, `created_at`) VALUES
(589, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-18 09:48:56'),
(590, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-05-18 09:50:01'),
(591, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', NULL, '2026-05-18 09:50:24'),
(592, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', NULL, '2026-05-18 09:50:48'),
(593, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', NULL, '2026-05-18 09:51:24'),
(594, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', NULL, '2026-05-18 09:51:55');

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` int(11) NOT NULL,
  `title` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `description` text CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `author` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `faculty` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `pdf_url` varchar(500) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `is_pdf` tinyint(1) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `is_borrowed` tinyint(1) DEFAULT 0,
  `borrower_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `borrower_id` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `borrowed_at` datetime DEFAULT NULL,
  `returned_at` datetime DEFAULT NULL,
  `copies` int(11) DEFAULT 1,
  `added_by` varchar(100) DEFAULT NULL,
  `updated_by` varchar(100) DEFAULT NULL,
  `location` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `faculty_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `title`, `description`, `author`, `faculty`, `pdf_url`, `is_pdf`, `created_at`, `is_borrowed`, `borrower_name`, `borrower_id`, `borrowed_at`, `returned_at`, `copies`, `added_by`, `updated_by`, `location`, `faculty_id`) VALUES
(1, 'أساليب البحث العلمي في العلوم الإجتماعية والإنسانية', '002', 'غرايبة، فوزي', NULL, '', 0, '2026-05-13 08:38:19', 0, NULL, NULL, NULL, NULL, 3, NULL, NULL, 'الرف الاول القسم ج', 3),
(2, 'البحث العلمي : الدليل التطبيقي للباحثين 	', '003', 'الصيرفي، محمد عبد الفتاح', NULL, '', 0, '2026-05-13 08:39:14', 0, NULL, NULL, NULL, NULL, 4, NULL, NULL, 'الرف الثاني القسم ب', 1),
(3, 'منهجية البحث العلمي : القواعد والمراحل والتطبيقات', '004', 'محمد, عبيدات', NULL, '', 0, '2026-05-13 08:40:01', 0, NULL, NULL, NULL, NULL, 3, NULL, NULL, 'الرف الاول القسم د', 2),
(4, 'التفكير العلمي والمنهجية 	', '', 'حاسم ملحم', NULL, 'http://localhost:5000/uploads/1778661862881-ÙØ§Ø¦ÙØ©_Ø·ÙØ§Ø¨_2025-2026_Ø§ÙÙØµÙ_Ø§ÙØ£ÙÙ-17.pdf', 1, '2026-05-13 08:43:32', 0, NULL, NULL, NULL, NULL, 1, NULL, NULL, '', 7);

-- --------------------------------------------------------

--
-- Table structure for table `borrowed_books`
--

CREATE TABLE `borrowed_books` (
  `id` int(11) NOT NULL,
  `book_id` int(11) NOT NULL,
  `student_id` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `student_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `faculty` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `borrowed_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `returned_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `borrowed_books`
--

INSERT INTO `borrowed_books` (`id`, `book_id`, `student_id`, `student_name`, `faculty`, `borrowed_at`, `returned_at`) VALUES
(1, 3, '240003/24', 'مهاب خالد احمد ابراهيم', 'كلية العلوم الأدارية', '2026-05-18 13:48:48', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `courses`
--

CREATE TABLE `courses` (
  `id` int(11) NOT NULL,
  `faculty_id` int(11) NOT NULL,
  `department_id` int(11) NOT NULL,
  `academic_year` varchar(20) NOT NULL,
  `level_name` varchar(50) NOT NULL,
  `term_name` varchar(50) NOT NULL,
  `course_name` varchar(255) NOT NULL,
  `course_name_en` varchar(255) DEFAULT NULL,
  `instructor` varchar(255) DEFAULT NULL,
  `credit_hours` decimal(5,2) DEFAULT NULL,
  `total_mark` int(11) NOT NULL DEFAULT 100,
  `coursework_max` int(11) NOT NULL DEFAULT 40,
  `final_exam_max` int(11) NOT NULL DEFAULT 60,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `program_type` varchar(20) NOT NULL DEFAULT 'bachelor',
  `postgraduate_program` varchar(255) DEFAULT NULL,
  `created_by` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `courses`
--

INSERT INTO `courses` (`id`, `faculty_id`, `department_id`, `academic_year`, `level_name`, `term_name`, `course_name`, `course_name_en`, `instructor`, `credit_hours`, `total_mark`, `coursework_max`, `final_exam_max`, `created_at`, `updated_at`, `program_type`, `postgraduate_program`, `created_by`) VALUES
(1, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'اساسيات البرمجة', 'Programming Fundamentals', 'د. علي الطيب', 3.00, 100, 40, 60, '2026-05-13 10:02:44', '2026-05-13 10:02:44', 'bachelor', NULL, 'kian'),
(2, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'جبر خطي', 'Linear Algebra', 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-05-13 10:07:13', '2026-05-13 10:07:13', 'bachelor', NULL, 'kian'),
(3, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'ثقافة اسلامية', 'Islamic Culture', 'د. محمد عادل', 2.00, 100, 40, 60, '2026-05-13 10:07:51', '2026-05-13 10:07:51', 'bachelor', NULL, 'kian'),
(4, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'اساسيات قواعد البيانات', 'Database Fundamentals', 'د. علي الطيب', 3.00, 100, 40, 60, '2026-05-13 10:08:48', '2026-05-13 10:08:48', 'bachelor', NULL, 'kian'),
(5, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'اساسيات البرمجة 2', 'Programming Fundamentals2', 'د. علي الطيب', 3.00, 100, 40, 60, '2026-05-13 10:11:18', '2026-05-18 09:50:55', 'bachelor', NULL, 'kian'),
(6, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'اساسيات قواعد البيانات 2', 'Database Fundamentals 2', 'د. محمد عادل', 3.00, 100, 40, 60, '2026-05-13 10:11:44', '2026-05-18 09:51:04', 'bachelor', NULL, 'kian'),
(7, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'إحصاء', 'Statistics', 'د. سارة نبيل', 2.00, 100, 40, 60, '2026-05-13 10:14:01', '2026-05-13 10:14:01', 'bachelor', NULL, 'kian'),
(8, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'نظم التشغيل', 'Operating Systems', 'د. محمد عادل', 3.00, 100, 40, 60, '2026-05-13 10:14:47', '2026-05-13 10:14:47', 'bachelor', NULL, 'kian'),
(9, 1, 2, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'فيزياء', 'physics', 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-05-14 07:16:15', '2026-05-14 07:16:15', 'bachelor', NULL, 'kian'),
(10, 1, 2, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'الانظمة الحرجة', 'Critical systems', 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-05-14 07:17:55', '2026-05-14 07:17:55', 'bachelor', NULL, 'kian'),
(11, 1, 2, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'ذكاء اصطناعي', 'Artificial intelligence', 'د. محمد عادل', 3.00, 100, 30, 70, '2026-05-14 07:18:45', '2026-05-14 07:18:45', 'bachelor', NULL, 'kian'),
(12, 1, 2, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'الانظمة الحرجة 2', 'Critical systems 2', 'د. علي الطيب', 3.00, 100, 40, 60, '2026-05-14 07:19:14', '2026-05-18 09:50:29', 'bachelor', NULL, 'kian'),
(13, 1, 2, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'الشبكة العصبية', 'Neural network', 'د. محمد عادل', 3.00, 100, 40, 60, '2026-05-14 07:19:51', '2026-05-14 07:19:51', 'bachelor', NULL, 'kian'),
(14, 1, 2, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'تدريب عملي', 'Practical training', 'د. محمد عادل', 3.00, 100, 40, 60, '2026-05-14 07:20:29', '2026-05-14 07:20:29', 'bachelor', NULL, 'kian'),
(15, 1, 2, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'تحليل الانظمة', 'Systems analysis', 'د. علي الطيب', 2.00, 100, 40, 60, '2026-05-14 07:21:01', '2026-05-14 07:21:01', 'bachelor', NULL, 'kian'),
(16, 1, 2, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'تدريب عملي 2', 'Practical training 2', 'د. علي الطيب', 3.00, 100, 40, 60, '2026-05-14 07:21:46', '2026-05-18 09:51:40', 'bachelor', NULL, 'kian'),
(17, 1, 2, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'تحليل الانظمة 2', 'Systems analysis 2', 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-05-14 07:21:55', '2026-05-18 09:51:33', 'bachelor', NULL, 'kian'),
(18, 1, 2, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'اختبار الانظمة', 'Systems testing', 'د. محمد عادل', 3.00, 100, 40, 60, '2026-05-14 07:27:05', '2026-05-14 07:53:44', 'bachelor', NULL, 'kian'),
(19, 1, 2, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'طرق البحث', 'Research Methodology', 'د. سارة نبيل', 3.00, 100, 40, 60, '2026-05-14 07:55:12', '2026-05-14 07:55:12', 'bachelor', NULL, 'kian'),
(20, 1, 2, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'تطوير الويب والموبايل', 'Web and mobile development', 'د. علي الطيب', 3.00, 100, 40, 60, '2026-05-14 07:56:36', '2026-05-14 07:56:36', 'bachelor', NULL, 'kian'),
(21, 1, 2, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'طرق البحث 2', 'Research Methodology 2', 'د. علي الطيب', 3.00, 100, 40, 60, '2026-05-14 07:56:54', '2026-05-18 09:52:12', 'bachelor', NULL, 'kian'),
(22, 1, 2, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'تطوير الويب والموبايل 2', 'Web and mobile development 2', 'د. محمد عادل', 3.00, 100, 40, 60, '2026-05-14 07:57:14', '2026-05-18 09:52:04', 'bachelor', NULL, 'kian'),
(23, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'ادراه وتحليل المشاريع الصغيرة', 'Small Project Analysis Management', 'أ. ريم عمر', 3.00, 100, 40, 60, '2026-05-17 09:45:59', '2026-05-17 09:45:59', 'postgraduate', 'ماجستير ادارة الاعمال', 'kian'),
(24, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'تهيئة بيئة العمل', 'Setting Up the Work Environment', 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-05-17 09:46:42', '2026-05-17 09:46:42', 'postgraduate', 'ماجستير ادارة الاعمال', 'kian'),
(25, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'ادارة الجداول', 'Schedule Management', 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-05-17 09:47:39', '2026-05-17 09:47:39', 'postgraduate', 'ماجستير ادارة الاعمال', 'kian'),
(26, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الثاني', 'ادراه وتحليل المشاريع الصغيرة 2', 'Small Project Analysis Management 2', 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-05-17 09:48:04', '2026-05-18 10:20:38', 'postgraduate', 'ماجستير ادارة الاعمال', 'kian'),
(27, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الثاني', 'تهيئة العمال', 'Worker Orientation', 'د. نادر حسن', 3.00, 100, 40, 60, '2026-05-17 09:48:37', '2026-05-17 09:48:37', 'postgraduate', 'ماجستير ادارة الاعمال', 'kian'),
(28, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الثاني', 'تقليل البطالة', 'Reducing Unemployment', 'أ. ريم عمر', 3.00, 100, 40, 60, '2026-05-17 09:48:59', '2026-05-17 09:48:59', 'postgraduate', 'ماجستير ادارة الاعمال', 'kian'),
(29, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الثالث', 'تهيئة العمال 2', 'Worker Orientation 2', 'د. نادر حسن', 3.00, 100, 40, 60, '2026-05-17 09:49:37', '2026-05-18 10:20:55', 'postgraduate', 'ماجستير ادارة الاعمال', 'kian'),
(30, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الثالث', 'الذكاء الاجتماعي', 'Social Intelligence', 'أ. خالد صالح', 3.00, 100, 40, 60, '2026-05-17 09:50:00', '2026-05-17 09:50:00', 'postgraduate', 'ماجستير ادارة الاعمال', 'kian'),
(31, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الثالث', 'بحث تكميلي', 'Supplementary Research', 'أ. ريم عمر', 3.00, 100, 40, 60, '2026-05-17 09:50:44', '2026-05-17 09:50:44', 'postgraduate', 'ماجستير ادارة الاعمال', 'kian');

-- --------------------------------------------------------

--
-- Table structure for table `course_grades`
--

CREATE TABLE `course_grades` (
  `id` int(11) NOT NULL,
  `course_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `attempt_number` tinyint(3) UNSIGNED NOT NULL DEFAULT 1,
  `coursework_mark` decimal(6,2) DEFAULT NULL,
  `final_exam_mark` decimal(6,2) DEFAULT NULL,
  `total_mark` decimal(6,2) DEFAULT NULL,
  `letter` varchar(10) DEFAULT NULL,
  `points` decimal(4,2) DEFAULT NULL,
  `created_by` varchar(100) DEFAULT NULL,
  `updated_by` varchar(100) DEFAULT NULL,
  `is_repeat` tinyint(1) NOT NULL DEFAULT 0,
  `is_absent` tinyint(1) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `penalty_type` varchar(50) DEFAULT 'none',
  `suspension_duration` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `course_grades`
--

INSERT INTO `course_grades` (`id`, `course_id`, `student_id`, `attempt_number`, `coursework_mark`, `final_exam_mark`, `total_mark`, `letter`, `points`, `created_by`, `updated_by`, `is_repeat`, `is_absent`, `created_at`, `updated_at`, `penalty_type`, `suspension_duration`) VALUES
(1, 1, 2, 1, 0.00, 0.00, 0.00, 'F', 0.00, 'kian', NULL, 0, 1, '2026-05-13 10:21:29', '2026-05-13 10:21:29', 'none', NULL),
(2, 1, 5, 1, 33.00, 53.00, 86.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-13 10:21:29', '2026-05-13 10:21:29', 'none', NULL),
(3, 1, 4, 1, 33.00, 56.00, 89.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-13 10:21:29', '2026-05-13 10:21:29', 'none', NULL),
(4, 1, 3, 1, 40.00, 54.00, 94.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-13 10:21:29', '2026-05-13 10:21:29', 'none', NULL),
(5, 1, 1, 1, 40.00, 54.00, 94.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-13 10:21:29', '2026-05-13 10:21:29', 'none', NULL),
(6, 4, 2, 1, 30.00, 15.00, 45.00, 'F', 0.00, 'kian', 'kian', 0, 0, '2026-05-13 10:22:22', '2026-05-18 08:15:22', 'none', NULL),
(7, 4, 5, 1, 40.00, 34.00, 74.00, 'B', 3.00, 'kian', 'kian', 0, 0, '2026-05-13 10:22:23', '2026-05-18 08:15:22', 'none', NULL),
(8, 4, 4, 1, 40.00, 40.00, 80.00, 'A', 4.00, 'kian', 'kian', 0, 0, '2026-05-13 10:22:23', '2026-05-18 08:15:22', 'none', NULL),
(9, 4, 3, 1, 40.00, 54.00, 94.00, 'A', 4.00, 'kian', 'kian', 0, 0, '2026-05-13 10:22:23', '2026-05-18 08:15:22', 'none', NULL),
(10, 4, 1, 1, 40.00, 56.00, 96.00, 'A', 4.00, 'kian', 'kian', 0, 0, '2026-05-13 10:22:23', '2026-05-18 08:15:22', 'none', NULL),
(11, 3, 2, 1, 40.00, 45.00, 85.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-13 10:22:57', '2026-05-13 10:22:57', 'none', NULL),
(12, 3, 5, 1, 40.00, 60.00, 100.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-13 10:22:57', '2026-05-13 10:22:57', 'none', NULL),
(13, 3, 4, 1, 40.00, 60.00, 100.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-13 10:22:57', '2026-05-13 10:22:57', 'none', NULL),
(14, 3, 3, 1, 40.00, 34.00, 74.00, 'B', 3.00, 'kian', NULL, 0, 0, '2026-05-13 10:22:57', '2026-05-13 10:22:57', 'warning', NULL),
(15, 3, 1, 1, 40.00, 43.00, 83.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-13 10:22:57', '2026-05-13 10:22:57', 'none', NULL),
(16, 2, 2, 1, 40.00, 22.00, 62.00, 'C+', 2.50, 'kian', NULL, 0, 0, '2026-05-13 10:24:10', '2026-05-13 10:24:10', 'none', NULL),
(17, 2, 5, 1, 39.00, 33.00, 72.00, 'B', 3.00, 'kian', NULL, 0, 0, '2026-05-13 10:24:10', '2026-05-13 10:24:10', 'none', NULL),
(18, 2, 4, 1, 34.00, 44.00, 78.00, 'B+', 3.50, 'kian', NULL, 0, 0, '2026-05-13 10:24:10', '2026-05-13 10:24:10', 'none', NULL),
(19, 2, 3, 1, 40.00, 55.00, 95.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-13 10:24:10', '2026-05-13 10:24:10', 'none', NULL),
(20, 2, 1, 1, 30.00, 60.00, 90.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-13 10:24:10', '2026-05-13 10:24:10', 'none', NULL),
(21, 7, 2, 1, 30.00, 35.00, 65.00, 'C+', 2.50, 'kian', 'kian', 0, 0, '2026-05-14 07:58:13', '2026-05-18 08:16:36', 'none', NULL),
(22, 7, 5, 1, 32.00, 56.00, 88.00, 'A', 4.00, 'kian', 'kian', 0, 0, '2026-05-14 07:58:13', '2026-05-18 08:16:36', 'none', NULL),
(23, 7, 4, 1, 21.00, 45.00, 66.00, 'C+', 2.50, 'kian', 'kian', 0, 0, '2026-05-14 07:58:13', '2026-05-18 08:16:36', 'none', NULL),
(24, 7, 3, 1, 25.00, 54.00, 79.00, 'B+', 3.50, 'kian', 'kian', 0, 0, '2026-05-14 07:58:13', '2026-05-18 08:16:36', 'none', NULL),
(25, 7, 1, 1, 31.00, 54.00, 85.00, 'A', 4.00, 'kian', 'kian', 0, 0, '2026-05-14 07:58:13', '2026-05-18 08:16:36', 'none', NULL),
(26, 5, 2, 1, 23.00, 44.00, 67.00, 'C+', 2.50, 'kian', NULL, 0, 0, '2026-05-14 07:58:42', '2026-05-14 07:58:42', 'none', NULL),
(27, 5, 5, 1, 34.00, 43.00, 77.00, 'B+', 3.50, 'kian', NULL, 0, 0, '2026-05-14 07:58:42', '2026-05-14 07:58:42', 'none', NULL),
(28, 5, 4, 1, 34.00, 43.00, 77.00, 'B+', 3.50, 'kian', NULL, 0, 0, '2026-05-14 07:58:42', '2026-05-14 07:58:42', 'none', NULL),
(29, 5, 3, 1, 32.00, 34.00, 66.00, 'C+', 2.50, 'kian', NULL, 0, 0, '2026-05-14 07:58:42', '2026-05-14 07:58:42', 'none', NULL),
(30, 5, 1, 1, 22.00, 33.00, 55.00, 'C', 2.00, 'kian', NULL, 0, 0, '2026-05-14 07:58:42', '2026-05-14 07:58:42', 'none', NULL),
(31, 6, 2, 1, 40.00, 33.00, 73.00, 'B', 3.00, 'kian', NULL, 0, 0, '2026-05-14 07:59:00', '2026-05-14 07:59:00', 'none', NULL),
(32, 6, 5, 1, 40.00, 44.00, 84.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-14 07:59:00', '2026-05-14 07:59:00', 'none', NULL),
(33, 6, 4, 1, 32.00, 43.00, 75.00, 'B+', 3.50, 'kian', NULL, 0, 0, '2026-05-14 07:59:00', '2026-05-14 07:59:00', 'none', NULL),
(34, 6, 3, 1, 23.00, 32.00, 55.00, 'C', 2.00, 'kian', NULL, 0, 0, '2026-05-14 07:59:00', '2026-05-14 07:59:00', 'none', NULL),
(35, 6, 1, 1, 40.00, 32.00, 72.00, 'B', 3.00, 'kian', NULL, 0, 0, '2026-05-14 07:59:00', '2026-05-14 07:59:00', 'none', NULL),
(36, 8, 2, 1, 30.00, 34.00, 64.00, 'C+', 2.50, 'kian', 'kian', 0, 0, '2026-05-14 07:59:16', '2026-05-18 08:16:45', 'none', NULL),
(37, 8, 5, 1, 40.00, 60.00, 100.00, 'A', 4.00, 'kian', 'kian', 0, 0, '2026-05-14 07:59:16', '2026-05-18 08:16:45', 'none', NULL),
(38, 8, 4, 1, 32.00, 33.00, 65.00, 'C+', 2.50, 'kian', 'kian', 0, 0, '2026-05-14 07:59:16', '2026-05-18 08:16:45', 'none', NULL),
(39, 8, 3, 1, 30.00, 32.00, 62.00, 'C+', 2.50, 'kian', 'kian', 0, 0, '2026-05-14 07:59:16', '2026-05-18 08:16:45', 'none', NULL),
(40, 8, 1, 1, 40.00, 22.00, 62.00, 'C+', 2.50, 'kian', 'kian', 0, 0, '2026-05-14 07:59:16', '2026-05-18 08:16:45', 'none', NULL),
(41, 10, 3, 1, 32.00, 32.00, 64.00, 'C+', 2.50, 'kian', NULL, 0, 0, '2026-05-14 08:00:03', '2026-05-14 08:00:03', 'none', NULL),
(42, 11, 3, 1, 30.00, 43.00, 73.00, 'B', 3.00, 'kian', NULL, 0, 0, '2026-05-14 08:00:11', '2026-05-14 08:00:11', 'none', NULL),
(43, 9, 3, 1, 33.00, 23.00, 56.00, 'C', 2.00, 'kian', NULL, 0, 0, '2026-05-14 08:00:18', '2026-05-14 08:00:18', 'none', NULL),
(44, 12, 3, 1, 23.00, 45.00, 68.00, 'C+', 2.50, 'kian', NULL, 0, 0, '2026-05-14 08:00:32', '2026-05-14 08:00:32', 'none', NULL),
(45, 13, 3, 1, 40.00, 34.00, 74.00, 'B', 3.00, 'kian', NULL, 0, 0, '2026-05-14 08:00:39', '2026-05-14 08:00:39', 'none', NULL),
(46, 15, 3, 1, 32.00, 32.00, 64.00, 'C+', 2.50, 'kian', NULL, 0, 0, '2026-05-14 08:00:57', '2026-05-14 08:00:57', 'none', NULL),
(47, 14, 3, 1, 34.00, 33.00, 67.00, 'C+', 2.50, 'kian', NULL, 0, 0, '2026-05-14 08:01:05', '2026-05-14 08:01:05', 'none', NULL),
(48, 18, 3, 1, 23.00, 33.00, 56.00, 'C', 2.00, 'kian', NULL, 0, 0, '2026-05-14 08:01:21', '2026-05-14 08:01:21', 'none', NULL),
(49, 17, 3, 1, 40.00, 33.00, 73.00, 'B', 3.00, 'kian', NULL, 0, 0, '2026-05-14 08:01:26', '2026-05-14 08:01:26', 'none', NULL),
(50, 16, 3, 1, 33.00, 33.00, 66.00, 'C+', 2.50, 'kian', NULL, 0, 0, '2026-05-14 08:01:34', '2026-05-14 08:01:34', 'none', NULL),
(51, 20, 3, 1, 23.00, 33.00, 56.00, 'C', 2.00, 'kian', NULL, 0, 0, '2026-05-14 08:02:37', '2026-05-14 08:02:37', 'none', NULL),
(52, 19, 3, 1, 40.00, 32.00, 72.00, 'B', 3.00, 'kian', NULL, 0, 0, '2026-05-14 08:02:42', '2026-05-14 08:02:42', 'none', NULL),
(53, 22, 3, 1, 33.00, 43.00, 76.00, 'B+', 3.50, 'kian', NULL, 0, 0, '2026-05-14 08:02:54', '2026-05-14 08:02:54', 'none', NULL),
(54, 21, 3, 1, 40.00, 33.00, 73.00, 'B', 3.00, 'kian', NULL, 0, 0, '2026-05-14 08:03:00', '2026-05-14 08:03:00', 'none', NULL),
(55, 25, 6, 1, 40.00, 44.00, 84.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-17 09:51:35', '2026-05-17 09:51:35', 'none', NULL),
(56, 23, 6, 1, 40.00, 33.00, 73.00, 'B', 3.00, 'kian', NULL, 0, 0, '2026-05-17 09:51:42', '2026-05-17 09:51:42', 'none', NULL),
(57, 24, 6, 1, 23.00, 44.00, 67.00, 'C+', 2.50, 'kian', NULL, 0, 0, '2026-05-17 09:51:50', '2026-05-17 09:51:50', 'none', NULL),
(58, 26, 6, 1, 40.00, 44.00, 84.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-17 09:52:03', '2026-05-17 09:52:03', 'none', NULL),
(59, 28, 6, 1, 25.00, 55.00, 80.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-17 09:52:11', '2026-05-17 09:52:11', 'none', NULL),
(60, 27, 6, 1, 22.00, 42.00, 64.00, 'C+', 2.50, 'kian', NULL, 0, 0, '2026-05-17 09:52:19', '2026-05-17 09:52:19', 'none', NULL),
(61, 30, 6, 1, 40.00, 33.00, 73.00, 'B', 3.00, 'kian', NULL, 0, 0, '2026-05-17 09:52:39', '2026-05-17 09:52:39', 'none', NULL),
(62, 31, 6, 1, 33.00, 56.00, 89.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-17 09:52:48', '2026-05-17 09:52:48', 'none', NULL),
(63, 29, 6, 1, 40.00, 54.00, 94.00, 'A', 4.00, 'kian', NULL, 0, 0, '2026-05-17 09:52:53', '2026-05-17 09:52:53', 'none', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `departments`
--

CREATE TABLE `departments` (
  `id` int(11) NOT NULL,
  `faculty_id` int(11) NOT NULL,
  `department_name` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `department_name_en` varchar(255) DEFAULT NULL,
  `levels_count` int(11) DEFAULT 4,
  `created_by` varchar(255) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_by` varchar(255) DEFAULT NULL,
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `departments`
--

INSERT INTO `departments` (`id`, `faculty_id`, `department_name`, `department_name_en`, `levels_count`, `created_by`, `created_at`, `updated_by`, `updated_at`) VALUES
(1, 1, 'نظم المعلومات', 'IS', 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(2, 1, 'علوم الحاسوب', 'CS', 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(3, 1, 'الشبكات', 'NW', 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(4, 2, 'تمويل', NULL, 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(5, 2, 'إدارة أعمال', NULL, 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(6, 2, 'محاسبة تكاليف', NULL, 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(7, 3, 'محاسبة', NULL, 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(8, 3, 'إدارة أعمال', NULL, 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(9, 3, 'اقتصاد', NULL, 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(10, 4, 'باطني', NULL, 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(11, 4, 'جراحه', NULL, 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(12, 5, 'الطفيليات', NULL, 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(13, 7, 'اللغة الانجليزية', NULL, 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(14, 1, 'تقنية المعلومات', 'IT', 4, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09'),
(15, 6, 'طب اسنان', NULL, 5, NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09');

-- --------------------------------------------------------

--
-- Table structure for table `faculties`
--

CREATE TABLE `faculties` (
  `id` int(11) NOT NULL,
  `faculty_name` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `faculty_name_en` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `faculty_type` enum('theoretical','practical') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'theoretical',
  `created_by` varchar(255) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_by` varchar(255) DEFAULT NULL,
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `faculty_code` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `faculties`
--

INSERT INTO `faculties` (`id`, `faculty_name`, `faculty_name_en`, `faculty_type`, `created_by`, `created_at`, `updated_by`, `updated_at`, `faculty_code`) VALUES
(1, 'كلية علوم الحاسوب', 'College of Computer Science', 'practical', NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09', 'PAU004'),
(2, 'كلية العلوم الأدارية', NULL, 'theoretical', NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09', 'PAU006'),
(3, 'كلية الإقتصاد والعلوم المصرفيه', 'College of Economics and Banking Sciences', 'theoretical', NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09', 'PAU005'),
(4, 'كلية علوم التمريض', NULL, 'practical', NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09', 'PAU003'),
(5, 'كلية علوم المختبرات الطبية', NULL, 'practical', NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09', 'PAU002'),
(6, 'كلية الطب والجراحة', 'College of Medicine and Surgery', 'theoretical', NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09', 'PAU001'),
(7, 'كلية اللغات والترجمه', NULL, 'theoretical', NULL, '2026-05-05 15:40:09', NULL, '2026-05-05 15:40:09', 'PAU007');

-- --------------------------------------------------------

--
-- Table structure for table `fees`
--

CREATE TABLE `fees` (
  `id` int(11) NOT NULL,
  `student_id` int(11) DEFAULT NULL,
  `academic_year` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `level_name` varchar(60) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `currency` enum('SDG','USD') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'SDG',
  `term_name` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `program_type` enum('diploma','bachelor','postgraduate') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'bachelor',
  `postgraduate_program` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `department_id` int(11) DEFAULT NULL,
  `registration_fee` decimal(10,2) DEFAULT NULL,
  `tuition_fee` decimal(10,2) DEFAULT NULL,
  `late_fee` decimal(10,2) DEFAULT NULL,
  `scholarship_type` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT 'لا منحة',
  `scholarship_percentage` decimal(5,2) DEFAULT 0.00 COMMENT 'نسبة الخصم',
  `scholarship_granted_by` varchar(150) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `payment_start_date` date DEFAULT NULL,
  `payment_end_date` date DEFAULT NULL,
  `installment_1` decimal(10,2) DEFAULT NULL,
  `installment_1_id` int(11) DEFAULT NULL,
  `installment_1_start` date DEFAULT NULL,
  `installment_1_end` date DEFAULT NULL,
  `installment_1_paid` tinyint(1) DEFAULT 0,
  `installment_1_paid_at` date DEFAULT NULL,
  `installment_2` decimal(10,2) DEFAULT NULL,
  `installment_2_id` int(11) DEFAULT NULL,
  `installment_2_start` date DEFAULT NULL,
  `installment_2_end` date DEFAULT NULL,
  `installment_2_paid` tinyint(1) DEFAULT 0,
  `installment_2_paid_at` date DEFAULT NULL,
  `installment_3` decimal(10,2) DEFAULT NULL,
  `installment_3_id` int(11) DEFAULT NULL,
  `installment_3_start` date DEFAULT NULL,
  `installment_3_end` date DEFAULT NULL,
  `installment_3_paid` tinyint(1) DEFAULT 0,
  `installment_3_paid_at` date DEFAULT NULL,
  `installment_4` decimal(10,2) DEFAULT NULL,
  `installment_4_id` int(11) DEFAULT NULL,
  `installment_4_start` date DEFAULT NULL,
  `installment_4_end` date DEFAULT NULL,
  `installment_4_paid` tinyint(1) DEFAULT 0,
  `installment_4_paid_at` date DEFAULT NULL,
  `installment_5` decimal(10,2) DEFAULT NULL,
  `installment_5_id` int(11) DEFAULT NULL,
  `installment_5_start` date DEFAULT NULL,
  `installment_5_end` date DEFAULT NULL,
  `installment_5_paid` tinyint(1) DEFAULT 0,
  `installment_5_paid_at` date DEFAULT NULL,
  `installment_6` decimal(10,2) DEFAULT NULL,
  `installment_6_id` int(11) DEFAULT NULL,
  `installment_6_start` date DEFAULT NULL,
  `installment_6_end` date DEFAULT NULL,
  `installment_6_paid` tinyint(1) DEFAULT 0,
  `installment_6_paid_at` date DEFAULT NULL,
  `registrar` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `created_by` varchar(100) DEFAULT NULL,
  `updated_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `freeze_fee` decimal(10,2) DEFAULT 0.00,
  `unfreeze_fee` decimal(10,2) DEFAULT 0.00,
  `repeat_discount` int(11) DEFAULT 50,
  `is_paid` tinyint(1) DEFAULT 0 COMMENT '0 = غير مدفوع, 1 = مدفوع',
  `is_synced` tinyint(4) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `fees`
--

INSERT INTO `fees` (`id`, `student_id`, `academic_year`, `level_name`, `currency`, `term_name`, `program_type`, `postgraduate_program`, `department_id`, `registration_fee`, `tuition_fee`, `late_fee`, `scholarship_type`, `scholarship_percentage`, `scholarship_granted_by`, `payment_start_date`, `payment_end_date`, `installment_1`, `installment_1_id`, `installment_1_start`, `installment_1_end`, `installment_1_paid`, `installment_1_paid_at`, `installment_2`, `installment_2_id`, `installment_2_start`, `installment_2_end`, `installment_2_paid`, `installment_2_paid_at`, `installment_3`, `installment_3_id`, `installment_3_start`, `installment_3_end`, `installment_3_paid`, `installment_3_paid_at`, `installment_4`, `installment_4_id`, `installment_4_start`, `installment_4_end`, `installment_4_paid`, `installment_4_paid_at`, `installment_5`, `installment_5_id`, `installment_5_start`, `installment_5_end`, `installment_5_paid`, `installment_5_paid_at`, `installment_6`, `installment_6_id`, `installment_6_start`, `installment_6_end`, `installment_6_paid`, `installment_6_paid_at`, `registrar`, `created_by`, `updated_by`, `created_at`, `updated_at`, `freeze_fee`, `unfreeze_fee`, `repeat_discount`, `is_paid`, `is_synced`) VALUES
(1, NULL, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, 2, 500000.00, 1500000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', NULL, NULL, '2026-05-13 09:16:47', '2026-05-13 09:16:47', 0.00, 0.00, 50, 0, 0),
(2, 1, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 500000.00, 1500000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 666666.67, 1, '2026-05-13', '2026-06-30', 1, NULL, 666666.67, 2, '2026-07-13', '2026-08-27', 0, NULL, 666666.66, 3, '2026-09-13', '2026-10-30', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, '', NULL, NULL, '2026-05-13 09:18:20', '2026-05-13 09:18:20', 0.00, 0.00, 50, 0, 0),
(3, 2, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 500000.00, 825000.00, 0.00, 'منحة أشقاء', 45.00, 'السيد الوكيل خالد', NULL, NULL, 441666.67, 4, '2026-05-13', '2026-07-13', 1, NULL, 441666.67, 5, '2026-08-13', '2026-10-13', 0, NULL, 441666.66, 6, '2026-11-13', '2026-12-31', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', 'kian', '2026-05-13 09:45:48', '2026-05-13 09:48:38', 0.00, 0.00, 50, 0, 0),
(4, 3, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 0.00, 0.00, 0.00, 'منحة أبناء مؤسسين', 100.00, 'الجامعة', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', NULL, '2026-05-13 09:49:51', '2026-05-13 09:49:51', 0.00, 0.00, 50, 0, 0),
(5, 4, '2025/2026', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, NULL, 500000.00, 1500000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 500000.00, 7, '2026-05-13', '2026-06-13', 1, NULL, 500000.00, 8, '2026-07-13', '2026-08-13', 0, NULL, 500000.00, 9, '2026-09-13', '2026-10-13', 0, NULL, 500000.00, 10, '2026-11-13', '2026-12-13', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', NULL, '2026-05-13 09:52:19', '2026-05-13 09:52:19', 0.00, 0.00, 50, 0, 0),
(6, 5, '2025/2026', 'المستوى الأول', 'USD', NULL, 'bachelor', NULL, NULL, 500000.00, 1500000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 1000000.00, 11, '2026-05-13', '2026-07-13', 1, NULL, 1000000.00, 12, '2026-08-13', '2026-09-14', 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', NULL, '2026-05-13 09:53:21', '2026-05-13 09:53:21', 0.00, 0.00, 50, 0, 0),
(7, NULL, '2026/2027', 'المستوى الأول', 'SDG', NULL, 'bachelor', NULL, 2, 1000000.00, 3500000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', 'kian', '2026-05-13 09:58:42', '2026-05-13 09:59:45', 0.00, 0.00, 50, 0, 0),
(8, 3, '2026/2027', 'المستوى الثاني', 'SDG', NULL, 'bachelor', NULL, NULL, 0.00, 0.00, 0.00, 'منحة أبناء مؤسسين', 100.00, 'الجامعة', NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', NULL, '2026-05-13 14:14:55', '2026-05-13 14:14:55', 0.00, 0.00, 50, 0, 0),
(9, NULL, '2027/2028', 'المستوى الثالث', 'SDG', NULL, 'bachelor', NULL, 2, 1500000.00, 3500000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', NULL, '2026-05-13 14:16:11', '2026-05-13 14:16:11', 0.00, 0.00, 50, 0, 0),
(10, 3, '2027/2028', 'المستوى الثالث', 'SDG', NULL, 'bachelor', NULL, NULL, 0.00, 0.00, 0.00, 'منحة أبناء مؤسسين', 100.00, 'الجامعة', NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', NULL, '2026-05-13 14:31:46', '2026-05-13 14:31:46', 0.00, 0.00, 50, 0, 0),
(11, NULL, '2028/2029', 'المستوى الرابع', 'SDG', NULL, 'bachelor', NULL, 2, 2500000.00, 3500000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', NULL, '2026-05-13 14:32:42', '2026-05-13 14:32:42', 0.00, 0.00, 50, 0, 0),
(12, 3, '2028/2029', 'المستوى الرابع', 'SDG', NULL, 'bachelor', NULL, NULL, 0.00, 0.00, 0.00, 'منحة أبناء مؤسسين', 100.00, 'الجامعة', NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', NULL, '2026-05-13 14:33:03', '2026-05-13 14:33:03', 0.00, 0.00, 50, 0, 0),
(13, NULL, '2025/2026', 'الدفعة الأولى', 'SDG', '', 'postgraduate', 'ماجستير ادارة الاعمال', 8, 500000.00, 2400000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', NULL, '2026-05-17 09:19:27', '2026-05-17 09:19:27', 0.00, 0.00, 50, 0, 0),
(14, 6, '2025/2026', 'الدفعة الأولى', 'SDG', 'الفصل الأول', 'postgraduate', 'ماجستير ادارة الاعمال', NULL, 500000.00, 2400000.00, 0.00, 'لا منحة', 0.00, NULL, NULL, NULL, 2900000.00, 13, '2026-05-17', '2026-05-31', 1, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 'kian', 'kian', NULL, '2026-05-17 09:19:52', '2026-05-17 09:19:52', 0.00, 0.00, 50, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `grading_rules`
--

CREATE TABLE `grading_rules` (
  `id` int(11) NOT NULL,
  `rule_type` varchar(30) NOT NULL,
  `program_mode` varchar(20) DEFAULT NULL,
  `label` varchar(255) NOT NULL,
  `min_value` decimal(6,2) NOT NULL,
  `max_value` decimal(6,2) NOT NULL,
  `points` decimal(4,2) DEFAULT NULL,
  `term_calc_mode` enum('percentage','courses') DEFAULT NULL,
  `gpa_max` decimal(4,2) DEFAULT NULL,
  `cumulative_calc_mode` enum('simple_avg','weighted_avg') DEFAULT NULL,
  `sort_order` int(11) NOT NULL DEFAULT 0,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL,
  `faculty_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `grading_rules`
--

INSERT INTO `grading_rules` (`id`, `rule_type`, `program_mode`, `label`, `min_value`, `max_value`, `points`, `term_calc_mode`, `gpa_max`, `cumulative_calc_mode`, `sort_order`, `created_at`, `updated_at`, `faculty_id`) VALUES
(53, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(56, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(59, 'grade_scale', NULL, 'B+', 75.00, 79.99, 3.50, NULL, NULL, NULL, 2, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(62, 'grade_scale', NULL, 'B', 70.00, 74.99, 3.00, NULL, NULL, NULL, 3, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(65, 'grade_scale', NULL, 'C+', 60.00, 69.99, 2.50, NULL, NULL, NULL, 4, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(68, 'grade_scale', NULL, 'C', 50.00, 59.99, 2.00, NULL, NULL, NULL, 5, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(71, 'grade_scale', NULL, 'F', 0.00, 49.99, 0.00, NULL, NULL, NULL, 7, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(87, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(90, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(93, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(96, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(99, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(105, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(108, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(111, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(114, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2025-12-28 13:29:04', '2025-12-28 13:29:04', 2),
(212, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(213, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(214, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(215, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(216, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(217, 'grade_scale', NULL, 'C', 50.00, 59.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(218, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(219, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 7, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(220, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(221, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(222, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(223, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(224, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(225, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(226, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(227, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:06:35', '2026-04-30 10:06:35', 3),
(243, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(244, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(245, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(246, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(247, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(248, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(249, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 6, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(250, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(251, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(252, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(253, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.99, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(254, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(255, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(256, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(257, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:13:27', '2026-04-30 10:13:27', 6),
(258, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(259, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(260, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(261, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(262, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(263, 'grade_scale', NULL, 'C', 50.00, 59.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(264, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(265, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 7, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(266, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(267, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(268, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(269, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(270, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(271, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(272, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(273, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:18:31', '2026-04-30 10:18:31', 7),
(274, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(275, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(276, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(277, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(278, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(279, 'grade_scale', NULL, 'C', 50.00, 59.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(280, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(281, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 7, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(282, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(283, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(284, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(285, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(286, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(287, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(288, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(289, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:20:04', '2026-04-30 10:20:04', 4),
(290, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(291, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(292, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(293, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(294, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(295, 'grade_scale', NULL, 'C', 50.00, 59.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(296, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(297, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 7, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(298, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(299, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(300, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية (القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(301, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(302, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(303, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(304, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(305, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:20:51', '2026-04-30 10:20:51', 1),
(306, 'gpa_settings', NULL, '{\"total_mark\":100,\"final_exam_max\":60,\"coursework_max\":40,\"rounding_decimals\":2}', 0.00, 0.00, NULL, 'courses', 4.00, 'weighted_avg', 0, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(307, 'grade_scale', NULL, 'A', 80.00, 100.00, 4.00, NULL, NULL, NULL, 1, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(308, 'grade_scale', NULL, 'B+', 75.00, 79.00, 3.50, NULL, NULL, NULL, 2, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(309, 'grade_scale', NULL, 'B', 70.00, 74.00, 3.00, NULL, NULL, NULL, 3, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(310, 'grade_scale', NULL, 'C+', 60.00, 69.00, 2.50, NULL, NULL, NULL, 4, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(311, 'grade_scale', NULL, 'C', 50.00, 59.00, 2.00, NULL, NULL, NULL, 5, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(312, 'grade_scale', NULL, 'C*', -1.00, -1.00, 2.00, NULL, NULL, NULL, 6, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(313, 'grade_scale', NULL, 'F', 0.00, 0.00, 0.00, NULL, NULL, NULL, 7, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(314, 'gpa_classification', 'honors', 'مرتبة الشرف الأولى', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(315, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الأول)', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(316, 'gpa_classification', 'honors', 'مرتبة الشرف الثانية(القسم الثاني)', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(317, 'gpa_classification', 'honors', 'مرتبة الشرف الثالثة', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(318, 'gpa_classification', 'general', 'ممتاز', 3.50, 4.00, NULL, NULL, NULL, NULL, 1, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(319, 'gpa_classification', 'general', 'جيد جداً', 3.00, 3.49, NULL, NULL, NULL, NULL, 2, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(320, 'gpa_classification', 'general', 'جيد', 2.50, 2.99, NULL, NULL, NULL, NULL, 3, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5),
(321, 'gpa_classification', 'general', 'مقبول', 2.00, 2.49, NULL, NULL, NULL, NULL, 4, '2026-04-30 10:24:51', '2026-04-30 10:24:51', 5);

-- --------------------------------------------------------

--
-- Table structure for table `payments`
--

CREATE TABLE `payments` (
  `id` int(11) NOT NULL,
  `university_id` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `academic_year` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `level_name` varchar(60) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `term_name` varchar(60) DEFAULT NULL,
  `amount_paid` decimal(12,2) NOT NULL,
  `payment_date` datetime NOT NULL,
  `transaction_id` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `bank_ref` varchar(100) DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 0,
  `currency` varchar(10) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT 'SDG',
  `notes` text CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `received_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `is_confirmed` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `payments`
--

INSERT INTO `payments` (`id`, `university_id`, `academic_year`, `level_name`, `term_name`, `amount_paid`, `payment_date`, `transaction_id`, `bank_ref`, `status`, `currency`, `notes`, `received_at`, `is_confirmed`) VALUES
(9, '2025220004', '2025/2026', 'المستوى الأول', NULL, 16333.34, '2026-04-22 08:34:09', '33', 'BANK-REF-XKFNEB31B', 1, 'SDG', '', '2026-04-22 08:33:55', 0),
(11, '321456', '2025/2026', NULL, 'الفصل الأول', 50000.00, '2026-04-22 09:20:30', '44', 'BANK-REF-N7HM7IH26', 1, 'SDG', '', '2026-04-22 08:37:34', 0),
(16, '2025220008', '2025/2026', 'المستوى الأول', NULL, 350000.00, '2026-04-23 09:32:54', '42', 'BANK-REF-IR1RCWZIG', 1, 'SDG', '', '2026-04-23 09:26:35', 1),
(17, '2025220008', '2025/2026', 'المستوى الأول', NULL, 175000.00, '2026-04-23 09:26:42', '43', 'BANK-REF-M23TFIAI6', 1, 'SDG', '', '2026-04-23 09:26:42', 0),
(19, '202522000313', '2025/2026', 'المستوى الأول', NULL, 65000.00, '2026-05-05 07:39:57', '57', 'BANK-REF-HKESGLRCW', 1, 'SDG', '', '2026-05-05 07:30:31', 1),
(21, '202522000313', '2025/2026', 'المستوى الأول', NULL, 130000.00, '2026-05-05 08:21:00', '58', 'BANK-REF-YLIWNMQ0T', 0, 'SDG', '', '2026-05-05 08:20:12', 0);

-- --------------------------------------------------------

--
-- Table structure for table `rooms`
--

CREATE TABLE `rooms` (
  `id` int(11) NOT NULL,
  `room_name` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `rooms`
--

INSERT INTO `rooms` (`id`, `room_name`, `created_at`) VALUES
(1, 'قاعة 1', '2025-12-30 12:16:30'),
(2, 'قاعة 2', '2025-12-30 13:36:58'),
(3, 'قاعة 3', '2025-12-30 13:37:03'),
(4, 'قاعة 4', '2026-01-13 07:16:18');

-- --------------------------------------------------------

--
-- Table structure for table `staff_members`
--

CREATE TABLE `staff_members` (
  `id` int(11) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `staff_code` varchar(50) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `faculty_id` int(11) NOT NULL,
  `department_id` int(11) DEFAULT NULL,
  `academic_rank` varchar(100) DEFAULT NULL,
  `specialization` varchar(255) DEFAULT NULL,
  `status` enum('active','inactive') NOT NULL DEFAULT 'active',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `staff_members`
--

INSERT INTO `staff_members` (`id`, `full_name`, `staff_code`, `email`, `phone`, `faculty_id`, `department_id`, `academic_rank`, `specialization`, `status`, `created_at`, `updated_at`) VALUES
(1, 'د. محمد عادل', 'STF-001', 'm.adel@uni.edu', '0912345678', 1, 2, 'أستاذ مساعد', 'قواعد بيانات', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(2, 'د. سارة نبيل', 'STF-002', 's.nabil@uni.edu', '0912345679', 1, 1, 'محاضر', 'شبكات', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(3, 'د. علي الطيب', 'STF-003', 'a.tayeb@uni.edu', '0912345680', 1, 3, 'محاضر', 'هندسة برمجيات', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(4, 'م. أحمد الطيب', 'STF-004', 'eng.ahmed@uni.edu', '0912345681', 2, 5, 'محاضر', 'قدرة وتحكم', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(5, 'م. مروة صالح', 'STF-005', 'm.salih@uni.edu', '0912345682', 2, 4, 'محاضر', 'إنشاءات', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(6, 'د. نادر حسن', 'STF-006', 'n.hassan@uni.edu', '0912345683', 3, 8, 'محاضر', 'إدارة', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(7, 'أ. خالد صالح', 'STF-007', 'k.saleh@uni.edu', '0912345684', 3, 7, 'محاضر', 'محاسبة', 'active', '2025-12-28 11:20:32', '2025-12-28 11:20:32'),
(8, 'أ. ريم عمر', 'STF-008', 'r.omar@uni.edu', '0912345685', 3, 9, 'محاضر', 'اقتصاد', 'active', '2025-12-28 11:20:32', '2026-02-05 12:36:18'),
(10, 'د.محمد علي', NULL, NULL, '09090909', 4, NULL, 'أستاذ مساعد', 'جراحة', 'active', '2025-12-29 13:50:45', '0000-00-00 00:00:00'),
(11, 'هاشم علي', NULL, NULL, NULL, 5, NULL, 'محاضر', 'مختبرات', 'active', '2026-02-09 07:26:18', '0000-00-00 00:00:00'),
(12, 'حامد محمد', NULL, NULL, NULL, 7, NULL, 'أستاذ مساعد', 'لغات', 'active', '2026-04-30 08:02:09', '0000-00-00 00:00:00'),
(13, 'هارون حين', NULL, NULL, NULL, 7, NULL, 'محاضر', 'لغات', 'active', '2026-04-30 08:02:22', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- Table structure for table `students`
--

CREATE TABLE `students` (
  `id` int(11) NOT NULL,
  `first_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `second_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `third_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `fourth_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `full_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `nationality` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT 'الجنسية',
  `gender` enum('male','female') CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `status` enum('active','inactive') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'active',
  `university_id` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '0',
  `phone` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `receipt_number` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `department_id` int(11) DEFAULT NULL,
  `college` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `level` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `academic_year` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `academic_status` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `registration_status` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `notes` text CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `registrar` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `university_id_for_unique` varchar(50) GENERATED ALWAYS AS (nullif(trim(`university_id`),'0')) STORED
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `students`
--

INSERT INTO `students` (`id`, `first_name`, `second_name`, `third_name`, `fourth_name`, `full_name`, `nationality`, `gender`, `status`, `university_id`, `phone`, `receipt_number`, `department_id`, `college`, `level`, `academic_year`, `academic_status`, `registration_status`, `notes`, `registrar`, `created_at`) VALUES
(1, 'هناء', 'احمد', 'محمد', 'ابراهيم', 'هناء احمد محمد ابراهيم', 'سوداني', 'female', 'active', '240001/24', '0114785233', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-05-13 08:59:28'),
(2, 'علاء', 'غانم', 'محمد', 'الياس', 'علاء غانم محمد الياس', 'سوداني', 'female', 'active', '240002/24', '0117856666', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-05-13 09:02:29'),
(3, 'مهاب', 'خالد', 'احمد', 'ابراهيم', 'مهاب خالد احمد ابراهيم', 'يمني', 'male', 'inactive', '240003/24', '0147855523', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-05-13 09:03:45'),
(4, 'محمد', 'محجوب', 'صالح', 'خالد', 'محمد محجوب صالح خالد', 'سعودي', 'male', 'active', '240004/24', '0948572211', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-05-13 09:13:12'),
(5, 'محمد', 'خير', 'ابراهيم', 'الزغبي', 'محمد خير ابراهيم الزغبي', 'سوري', 'male', 'active', '240005/24', '0147852333', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-05-13 09:14:27'),
(6, 'هاله', 'خالد', 'حسن', 'احمد', 'هاله خالد حسن احمد', 'سوداني', 'female', 'inactive', '25001/24', '0114785963', NULL, 8, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-05-17 09:18:30'),
(7, 'انسام', 'صديق', 'علي', 'هاشم', 'انسام صديق علي هاشم', NULL, NULL, 'active', '240001/241', '0115889966', NULL, 12, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-05-18 07:51:51'),
(8, 'اسماء', 'خالد', 'حسن', 'همد', 'اسماء خالد  حسن همد', 'سوداني', 'female', 'active', '240002/241', '0114785963', NULL, 3, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-05-18 08:00:47'),
(9, 'عبق', 'خالد', 'حسن', 'ابراهيم', 'عبق خالد حسن ابراهيم', 'سوداني', 'female', 'active', '2400032/24', '0115896633', NULL, 13, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-05-18 08:06:04');

-- --------------------------------------------------------

--
-- Table structure for table `student_registrations`
--

CREATE TABLE `student_registrations` (
  `id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `academic_year` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `level_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `term_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `academic_status` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'منتظم',
  `registration_status` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'NUll',
  `receipt_number` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `notes` text CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `repeated_courses` text CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `registrar` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `result_status` tinyint(1) DEFAULT NULL COMMENT '1 = ناجح, 0 = راسب',
  `program_type` enum('diploma','bachelor','postgraduate') CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'bachelor',
  `postgraduate_data` longtext CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `postgraduate_program` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `repeat_count` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `student_registrations`
--

INSERT INTO `student_registrations` (`id`, `student_id`, `academic_year`, `level_name`, `term_name`, `academic_status`, `registration_status`, `receipt_number`, `notes`, `repeated_courses`, `registrar`, `created_at`, `result_status`, `program_type`, `postgraduate_data`, `postgraduate_program`, `repeat_count`) VALUES
(1, 1, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 08:59:28', 1, 'bachelor', NULL, NULL, 0),
(2, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 09:02:29', 0, 'bachelor', NULL, NULL, 0),
(3, 3, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 09:03:45', 1, 'bachelor', NULL, NULL, 0),
(4, 4, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 09:13:12', 1, 'bachelor', NULL, NULL, 0),
(5, 5, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 09:14:27', 1, 'bachelor', NULL, NULL, 0),
(6, 3, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 12:20:39', 1, 'bachelor', NULL, NULL, 0),
(8, 5, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 12:22:31', 1, 'bachelor', NULL, NULL, 0),
(9, 4, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 12:22:31', 1, 'bachelor', NULL, NULL, 0),
(10, 1, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 12:22:31', 1, 'bachelor', NULL, NULL, 0),
(11, 3, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 13:52:56', 1, 'bachelor', NULL, NULL, 0),
(12, 3, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 14:15:15', 1, 'bachelor', NULL, NULL, 0),
(13, 3, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 14:15:28', 1, 'bachelor', NULL, NULL, 0),
(14, 3, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 14:32:00', 1, 'bachelor', NULL, NULL, 0),
(15, 3, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'منتظم', 'مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 14:32:10', 1, 'bachelor', NULL, NULL, 0),
(16, 3, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-13 14:33:14', 1, 'bachelor', NULL, NULL, 0),
(17, 6, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-17 09:18:30', 1, 'postgraduate', '{\"prev_degree\":\"بكالوريوس\",\"prev_university\":\"كلية الشرق\",\"prev_grad_year\":\"2025\",\"study_type\":\"بالكورسات\"}', 'ماجستير ادارة الاعمال', 0),
(18, 6, '2025/2026', 'الدفعة الأولى', 'الفصل الثاني', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-17 09:21:12', 1, 'postgraduate', NULL, 'ماجستير ادارة الاعمال', 0),
(19, 6, '2025/2026', 'الدفعة الأولى', 'الفصل الثالث', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-17 09:21:42', 1, 'postgraduate', NULL, 'ماجستير ادارة الاعمال', 0),
(21, 7, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-18 07:54:16', NULL, 'diploma', NULL, NULL, 0),
(22, 8, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-18 08:00:47', NULL, 'diploma', NULL, NULL, 0),
(23, 9, '2026/2027', 'المستوى الأول', 'الفصل الأول', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-18 08:06:04', NULL, 'bachelor', NULL, NULL, 0),
(26, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'منتظم', 'غير مسجّل', NULL, NULL, NULL, 'kian', '2026-05-18 08:21:07', 1, 'bachelor', NULL, NULL, 0);

-- --------------------------------------------------------

--
-- Table structure for table `term_results`
--

CREATE TABLE `term_results` (
  `id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `faculty_id` int(11) NOT NULL,
  `department_id` int(11) NOT NULL,
  `academic_year` varchar(20) NOT NULL,
  `level_name` varchar(60) NOT NULL,
  `term_name` varchar(50) NOT NULL,
  `program_type` enum('diploma','bachelor','postgraduate') NOT NULL DEFAULT 'bachelor',
  `program_mode` enum('honors','general') NOT NULL DEFAULT 'honors',
  `term_gpa` decimal(4,2) DEFAULT NULL,
  `cumulative_gpa` decimal(4,2) DEFAULT NULL,
  `term_total_points` decimal(10,2) DEFAULT NULL,
  `term_total_hours` decimal(10,2) DEFAULT NULL,
  `classification_label` varchar(255) DEFAULT NULL,
  `courses_count` int(11) DEFAULT 0,
  `completed_courses` int(11) DEFAULT 0,
  `missing_courses` int(11) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `postgraduate_program` varchar(255) DEFAULT NULL,
  `failed_hours` int(11) DEFAULT 0 COMMENT 'ساعات المواد المرسوبة في الفصل',
  `result_status` enum('ناجح','ملحق','إعادة','فصل','فصل (إعادة ثانية)','تعليق دراسة') DEFAULT NULL,
  `recommendation` text DEFAULT NULL,
  `updated_by` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `term_results`
--

INSERT INTO `term_results` (`id`, `student_id`, `faculty_id`, `department_id`, `academic_year`, `level_name`, `term_name`, `program_type`, `program_mode`, `term_gpa`, `cumulative_gpa`, `term_total_points`, `term_total_hours`, `classification_label`, `courses_count`, `completed_courses`, `missing_courses`, `created_at`, `updated_at`, `postgraduate_program`, `failed_hours`, `result_status`, `recommendation`, `updated_by`) VALUES
(1, 2, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 1.41, 1.41, 15.50, 11.00, NULL, 4, 4, 0, '2026-05-13 10:24:31', '2026-05-18 08:16:59', NULL, 6, 'ملحق', NULL, NULL),
(2, 5, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 3.45, 3.45, 38.00, 11.00, 'مرتبة الشرف الثانية (القسم الأول)', 4, 4, 0, '2026-05-13 10:24:31', '2026-05-18 08:16:59', NULL, 0, 'ناجح', NULL, NULL),
(3, 4, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 3.86, 3.86, 42.50, 11.00, 'مرتبة الشرف الأولى', 4, 4, 0, '2026-05-13 10:24:31', '2026-05-18 08:16:59', NULL, 0, 'ناجح', NULL, NULL),
(4, 3, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 3.82, 3.82, 42.00, 11.00, 'مرتبة الشرف الأولى', 4, 4, 0, '2026-05-13 10:24:31', '2026-05-18 08:16:59', NULL, 0, 'ناجح', NULL, NULL),
(5, 1, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', 'honors', 4.00, 4.00, 44.00, 11.00, 'مرتبة الشرف الأولى', 4, 4, 0, '2026-05-13 10:24:31', '2026-05-18 08:16:59', NULL, 0, 'ناجح', NULL, NULL),
(6, 2, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', 'honors', 2.64, 2.64, 29.00, 11.00, 'مرتبة الشرف الثانية (القسم الثاني)', 4, 4, 0, '2026-05-14 08:03:12', '2026-05-18 08:38:42', NULL, 0, 'ناجح', NULL, NULL),
(7, 5, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', 'honors', 3.86, 3.86, 42.50, 11.00, 'مرتبة الشرف الأولى', 4, 4, 0, '2026-05-14 08:03:12', '2026-05-18 08:38:42', NULL, 0, 'ناجح', NULL, NULL),
(8, 4, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', 'honors', 3.05, 3.05, 33.50, 11.00, 'مرتبة الشرف الثانية (القسم الأول)', 4, 4, 0, '2026-05-14 08:03:12', '2026-05-18 08:38:42', NULL, 0, 'ناجح', NULL, NULL),
(9, 3, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', 'honors', 2.55, 2.55, 28.00, 11.00, 'مرتبة الشرف الثانية (القسم الثاني)', 4, 4, 0, '2026-05-14 08:03:12', '2026-05-18 08:38:42', NULL, 0, 'ناجح', NULL, NULL),
(10, 1, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الثاني', 'bachelor', 'honors', 2.77, 2.77, 30.50, 11.00, 'مرتبة الشرف الثانية (القسم الثاني)', 4, 4, 0, '2026-05-14 08:03:12', '2026-05-18 08:38:42', NULL, 0, 'ناجح', NULL, NULL),
(11, 3, 1, 2, '2026/2027', 'المستوى الثاني', 'الفصل الأول', 'bachelor', 'honors', 2.50, 2.98, 22.50, 9.00, 'مرتبة الشرف الثانية (القسم الثاني)', 3, 3, 0, '2026-05-14 08:03:32', '2026-05-14 08:03:32', NULL, 0, 'ناجح', NULL, NULL),
(12, 3, 1, 2, '2026/2027', 'المستوى الثاني', 'الفصل الثاني', 'bachelor', 'honors', 2.75, 3.09, 16.50, 6.00, 'مرتبة الشرف الثانية (القسم الثاني)', 2, 2, 0, '2026-05-14 08:03:37', '2026-05-14 08:03:37', NULL, 0, 'ناجح', NULL, NULL),
(13, 3, 1, 2, '2027/2028', 'المستوى الثالث', 'الفصل الأول', 'bachelor', 'honors', 2.50, 2.89, 12.50, 5.00, 'مرتبة الشرف الثانية (القسم الثاني)', 2, 2, 0, '2026-05-14 08:03:58', '2026-05-14 08:03:58', NULL, 0, 'ناجح', NULL, NULL),
(14, 3, 1, 2, '2027/2028', 'المستوى الثالث', 'الفصل الثاني', 'bachelor', 'honors', 2.50, 2.86, 22.50, 9.00, 'مرتبة الشرف الثانية (القسم الثاني)', 3, 3, 0, '2026-05-14 08:04:01', '2026-05-14 08:04:01', NULL, 0, 'ناجح', NULL, NULL),
(15, 3, 1, 2, '2028/2029', 'المستوى الرابع', 'الفصل الأول', 'bachelor', 'honors', 2.50, 2.79, 15.00, 6.00, 'مرتبة الشرف الثانية (القسم الثاني)', 2, 2, 0, '2026-05-14 08:04:10', '2026-05-14 08:04:10', NULL, 0, 'ناجح', NULL, NULL),
(16, 3, 1, 2, '2028/2029', 'المستوى الرابع', 'الفصل الثاني', 'bachelor', 'honors', 3.25, 2.87, 19.50, 6.00, 'مرتبة الشرف الثانية (القسم الأول)', 2, 2, 0, '2026-05-14 08:04:12', '2026-05-14 08:04:12', NULL, 0, 'ناجح', NULL, NULL),
(17, 6, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'postgraduate', 'general', 3.17, 3.17, 28.50, 9.00, 'جيد جداً', 3, 3, 0, '2026-05-17 09:53:09', '2026-05-17 09:53:09', 'ماجستير ادارة الاعمال', 0, 'ناجح', NULL, NULL),
(18, 6, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الثاني', 'postgraduate', 'general', 3.50, 3.50, 31.50, 9.00, 'ممتاز', 3, 3, 0, '2026-05-17 09:53:19', '2026-05-17 09:53:19', 'ماجستير ادارة الاعمال', 0, 'ناجح', NULL, NULL),
(19, 6, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الثالث', 'postgraduate', 'general', 3.67, 3.67, 33.00, 9.00, 'ممتاز', 3, 3, 0, '2026-05-17 09:53:23', '2026-05-17 09:53:23', 'ماجستير ادارة الاعمال', 0, 'ناجح', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `timetable_sessions`
--

CREATE TABLE `timetable_sessions` (
  `id` int(11) NOT NULL,
  `faculty_id` int(11) NOT NULL,
  `department_id` int(11) NOT NULL,
  `academic_year` varchar(20) NOT NULL,
  `level_name` varchar(50) NOT NULL,
  `term_name` varchar(50) NOT NULL,
  `program_type` enum('diploma','bachelor','postgraduate') NOT NULL DEFAULT 'bachelor',
  `postgraduate_program` varchar(120) DEFAULT NULL,
  `course_id` int(11) NOT NULL,
  `instructor_staff_id` int(11) DEFAULT NULL,
  `instructor_name` varchar(150) DEFAULT NULL,
  `room_id` int(11) NOT NULL,
  `day_of_week` varchar(20) NOT NULL,
  `start_time` time NOT NULL,
  `end_time` time NOT NULL,
  `created_by` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `timetable_sessions`
--

INSERT INTO `timetable_sessions` (`id`, `faculty_id`, `department_id`, `academic_year`, `level_name`, `term_name`, `program_type`, `postgraduate_program`, `course_id`, `instructor_staff_id`, `instructor_name`, `room_id`, `day_of_week`, `start_time`, `end_time`, `created_by`, `created_at`) VALUES
(6, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, 1, NULL, 'د. علي الطيب', 1, 'السبت', '10:00:00', '12:00:00', 'kian', '2026-05-13 10:59:25'),
(7, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, 4, NULL, 'د. علي الطيب', 3, 'الاثنين', '08:00:00', '10:00:00', NULL, '2026-05-13 10:59:44'),
(8, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, 3, NULL, 'د. محمد عادل', 4, 'الأربعاء', '12:00:00', '13:00:00', NULL, '2026-05-13 11:00:10'),
(9, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, 2, NULL, 'د. سارة نبيل', 2, 'السبت', '08:30:00', '10:00:00', 'kian', '2026-05-13 11:01:53'),
(10, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, 2, NULL, 'د. سارة نبيل', 3, 'الخميس', '11:00:00', '13:00:00', NULL, '2026-05-13 11:20:28'),
(12, 1, 2, '2025/2026', 'المستوى الأول', 'الفصل الأول', 'bachelor', NULL, 3, NULL, 'د. محمد عادل', 1, 'الثلاثاء', '08:00:00', '10:00:00', 'kian', '2026-05-13 11:58:42'),
(18, 3, 8, '2025/2026', 'الدفعة الأولى', 'الفصل الأول', 'postgraduate', 'ماجستير ادارة الاعمال', 25, NULL, 'أ. خالد صالح', 1, 'السبت', '08:00:00', '10:00:00', 'kian', '2026-05-17 12:58:24');

--
-- Triggers `timetable_sessions`
--
DELIMITER $$
CREATE TRIGGER `trg_timetable_no_conflicts` BEFORE INSERT ON `timetable_sessions` FOR EACH ROW BEGIN

    -- 1. Instructor Conflict → حسب البرنامج + السنة
    IF NEW.instructor_name IS NOT NULL THEN
        IF EXISTS (
            SELECT 1 FROM timetable_sessions
            WHERE instructor_name = NEW.instructor_name
              AND academic_year   = NEW.academic_year
              AND program_type    = NEW.program_type
              AND (postgraduate_program <=> NEW.postgraduate_program)
              AND day_of_week     = NEW.day_of_week
              AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
        ) THEN
            SIGNAL SQLSTATE '45000'
            SET MESSAGE_TEXT = 'تضارب: الأستاذ لديه محاضرة أخرى في نفس الزمن والبرنامج';
        END IF;
    END IF;

    -- 2. Room Conflict → مهم جداً: حسب البرنامج (بكالوريوس ≠ دراسات عليا)
    IF EXISTS (
        SELECT 1 FROM timetable_sessions
        WHERE room_id           = NEW.room_id
          AND academic_year     = NEW.academic_year
          AND program_type      = NEW.program_type
          AND (postgraduate_program <=> NEW.postgraduate_program)
          AND day_of_week       = NEW.day_of_week
          AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
    ) THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'تضارب: القاعة مشغولة بنفس البرنامج والزمن';
    END IF;

    -- 3. Department + Level Conflict (نحتفظ به كما هو)
    IF EXISTS (
        SELECT 1 FROM timetable_sessions
        WHERE faculty_id    = NEW.faculty_id
          AND department_id = NEW.department_id
          AND level_name    = NEW.level_name
          AND academic_year = NEW.academic_year
          AND term_name     = NEW.term_name
          AND day_of_week   = NEW.day_of_week
          AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
    ) THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'تضارب: نفس القسم والمستوى لديه محاضرة أخرى في نفس الفصل';
    END IF;

END
$$
DELIMITER ;
DELIMITER $$
CREATE TRIGGER `trg_timetable_no_conflicts_update` BEFORE UPDATE ON `timetable_sessions` FOR EACH ROW BEGIN

    -- 1. Instructor Conflict
    IF NEW.instructor_name IS NOT NULL THEN
        IF EXISTS (
            SELECT 1 FROM timetable_sessions
            WHERE instructor_name = NEW.instructor_name
              AND academic_year   = NEW.academic_year
              AND program_type    = NEW.program_type
              AND (postgraduate_program <=> NEW.postgraduate_program)
              AND day_of_week     = NEW.day_of_week
              AND id <> OLD.id
              AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
        ) THEN
            SIGNAL SQLSTATE '45000'
            SET MESSAGE_TEXT = 'تضارب: الأستاذ لديه محاضرة أخرى بعد التعديل';
        END IF;
    END IF;

    -- 2. Room Conflict
    IF EXISTS (
        SELECT 1 FROM timetable_sessions
        WHERE room_id           = NEW.room_id
          AND academic_year     = NEW.academic_year
          AND program_type      = NEW.program_type
          AND (postgraduate_program <=> NEW.postgraduate_program)
          AND day_of_week       = NEW.day_of_week
          AND id <> OLD.id
          AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
    ) THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'تضارب: القاعة مشغولة بعد التعديل';
    END IF;

    -- 3. Department + Level Conflict
    IF EXISTS (
        SELECT 1 FROM timetable_sessions
        WHERE faculty_id    = NEW.faculty_id
          AND department_id = NEW.department_id
          AND level_name    = NEW.level_name
          AND academic_year = NEW.academic_year
          AND term_name     = NEW.term_name
          AND day_of_week   = NEW.day_of_week
          AND id <> OLD.id
          AND NOT (end_time <= NEW.start_time OR start_time >= NEW.end_time)
    ) THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'تضارب: نفس القسم والمستوى بعد التعديل';
    END IF;

END
$$
DELIMITER ;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(100) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `full_name` varchar(150) DEFAULT NULL,
  `email` varchar(150) DEFAULT NULL,
  `department` varchar(100) DEFAULT NULL,
  `role` varchar(50) DEFAULT 'user',
  `is_active` tinyint(1) DEFAULT 1,
  `allowed_pages` text DEFAULT NULL,
  `allowed_program_types` text DEFAULT NULL,
  `allowed_faculties` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `last_login` datetime DEFAULT NULL,
  `registration_tab_permissions` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password_hash`, `full_name`, `email`, `department`, `role`, `is_active`, `allowed_pages`, `allowed_program_types`, `allowed_faculties`, `created_at`, `updated_at`, `last_login`, `registration_tab_permissions`) VALUES
(9, 'kian', '$2b$10$i5t0EynzIA5dqbyDCabISe0qh4CNQi6yWQsxUzrItLwjFri/GQ/wq', NULL, NULL, NULL, 'admin', 1, '[]', '[]', '[]', '2026-03-04 08:25:53', '0000-00-00 00:00:00', NULL, '{}'),
(18, 'mohmmed', '$2b$10$MfHtzSGDW858s71GNGRhnOTW3nRxZhJjIKIr0wj58mo.Bd0e5nGCe', NULL, NULL, 'شؤون الطلاب', 'user', 1, '[\"القبول والتسجيل\"]', '[\"bachelor\",\"diploma\",\"postgraduate\"]', '[3]', '2026-04-05 10:13:13', '0000-00-00 00:00:00', NULL, '{\"single\":true,\"fees\":true,\"promotion\":true,\"failed-courses\":true}'),
(19, 'سهام محمد', '$2b$10$dvtk4OHpPOj7/lNqQHgx.u5bnVkNT4Y4BofG.9ruCVOkRv/22.FlS', NULL, NULL, NULL, 'user', 1, '[\"المكتبة\",\"الجداول الدراسية\",\"القبول والتسجيل\",\"الشهادات\",\"إعدادات النظام الأكاديمي\",\"إدخال الدرجات\",\"حساب النتائج\",\"قوائم الطلاب\",\"أعضاء هيئة التدريس\",\"السجل الأكاديمي\",\"التقارير\"]', '[\"bachelor\",\"diploma\",\"postgraduate\"]', '[3,6,7,5,2,4,1]', '2026-04-14 07:57:49', '0000-00-00 00:00:00', NULL, '{\"promotion\":true,\"single\":true,\"failed-courses\":true,\"fees\":true}'),
(20, 'بلقيس محمد', '$2b$10$lyiMZBBWsXBafi5lFWtjAeaziGEB0YOO402/q0JKO0lwjaH.sGdwO', NULL, NULL, 'الدراسات العليا والبحث العلمى', 'user', 1, '[\"المكتبة\",\"القبول والتسجيل\",\"إعدادات النظام الأكاديمي\",\"إدخال الدرجات\",\"قوائم الطلاب\",\"حساب النتائج\",\"أعضاء هيئة التدريس\",\"المستخدمين والصلاحيات\",\"التقارير\",\"السجل الأكاديمي\",\"الشهادات\",\"الجداول الدراسية\"]', '[\"postgraduate\"]', '[3,1,6,5,2,7,4,9]', '2026-04-23 12:29:08', '0000-00-00 00:00:00', NULL, '{\"promotion\":true,\"single\":true,\"fees\":true}');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `academic_periods`
--
ALTER TABLE `academic_periods`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_period` (`academic_year`,`level_name`,`term_name`,`program_type`,`postgraduate_program`),
  ADD KEY `idx_academic_periods_academic_year` (`academic_year`),
  ADD KEY `idx_academic_periods_level_name` (`level_name`),
  ADD KEY `idx_academic_periods_term_name` (`term_name`),
  ADD KEY `idx_academic_periods_program_type` (`program_type`),
  ADD KEY `idx_academic_periods_postgraduate_program` (`postgraduate_program`),
  ADD KEY `idx_academic_periods_program_type_postgraduate_program` (`program_type`,`postgraduate_program`),
  ADD KEY `idx_ap_year` (`academic_year`),
  ADD KEY `idx_ap_level` (`level_name`),
  ADD KEY `idx_ap_term` (`term_name`),
  ADD KEY `idx_ap_prog_type` (`program_type`),
  ADD KEY `idx_ap_pg_program` (`postgraduate_program`),
  ADD KEY `idx_ap_prog_pg` (`program_type`,`postgraduate_program`),
  ADD KEY `idx_ap_year_prog_pg` (`academic_year`,`program_type`,`postgraduate_program`),
  ADD KEY `idx_ap_year_level_prog` (`academic_year`,`level_name`,`program_type`),
  ADD KEY `idx_academic_periods_year_level_term` (`academic_year`,`level_name`,`term_name`);

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_books_faculty` (`faculty_id`);

--
-- Indexes for table `borrowed_books`
--
ALTER TABLE `borrowed_books`
  ADD PRIMARY KEY (`id`),
  ADD KEY `book_id` (`book_id`);

--
-- Indexes for table `courses`
--
ALTER TABLE `courses`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_courses_filter` (`faculty_id`,`department_id`,`academic_year`,`level_name`,`term_name`),
  ADD KEY `fk_courses_department` (`department_id`),
  ADD KEY `idx_courses_faculty_id` (`faculty_id`),
  ADD KEY `idx_courses_department_id` (`department_id`),
  ADD KEY `idx_courses_academic_year` (`academic_year`),
  ADD KEY `idx_courses_level_name` (`level_name`),
  ADD KEY `idx_courses_term_name` (`term_name`),
  ADD KEY `idx_courses_program_type` (`program_type`),
  ADD KEY `idx_courses_postgraduate_program` (`postgraduate_program`),
  ADD KEY `idx_courses_course_name` (`course_name`),
  ADD KEY `idx_crs_faculty` (`faculty_id`),
  ADD KEY `idx_crs_dept` (`department_id`),
  ADD KEY `idx_crs_year` (`academic_year`),
  ADD KEY `idx_crs_level` (`level_name`),
  ADD KEY `idx_crs_term` (`term_name`),
  ADD KEY `idx_crs_prog` (`program_type`),
  ADD KEY `idx_crs_pg` (`postgraduate_program`),
  ADD KEY `idx_crs_name` (`course_name`),
  ADD KEY `idx_crs_fac_dept` (`faculty_id`,`department_id`),
  ADD KEY `idx_crs_period` (`academic_year`,`level_name`,`term_name`),
  ADD KEY `idx_crs_prog_pg` (`program_type`,`postgraduate_program`),
  ADD KEY `idx_crs_yr_lvl_term` (`academic_year`,`level_name`,`term_name`),
  ADD KEY `idx_crs_fac_yr_lvl` (`faculty_id`,`academic_year`,`level_name`);

--
-- Indexes for table `course_grades`
--
ALTER TABLE `course_grades`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_student_course_attempt` (`student_id`,`course_id`,`attempt_number`),
  ADD KEY `fk_course_grades_student` (`student_id`),
  ADD KEY `fk_course_grades_course` (`course_id`),
  ADD KEY `idx_course_grades_student_id` (`student_id`),
  ADD KEY `idx_course_grades_course_id` (`course_id`),
  ADD KEY `idx_course_grades_attempt_number` (`attempt_number`),
  ADD KEY `idx_course_grades_student_id_course_id` (`student_id`,`course_id`),
  ADD KEY `idx_grd_std_course` (`student_id`,`course_id`),
  ADD KEY `idx_grd_attempt` (`attempt_number`),
  ADD KEY `idx_course_grades_student_course` (`student_id`,`course_id`),
  ADD KEY `idx_course_grades_course` (`course_id`);

--
-- Indexes for table `departments`
--
ALTER TABLE `departments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `faculty_id` (`faculty_id`),
  ADD KEY `idx_departments_faculty_id` (`faculty_id`),
  ADD KEY `idx_departments_department_name` (`department_name`);

--
-- Indexes for table `faculties`
--
ALTER TABLE `faculties`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_faculty_code` (`faculty_code`),
  ADD KEY `idx_faculties_faculty_name` (`faculty_name`);

--
-- Indexes for table `fees`
--
ALTER TABLE `fees`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_student_period` (`student_id`,`academic_year`,`level_name`,`term_name`,`program_type`,`postgraduate_program`),
  ADD UNIQUE KEY `uq_default_period` (`department_id`,`academic_year`,`level_name`,`term_name`,`program_type`,`postgraduate_program`),
  ADD UNIQUE KEY `installment_1_id` (`installment_1_id`),
  ADD UNIQUE KEY `installment_2_id` (`installment_2_id`),
  ADD UNIQUE KEY `installment_3_id` (`installment_3_id`),
  ADD UNIQUE KEY `installment_4_id` (`installment_4_id`),
  ADD UNIQUE KEY `installment_5_id` (`installment_5_id`),
  ADD UNIQUE KEY `installment_6_id` (`installment_6_id`),
  ADD KEY `fk_fees_student` (`student_id`),
  ADD KEY `fk_fees_department` (`department_id`),
  ADD KEY `idx_fees_student_year_level` (`student_id`,`academic_year`,`level_name`),
  ADD KEY `idx_fees_year_level` (`academic_year`,`level_name`),
  ADD KEY `idx_fees_dept_year_level` (`department_id`,`academic_year`,`level_name`),
  ADD KEY `idx_fees_is_synced` (`is_synced`),
  ADD KEY `idx_fees_student_id` (`student_id`);

--
-- Indexes for table `grading_rules`
--
ALTER TABLE `grading_rules`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_grading_rules_faculty` (`faculty_id`),
  ADD KEY `idx_grading_rules_faculty_id` (`faculty_id`),
  ADD KEY `idx_grading_rules_rule_type` (`rule_type`),
  ADD KEY `idx_grading_rules_faculty_id_rule_type` (`faculty_id`,`rule_type`),
  ADD KEY `idx_grd_fac_type` (`faculty_id`,`rule_type`);

--
-- Indexes for table `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `transaction_id` (`transaction_id`),
  ADD KEY `idx_university_year` (`university_id`,`academic_year`),
  ADD KEY `idx_installment` (`university_id`,`academic_year`),
  ADD KEY `idx_status` (`status`),
  ADD KEY `idx_received` (`received_at`);

--
-- Indexes for table `rooms`
--
ALTER TABLE `rooms`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_room_name` (`room_name`),
  ADD KEY `room_name` (`room_name`);

--
-- Indexes for table `staff_members`
--
ALTER TABLE `staff_members`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_staff_code` (`staff_code`),
  ADD UNIQUE KEY `uq_staff_email` (`email`),
  ADD KEY `idx_staff_faculty` (`faculty_id`),
  ADD KEY `idx_staff_department` (`department_id`);

--
-- Indexes for table `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_students_full_name` (`full_name`),
  ADD UNIQUE KEY `idx_students_university_id_unique` (`university_id_for_unique`),
  ADD KEY `fk_students_department` (`department_id`),
  ADD KEY `idx_students_university_id` (`university_id`),
  ADD KEY `idx_std_univ_name` (`university_id`,`full_name`),
  ADD KEY `idx_std_dept_name` (`department_id`,`full_name`),
  ADD KEY `idx_std_univ_dept` (`university_id`,`department_id`),
  ADD KEY `idx_students_dept_status` (`department_id`,`academic_status`),
  ADD KEY `idx_student_id` (`id`);

--
-- Indexes for table `student_registrations`
--
ALTER TABLE `student_registrations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_reg_student` (`student_id`),
  ADD KEY `idx_student_registrations_student_id` (`student_id`),
  ADD KEY `idx_student_registrations_academic_year` (`academic_year`),
  ADD KEY `idx_student_registrations_level_name` (`level_name`),
  ADD KEY `idx_student_registrations_term_name` (`term_name`),
  ADD KEY `idx_student_registrations_program_type` (`program_type`),
  ADD KEY `idx_student_registrations_postgraduate_program` (`postgraduate_program`(191)),
  ADD KEY `idx_student_registrations_registration_status` (`registration_status`),
  ADD KEY `idx_reg_student` (`student_id`),
  ADD KEY `idx_reg_year` (`academic_year`),
  ADD KEY `idx_reg_level` (`level_name`),
  ADD KEY `idx_reg_term` (`term_name`),
  ADD KEY `idx_reg_prog` (`program_type`),
  ADD KEY `idx_reg_pg` (`postgraduate_program`(191)),
  ADD KEY `idx_reg_status` (`registration_status`),
  ADD KEY `idx_reg_std_period` (`student_id`,`academic_year`,`level_name`,`term_name`),
  ADD KEY `idx_reg_prog_pg` (`program_type`,`postgraduate_program`(191)),
  ADD KEY `idx_reg_year_prog` (`academic_year`,`program_type`,`postgraduate_program`(191)),
  ADD KEY `idx_reg_status_year` (`registration_status`,`academic_year`),
  ADD KEY `idx_reg_std_yr_lvl` (`student_id`,`academic_year`,`level_name`),
  ADD KEY `idx_reg_student_period` (`student_id`,`academic_year`,`level_name`,`term_name`),
  ADD KEY `idx_registrations_student_year_level_term` (`student_id`,`academic_year`,`level_name`,`term_name`);

--
-- Indexes for table `term_results`
--
ALTER TABLE `term_results`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_term_result` (`student_id`,`faculty_id`,`department_id`,`academic_year`,`level_name`,`term_name`,`program_type`,`postgraduate_program`,`program_mode`),
  ADD KEY `idx_term_results_student` (`student_id`),
  ADD KEY `idx_res_std_period` (`student_id`,`academic_year`,`level_name`,`term_name`);

--
-- Indexes for table `timetable_sessions`
--
ALTER TABLE `timetable_sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_room_day_time` (`room_id`,`day_of_week`,`start_time`,`end_time`),
  ADD KEY `idx_instructor_day_time` (`instructor_staff_id`,`day_of_week`,`start_time`,`end_time`),
  ADD KEY `idx_scope` (`academic_year`,`term_name`,`program_type`,`postgraduate_program`),
  ADD KEY `idx_ts_room_time` (`academic_year`,`term_name`,`program_type`,`postgraduate_program`,`day_of_week`,`room_id`,`start_time`,`end_time`),
  ADD KEY `idx_ts_instructor_time` (`academic_year`,`term_name`,`program_type`,`postgraduate_program`,`day_of_week`,`instructor_staff_id`,`start_time`,`end_time`),
  ADD KEY `idx_ts_dept_time` (`faculty_id`,`department_id`,`academic_year`,`level_name`,`term_name`,`program_type`,`postgraduate_program`,`day_of_week`,`start_time`,`end_time`),
  ADD KEY `idx_instructor_time` (`instructor_staff_id`,`academic_year`,`term_name`,`program_type`,`day_of_week`,`start_time`,`end_time`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD KEY `idx_users_username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `academic_periods`
--
ALTER TABLE `academic_periods`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=598;

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `borrowed_books`
--
ALTER TABLE `borrowed_books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `courses`
--
ALTER TABLE `courses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT for table `course_grades`
--
ALTER TABLE `course_grades`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=64;

--
-- AUTO_INCREMENT for table `departments`
--
ALTER TABLE `departments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `faculties`
--
ALTER TABLE `faculties`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `fees`
--
ALTER TABLE `fees`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `grading_rules`
--
ALTER TABLE `grading_rules`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=322;

--
-- AUTO_INCREMENT for table `payments`
--
ALTER TABLE `payments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `rooms`
--
ALTER TABLE `rooms`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `staff_members`
--
ALTER TABLE `staff_members`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `students`
--
ALTER TABLE `students`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `student_registrations`
--
ALTER TABLE `student_registrations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `term_results`
--
ALTER TABLE `term_results`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `timetable_sessions`
--
ALTER TABLE `timetable_sessions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `books`
--
ALTER TABLE `books`
  ADD CONSTRAINT `fk_books_faculty` FOREIGN KEY (`faculty_id`) REFERENCES `faculties` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `borrowed_books`
--
ALTER TABLE `borrowed_books`
  ADD CONSTRAINT `borrowed_books_ibfk_1` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`);

--
-- Constraints for table `courses`
--
ALTER TABLE `courses`
  ADD CONSTRAINT `fk_courses_department` FOREIGN KEY (`department_id`) REFERENCES `departments` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_courses_faculty` FOREIGN KEY (`faculty_id`) REFERENCES `faculties` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `course_grades`
--
ALTER TABLE `course_grades`
  ADD CONSTRAINT `fk_course_grades_course` FOREIGN KEY (`course_id`) REFERENCES `courses` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_course_grades_student` FOREIGN KEY (`student_id`) REFERENCES `students` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `departments`
--
ALTER TABLE `departments`
  ADD CONSTRAINT `departments_ibfk_1` FOREIGN KEY (`faculty_id`) REFERENCES `faculties` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `fees`
--
ALTER TABLE `fees`
  ADD CONSTRAINT `fk_fees_department` FOREIGN KEY (`department_id`) REFERENCES `departments` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `fk_fees_student` FOREIGN KEY (`student_id`) REFERENCES `students` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `students`
--
ALTER TABLE `students`
  ADD CONSTRAINT `fk_students_department` FOREIGN KEY (`department_id`) REFERENCES `departments` (`id`);

--
-- Constraints for table `student_registrations`
--
ALTER TABLE `student_registrations`
  ADD CONSTRAINT `fk_reg_student` FOREIGN KEY (`student_id`) REFERENCES `students` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
